[{
    "id": "812",
    "question": "Who are the people who influence the writers of Evenor ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/influenced> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/author",
    "predicate1_mention": "writers",
    "predicate2_uri": "http://dbpedia.org/ontology/influence",
    "predicate2_mention": "influence",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Evenor_(collection)",
    "entity1_mention": "evenor",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "816",
    "question": "What is the mascot of alma mater of John O Moseley?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_O._Moseley> <http://dbpedia.org/property/almaMater> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/almaMater",
    "predicate1_mention": "alma mater",
    "predicate2_uri": "http://dbpedia.org/property/mascot",
    "predicate2_mention": "mascot",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/John_O._Moseley",
    "entity1_mention": "John O Moseley",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "829",
    "question": "How many producers have worked for FremantleMedia productions?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/company> <http://dbpedia.org/resource/FremantleMedia> . ?x <http://dbpedia.org/ontology/producer> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/company",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/producer",
    "predicate2_mention": "producers",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/FremantleMedia",
    "entity1_mention": "fremantlemedia",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "840",
    "question": "How many islands belong to archipelagos located in the pacific?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> . ?uri <http://dbpedia.org/property/archipelago> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>}",
    "sparql_id": "406",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/location",
    "predicate1_mention": "located",
    "predicate2_uri": "http://dbpedia.org/property/archipelago",
    "predicate2_mention": "archipelagos",
    "type_uri": "http://dbpedia.org/ontology/Island",
    "type_mention": "islands",
    "entity1_uri": "http://dbpedia.org/resource/Pacific_Ocean",
    "entity1_mention": "pacific",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "841",
    "question": "How many other important things have been written by the creator of Stuart Alan Jones?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Stuart_Alan_Jones> <http://dbpedia.org/ontology/creator> ?x . ?x <http://dbpedia.org/ontology/notableWork> ?uri  . }",
    "sparql_id": "103",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/creator",
    "predicate1_mention": "creator",
    "predicate2_uri": "http://dbpedia.org/ontology/notableWork",
    "predicate2_mention": "important things",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Stuart_Alan_Jones",
    "entity1_mention": "Stuart Alan Jones",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "842",
    "question": "What is the person known for who is the movie director of Sleepy-Time Squirrel ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sleepy-Time_Squirrel> <http://dbpedia.org/property/director> ?x . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/director",
    "predicate1_mention": "director",
    "predicate2_uri": "http://dbpedia.org/ontology/knownFor",
    "predicate2_mention": "known for",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "person",
    "entity1_uri": "http://dbpedia.org/resource/Sleepy-Time_Squirrel",
    "entity1_mention": "sleepy-time squirrel",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "845",
    "question": "What shows used to air on the channel which was earlier known as The Comedy Central?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/The_Comedy_Channel_(United_States)> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/predecessor",
    "predicate1_mention": "central",
    "predicate2_uri": "http://dbpedia.org/property/distributor",
    "predicate2_mention": "earlier",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/The_Comedy_Channel_(United_States)",
    "entity1_mention": "The Comedy Central",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "858",
    "question": "What subjects does the subsequent work of The Dragons of Eden deal with  ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Dragons_of_Eden> <http://dbpedia.org/ontology/subsequentWork> ?x . ?x <http://dbpedia.org/property/subject> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/subsequentWork",
    "predicate1_mention": "subsequent work",
    "predicate2_uri": "http://dbpedia.org/property/subject",
    "predicate2_mention": "subjects",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/The_Dragons_of_Eden",
    "entity1_mention": "The Dragons of Eden",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "862",
    "question": "what are some units under the US department of navy?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/commandStructure",
    "predicate1_mention": "some units under",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States_Department_of_the_Navy",
    "entity1_mention": "the US department of navy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "869",
    "question": "What is the political party of the of Bengalis ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Bengalis> . ?x <http://dbpedia.org/ontology/party> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/ethnicity",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/party",
    "predicate2_mention": "party",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Bengalis",
    "entity1_mention": "bengalis",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "877",
    "question": "Count all the things licensed as Software as a service.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/license",
    "predicate1_mention": "licensed",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Software_as_a_service",
    "entity1_mention": "Software as a service",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "888",
    "question": "What location country of AH141 is also the nation of malaysia Junior hockey league ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?uri. <http://dbpedia.org/resource/Malaysia_Junior_Hockey_League> <http://dbpedia.org/ontology/country> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/county",
    "predicate1_mention": "location country",
    "predicate2_uri": "http://dbpedia.org/ontology/country",
    "predicate2_mention": "nation",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/AH141",
    "entity1_mention": "ah141",
    "entity2_uri": "http://dbpedia.org/resource/Malaysia_Junior_Hockey_League",
    "entity2_mention": "malaysia Junior hockey league"
},
{
    "id": "893",
    "question": "Does Walt Disney Studio have a subsidiary called Pixar Cascadia ?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/subsidiary",
    "predicate1_mention": "subsidiary",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Walt_Disney_Studios_(division)",
    "entity1_mention": "Walt Disney Studio",
    "entity2_uri": "http://dbpedia.org/resource/Pixar",
    "entity2_mention": "Pixar Cascadia"
},
{
    "id": "897",
    "question": "Who is the leader of the Kriminalpolizei and Ordnungspolizei?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?uri. <http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/leader",
    "predicate1_mention": "leader",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Kriminalpolizei",
    "entity1_mention": "kriminalpolizei",
    "entity2_uri": "http://dbpedia.org/resource/Ordnungspolizei",
    "entity2_mention": "ordnungspolizei"
},
{
    "id": "906",
    "question": "Who is married to Tony Ramo",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/partner",
    "predicate1_mention": "married",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Tony_Romo",
    "entity1_mention": "Tony Ramo",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "907",
    "question": "Which county of Tremont Avenue is also the birth place of Ron Galotti ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tremont_Avenue> <http://dbpedia.org/property/counties> ?uri. <http://dbpedia.org/resource/Ron_Galotti> <http://dbpedia.org/ontology/birthPlace> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/counties",
    "predicate1_mention": "county",
    "predicate2_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate2_mention": "birth place",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Tremont_Avenue",
    "entity1_mention": "tremont avenue",
    "entity2_uri": "http://dbpedia.org/resource/Ron_Galotti",
    "entity2_mention": "Ron Galotti"
},
{
    "id": "909",
    "question": "Who wrote Heroman?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/author",
    "predicate1_mention": "wrote",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Heroman",
    "entity1_mention": "heroman",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "911",
    "question": "Who appointed Joseph Clay and William Cushing to their office?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Joseph_Clay_(Georgia)> <http://dbpedia.org/ontology/appointer> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/appointer",
    "predicate1_mention": "appointed",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Joseph_Clay_(Georgia)",
    "entity1_mention": "joseph clay",
    "entity2_uri": "http://dbpedia.org/resource/William_Cushing",
    "entity2_mention": "william cushing"
},
{
    "id": "912",
    "question": "Was Zambezi originate in the north western province of zambia?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Zambezi> <http://dbpedia.org/property/sourceRegion> <http://dbpedia.org/resource/North-Western_Province,_Zambia> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/sourceRegion",
    "predicate1_mention": "originate in",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Zambezi",
    "entity1_mention": "zambezi",
    "entity2_uri": "http://dbpedia.org/resource/North-Western_Province,_Zambia",
    "entity2_mention": "north western province of zambia"
},
{
    "id": "916",
    "question": "In which war did the units garrisoned at Turin fight?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/garrison> <http://dbpedia.org/resource/Turin> . ?x <http://dbpedia.org/ontology/battle> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/garrison",
    "predicate1_mention": "garrisoned",
    "predicate2_uri": "http://dbpedia.org/ontology/battle",
    "predicate2_mention": "war",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Turin",
    "entity1_mention": "turin",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "921",
    "question": "Which president had lieutenants whose governor was Bill Clinton?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Bill_Clinton> . ?uri <http://dbpedia.org/ontology/lieutenant> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/governor",
    "predicate1_mention": "governor",
    "predicate2_uri": "http://dbpedia.org/ontology/lieutenant",
    "predicate2_mention": "lieutenants",
    "type_uri": "http://dbpedia.org/ontology/President",
    "type_mention": "president",
    "entity1_uri": "http://dbpedia.org/resource/Bill_Clinton",
    "entity1_mention": "Bill Clinton",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "926",
    "question": "Who built the stadium which was rented for the 2013 Copa Centroamericana ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/2013_Copa_Centroamericana> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/tenant",
    "predicate1_mention": "rented",
    "predicate2_uri": "http://dbpedia.org/ontology/builder",
    "predicate2_mention": "built",
    "type_uri": "http://dbpedia.org/ontology/Stadium",
    "type_mention": "stadium",
    "entity1_uri": "http://dbpedia.org/resource/2013_Copa_Centroamericana",
    "entity1_mention": "the 2013 Copa Centroamericana",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "927",
    "question": "Brian Dunkleman is the presenter of what TV show?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Brian_Dunkleman>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/presenter",
    "predicate1_mention": "presenter",
    "predicate2_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "predicate2_mention": "TV show",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Brian_Dunkleman",
    "entity1_mention": "Brian Dunkleman",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "931",
    "question": "Which country's largest city is Lima?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Lima> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/largestCity",
    "predicate1_mention": "largest city",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Lima",
    "entity1_mention": "lima",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "932",
    "question": "List the awards given to the relatives of Gregorios Bernardakis.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/relative",
    "predicate1_mention": "relatives",
    "predicate2_uri": "http://dbpedia.org/ontology/award",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Gregorios_Bernardakis",
    "entity1_mention": "Gregorios Bernardakis",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "933",
    "question": "Count all the games whose distributors are located in America",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/country",
    "predicate1_mention": "located in",
    "predicate2_uri": "http://dbpedia.org/property/distributor",
    "predicate2_mention": "distributors",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States",
    "entity1_mention": "America",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "940",
    "question": "Who is a famous relative of Aaround Van Heemstra?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Aarnoud_van_Heemstra>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/relative",
    "predicate1_mention": "relative",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "Who",
    "entity1_uri": "http://dbpedia.org/resource/Aarnoud_van_Heemstra",
    "entity1_mention": "Aaround Van Heemstra",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "941",
    "question": "List the former partner of the figure skaters whose former choreographer was Igor Shpillband.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerChoreographer> <http://dbpedia.org/resource/Igor_Shpillband> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FigureSkater>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/formerChoreographer",
    "predicate1_mention": "former choreographer",
    "predicate2_uri": "http://dbpedia.org/ontology/formerPartner",
    "predicate2_mention": "former partner",
    "type_uri": "http://dbpedia.org/ontology/FigureSkater",
    "type_mention": "figure skaters",
    "entity1_uri": "http://dbpedia.org/resource/Igor_Shpillband",
    "entity1_mention": "Igor Shpillband",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "945",
    "question": "What is the birth city of the Salford City F.C players ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Salford_City_F.C.> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/team",
    "predicate1_mention": "players",
    "predicate2_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate2_mention": "birth city",
    "type_uri": "http://dbpedia.org/ontology/SoccerPlayer",
    "type_mention": "players",
    "entity1_uri": "http://dbpedia.org/resource/Salford_City_F.C.",
    "entity1_mention": "salford city f.c",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "960",
    "question": "What are the other band members of the band one of current member is Robert De Niro?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Robert_De_Niro> . ?x <http://dbpedia.org/ontology/bandMember> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentMembers",
    "predicate1_mention": "current member",
    "predicate2_uri": "http://dbpedia.org/ontology/bandMember",
    "predicate2_mention": "band members",
    "type_uri": "http://dbpedia.org/ontology/Band",
    "type_mention": "band",
    "entity1_uri": "http://dbpedia.org/resource/Robert_De_Niro",
    "entity1_mention": "Robert De Niro",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "981",
    "question": "How many tenants are there in the Mercedes Benz Superdome?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Mercedes-Benz_Superdome> <http://dbpedia.org/ontology/tenant> ?uri  . }",
    "sparql_id": "102",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/tenant",
    "predicate1_mention": "tenants",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mercedes-Benz_Superdome",
    "entity1_mention": "Mercedes Benz Superdome",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "982",
    "question": "What is the religion of the successor of Chatumongol Sonakul?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/successor",
    "predicate1_mention": "successor",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "religion",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Chatumongol_Sonakul",
    "entity1_mention": "chatumongol sonakul",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "986",
    "question": "Count everyone who was in a youthclub chaired by Josep Maria Bartomeu ?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Josep_Maria_Bartomeu> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/chairman",
    "predicate1_mention": "chaired",
    "predicate2_uri": "http://dbpedia.org/property/youthclubs",
    "predicate2_mention": "youthclub",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Josep_Maria_Bartomeu",
    "entity1_mention": "Josep Maria Bartomeu",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "999",
    "question": "List the awards won by the spouse of Harriet Andersson?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harriet_Andersson> <http://dbpedia.org/ontology/partner> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/partner",
    "predicate1_mention": "andersson",
    "predicate2_uri": "http://dbpedia.org/property/awards",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Harriet_Andersson",
    "entity1_mention": "Harriet Andersson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1001",
    "question": "List the judges of Rising Star which is also the artist of Brad Paisley discography ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rising_Star_(U.S._TV_series)> <http://dbpedia.org/property/judges> ?uri. <http://dbpedia.org/resource/Brad_Paisley_discography> <http://dbpedia.org/property/artist> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/judges",
    "predicate1_mention": "judges",
    "predicate2_uri": "http://dbpedia.org/property/artist",
    "predicate2_mention": "artist",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Rising_Star_(U.S._TV_series)",
    "entity1_mention": "Rising Star",
    "entity2_uri": "http://dbpedia.org/resource/Brad_Paisley_discography",
    "entity2_mention": "Brad Paisley discography"
},
{
    "id": "1009",
    "question": "How many items belong to the Science Fiction genre?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/genre",
    "predicate1_mention": "genre",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Science_fiction",
    "entity1_mention": "science fiction",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1017",
    "question": "In how many countries does the Zurich Affoltern am Albis Zug line go?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/line> <http://dbpedia.org/resource/Z\u00fcrich\u2013Affoltern_am_Albis\u2013Zug_railway_line> . ?x <http://dbpedia.org/ontology/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/line",
    "predicate1_mention": "line",
    "predicate2_uri": "http://dbpedia.org/ontology/country",
    "predicate2_mention": "countries",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Z\u00fcrich\u2013Affoltern_am_Albis\u2013Zug_railway_line",
    "entity1_mention": "Zurich Affoltern am Albis Zug line go",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1020",
    "question": "What is the official residence of the Helen Getachew which is also the place of death of the Haile Selassie Gugsa ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Helen_Getachew> <http://dbpedia.org/ontology/residence> ?uri. <http://dbpedia.org/resource/Haile_Selassie_Gugsa> <http://dbpedia.org/property/placeOfDeath> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/residence",
    "predicate1_mention": "residence",
    "predicate2_uri": "http://dbpedia.org/property/placeOfDeath",
    "predicate2_mention": "place of death",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Helen_Getachew",
    "entity1_mention": "Helen Getachew",
    "entity2_uri": "http://dbpedia.org/resource/Haile_Selassie_Gugsa",
    "entity2_mention": "Haile Selassie Gugsa"
},
{
    "id": "1022",
    "question": "What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._T._Krogh> <http://dbpedia.org/ontology/nationality> ?uri. <http://dbpedia.org/resource/Camilla_Martin> <http://dbpedia.org/ontology/country> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/nationality",
    "predicate1_mention": "nationality",
    "predicate2_uri": "http://dbpedia.org/ontology/country",
    "predicate2_mention": "sovereign state",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/J._T._Krogh",
    "entity1_mention": "J. T. Krogh",
    "entity2_uri": "http://dbpedia.org/resource/Camilla_Martin",
    "entity2_mention": "camilla martin"
},
{
    "id": "1033",
    "question": "Who directed the haunted house and alice in wonderland?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?uri. <http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/director",
    "predicate1_mention": "directed",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Alice's_Wonderland",
    "entity1_mention": "alice in wonderland",
    "entity2_uri": "http://dbpedia.org/resource/The_Haunted_House_(1929_film)",
    "entity2_mention": "haunted house"
}
]