[{
    "id": "511",
    "question": "Give me an estimate of the number of manufacturers whose products are managed by MTR?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR> . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/operator",
    "predicate1_mention": "products",
    "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate2_mention": "manufacturers",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/MTR",
    "entity1_mention": "mtr",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "518",
    "question": "Who all have been in bands which have recorded their work in the Electric Lady Studios?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Electric_Lady_Studios> . ?uri <http://dbpedia.org/property/associatedActs> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/recordedIn",
    "predicate1_mention": "recorded",
    "predicate2_uri": "http://dbpedia.org/property/associatedActs",
    "predicate2_mention": "bands",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "Who",
    "entity1_uri": "http://dbpedia.org/resource/Electric_Lady_Studios",
    "entity1_mention": "Electric Lady Studios",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "522",
    "question": "Which content license of the MSX BASIC is also the profession of the Laura K. Ipsen ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MSX_BASIC> <http://dbpedia.org/property/license> ?uri. <http://dbpedia.org/resource/Laura_K._Ipsen> <http://dbpedia.org/ontology/occupation> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/license",
    "predicate1_mention": "license",
    "predicate2_uri": "http://dbpedia.org/ontology/occupation",
    "predicate2_mention": "profession",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/MSX_BASIC",
    "entity1_mention": "MSX BASIC",
    "entity2_uri": "http://dbpedia.org/resource/Laura_K._Ipsen",
    "entity2_mention": "Laura K. Ipsen"
},
{
    "id": "534",
    "question": "How many albums were released under the Victor Entertainment label?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/label",
    "predicate1_mention": "label",
    "predicate2_uri": "http://dbpedia.org/ontology/Album",
    "predicate2_mention": "albums",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Victor_Entertainment",
    "entity1_mention": "Victor Entertainment",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "535",
    "question": "Does NOAAS Davidson (S 331) have a homeport in Seattle?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/NOAAS_Davidson_(S_331)> <http://dbpedia.org/ontology/homeport> <http://dbpedia.org/resource/Seattle> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/homeport",
    "predicate1_mention": "homeport",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/NOAAS_Davidson_(S_331)",
    "entity1_mention": "NOAAS Davidson (S 331)",
    "entity2_uri": "http://dbpedia.org/resource/Seattle",
    "entity2_mention": "seattle"
},
{
    "id": "540",
    "question": "Which governor of Charles Willing byrd fought the battle of Siege of Fort Recovery ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> . ?uri <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd>  . }",
    "sparql_id": "8",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/battle",
    "predicate1_mention": "battle",
    "predicate2_uri": "http://dbpedia.org/property/governor",
    "predicate2_mention": "governor",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Siege_of_Fort_Recovery",
    "entity1_mention": "Siege of Fort Recovery",
    "entity2_uri": "http://dbpedia.org/resource/Charles_Willing_Byrd",
    "entity2_mention": "Charles Willing byrd"
},
{
    "id": "557",
    "question": "How many movies did Joel Schumacher direct?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Joel_Schumacher>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/director",
    "predicate1_mention": "direct",
    "predicate2_uri": "http://dbpedia.org/ontology/Film",
    "predicate2_mention": "movies",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Joel_Schumacher",
    "entity1_mention": "Joel Schumacher",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "568",
    "question": "List the science fiction shows broadcasted on BBC HD ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction> . ?uri <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/genre",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/network",
    "predicate2_mention": "broadcasted",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/Science_fiction",
    "entity1_mention": "science fiction",
    "entity2_uri": "http://dbpedia.org/resource/BBC_HD",
    "entity2_mention": "bbc hd"
},
{
    "id": "570",
    "question": "What is the division of the companies who make Runes of Magic?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Runes_of_Magic> . ?x <http://dbpedia.org/ontology/division> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/products",
    "predicate1_mention": "make",
    "predicate2_uri": "http://dbpedia.org/ontology/division",
    "predicate2_mention": "division",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "companies",
    "entity1_uri": "http://dbpedia.org/resource/Runes_of_Magic",
    "entity1_mention": "Runes of Magic",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "577",
    "question": "Whose doctoral student is tienne Biler ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/doctoralStudent",
    "predicate1_mention": "doctoral student",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler",
    "entity1_mention": "tienne Biler",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "578",
    "question": "What are some bands originating in London?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/London>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/hometown",
    "predicate1_mention": "originating in",
    "predicate2_uri": "http://dbpedia.org/ontology/Band",
    "predicate2_mention": "bands",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/London",
    "entity1_mention": "london",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "596",
    "question": "Is National Archaeological Museum (Florence) the museum of Chimera of Arezzo?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Chimera_of_Arezzo> <http://dbpedia.org/property/museum> <http://dbpedia.org/resource/National_Archaeological_Museum_(Florence)> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/museum",
    "predicate1_mention": "museum",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Chimera_of_Arezzo",
    "entity1_mention": "Chimera of Arezzo",
    "entity2_uri": "http://dbpedia.org/resource/National_Archaeological_Museum_(Florence)",
    "entity2_mention": "National Archaeological Museum (Florence)"
},
{
    "id": "604",
    "question": "In which city are buildings by Solon Spencer Beman found?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman> . ?x <http://dbpedia.org/property/locationTown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/architect",
    "predicate1_mention": "buildings",
    "predicate2_uri": "http://dbpedia.org/property/locationTown",
    "predicate2_mention": "city",
    "type_uri": "http://dbpedia.org/ontology/Building",
    "type_mention": "buildings",
    "entity1_uri": "http://dbpedia.org/resource/Solon_Spencer_Beman",
    "entity1_mention": "Solon Spencer Beman",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "618",
    "question": "Which countries militaries fought the SFOR battle?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/battles> <http://dbpedia.org/resource/SFOR> . ?x <http://dbpedia.org/ontology/battle> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/battles",
    "predicate1_mention": "fought",
    "predicate2_uri": "http://dbpedia.org/ontology/battle",
    "predicate2_mention": "battle",
    "type_uri": "http://dbpedia.org/ontology/MilitaryPerson",
    "type_mention": "militaries",
    "entity1_uri": "http://dbpedia.org/resource/SFOR",
    "entity1_mention": "sfor",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "620",
    "question": "How many team in Chicago Bulls ?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/team",
    "predicate1_mention": "team",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Chicago_Bulls",
    "entity1_mention": "Chicago Bulls",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "621",
    "question": "How many writers worked on the album Main Course?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Main_Course> . ?x <http://dbpedia.org/property/writer> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/album",
    "predicate1_mention": "album",
    "predicate2_uri": "http://dbpedia.org/property/writer",
    "predicate2_mention": "writers",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Main_Course",
    "entity1_mention": "Main Course",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "622",
    "question": "Count the number of shows whose creators are Jerry Seinfeld and Larry David?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld> . ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David>} ",
    "sparql_id": "107",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/creator",
    "predicate1_mention": "creators",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jerry_Seinfeld",
    "entity1_mention": "Jerry Seinfeld",
    "entity2_uri": "http://dbpedia.org/resource/Larry_David",
    "entity2_mention": "larry david"
},
{
    "id": "631",
    "question": "Which associat of Martin Pugh is also married to Alana Stewert ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Pugh> <http://dbpedia.org/property/associatedActs> ?uri. <http://dbpedia.org/resource/Alana_Stewart> <http://dbpedia.org/ontology/spouse> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/associatedActs",
    "predicate1_mention": "associat",
    "predicate2_uri": "http://dbpedia.org/ontology/spouse",
    "predicate2_mention": "married",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Martin_Pugh",
    "entity1_mention": "martin pugh",
    "entity2_uri": "http://dbpedia.org/resource/Alana_Stewart",
    "entity2_mention": "Alana Stewert"
},
{
    "id": "632",
    "question": "Which stadium's operator works in the Pepsi Center?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Pepsi_Center> . ?uri <http://dbpedia.org/ontology/operator> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/occupation",
    "predicate1_mention": "works in",
    "predicate2_uri": "http://dbpedia.org/ontology/operator",
    "predicate2_mention": "operator",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Pepsi_Center",
    "entity1_mention": "Pepsi Center",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "633",
    "question": "What is the drafted team of the people expected to join toronto marlies?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/prospectTeam> <http://dbpedia.org/resource/Toronto_Marlies> . ?x <http://dbpedia.org/property/draftTeam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/prospectTeam",
    "predicate1_mention": "expected",
    "predicate2_uri": "http://dbpedia.org/property/draftTeam",
    "predicate2_mention": "drafted team",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "people",
    "entity1_uri": "http://dbpedia.org/resource/Toronto_Marlies",
    "entity1_mention": "toronto marlies",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "652",
    "question": "Count the number of schools which are in a city governed by the West Berkshire Council?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> . ?uri <http://dbpedia.org/property/city> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}",
    "sparql_id": "406",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/leaderName",
    "predicate1_mention": "governed",
    "predicate2_uri": "http://dbpedia.org/property/city",
    "predicate2_mention": "city",
    "type_uri": "http://dbpedia.org/ontology/School",
    "type_mention": "schools",
    "entity1_uri": "http://dbpedia.org/resource/West_Berkshire_Council",
    "entity1_mention": "West Berkshire Council",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "655",
    "question": "List some leaders of regions in the Indian Standard Time Zone?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Indian_Standard_Time> . ?x <http://dbpedia.org/ontology/leaderName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/timeZone",
    "predicate1_mention": "time zone",
    "predicate2_uri": "http://dbpedia.org/ontology/leaderName",
    "predicate2_mention": "leaders",
    "type_uri": "http://dbpedia.org/ontology/Place",
    "type_mention": "leaders",
    "entity1_uri": "http://dbpedia.org/resource/Indian_Standard_Time",
    "entity1_mention": "Indian Standard Time",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "656",
    "question": "List the spanish football player in the NYC FC ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/New_York_City_FC> . ?uri <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Spain_national_football_team>  . }",
    "sparql_id": "8",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentclub",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/nationalteam",
    "predicate2_mention": "in",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/New_York_City_FC",
    "entity1_mention": "NYC FC",
    "entity2_uri": "http://dbpedia.org/resource/Spain_national_football_team",
    "entity2_mention": "spanish football player"
},
{
    "id": "665",
    "question": "How many teams have used the stadium which hosted the WCW mayhem?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/WCW_Mayhem> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}",
    "sparql_id": "403",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/venue",
    "predicate1_mention": "hosted",
    "predicate2_uri": "http://dbpedia.org/ontology/tenant",
    "predicate2_mention": "used",
    "type_uri": "http://dbpedia.org/ontology/Stadium",
    "type_mention": "stadium",
    "entity1_uri": "http://dbpedia.org/resource/WCW_Mayhem",
    "entity1_mention": "WCW mayhem",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "668",
    "question": "Was the Army Air Corps honored for the battle of Iraq?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Army_Air_Corps_(United_Kingdom)> <http://dbpedia.org/property/battleHonours> <http://dbpedia.org/resource/Iraq> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/battleHonours",
    "predicate1_mention": "honored for the battle",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Army_Air_Corps_(United_Kingdom)",
    "entity1_mention": "Army Air Corps",
    "entity2_uri": "http://dbpedia.org/resource/Iraq",
    "entity2_mention": "iraq"
},
{
    "id": "669",
    "question": "What is the debut team of the american football player who studied in North Fort Myers High School?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/highschool> <http://dbpedia.org/resource/North_Fort_Myers_High_School> . ?x <http://dbpedia.org/property/debutteam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/highschool",
    "predicate1_mention": "High School",
    "predicate2_uri": "http://dbpedia.org/property/debutteam",
    "predicate2_mention": "debut team",
    "type_uri": "http://dbpedia.org/ontology/AmericanFootballPlayer",
    "type_mention": "american football player",
    "entity1_uri": "http://dbpedia.org/resource/North_Fort_Myers_High_School",
    "entity1_mention": "North Fort Myers High School",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "680",
    "question": "List the sports associated with Mariveles, Bataan?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Mariveles,_Bataan> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/city",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/sport",
    "predicate2_mention": "sports",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mariveles,_Bataan",
    "entity1_mention": "mariveles, bataan",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "706",
    "question": "Who is the spouse of Daniel Gibson? ",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/spouse",
    "predicate1_mention": "spouse",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Daniel_Gibson",
    "entity1_mention": "Daniel Gibson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "731",
    "question": "What are the awards won by the spouse of Liv Ullmann ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liv_Ullmann> <http://dbpedia.org/ontology/partner> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/partner",
    "predicate1_mention": "spouse",
    "predicate2_uri": "http://dbpedia.org/property/awards",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Liv_Ullmann",
    "entity1_mention": "Liv Ullmann",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "742",
    "question": "What appliance Sony made after the success of PlayStation 2?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> . ?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/PlayStation_2>  . }",
    "sparql_id": "8",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate1_mention": "appliance",
    "predicate2_uri": "http://dbpedia.org/ontology/predecessor",
    "predicate2_mention": "success",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Sony",
    "entity1_mention": "sony",
    "entity2_uri": "http://dbpedia.org/resource/PlayStation_2",
    "entity2_mention": "PlayStation 2"
},
{
    "id": "744",
    "question": "How many shows are made by the channels whose predecessor was the Comedy Channel?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/The_Comedy_Channel_(United_States)> . ?uri <http://dbpedia.org/property/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "406",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/predecessor",
    "predicate1_mention": "predecessor",
    "predicate2_uri": "http://dbpedia.org/property/network",
    "predicate2_mention": "channels",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/The_Comedy_Channel_(United_States)",
    "entity1_mention": "the Comedy Channel",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "750",
    "question": "Semnani languages are spoken in which countries?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/languages> <http://dbpedia.org/resource/Semnani_languages>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/languages",
    "predicate1_mention": "languages",
    "predicate2_uri": "http://dbpedia.org/ontology/Country",
    "predicate2_mention": "countries",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Semnani_languages",
    "entity1_mention": "Semnani languages",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "752",
    "question": "Who wrote The Times They Are a-Changin?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/musicBy",
    "predicate1_mention": "wrote",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)",
    "entity1_mention": "The Times They Are a-Changin",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "756",
    "question": "Give me the total number of architect of the buildings whose one of the  architect was Louis D. Astorino?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/architect> <http://dbpedia.org/resource/Louis_D._Astorino> . ?x <http://dbpedia.org/property/architect> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/architect",
    "predicate1_mention": "architect",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Louis_D._Astorino",
    "entity1_mention": "Louis D. Astorino",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "767",
    "question": "What are the television shows whose network's sister station is BBC Two?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/BBC_Two> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/sisterStation",
    "predicate1_mention": "sister station",
    "predicate2_uri": "http://dbpedia.org/ontology/network",
    "predicate2_mention": "network's",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "television",
    "entity1_uri": "http://dbpedia.org/resource/BBC_Two",
    "entity1_mention": "BBC Two",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "773",
    "question": "Who all have been a president of educational institutes in Paud?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paud> . ?x <http://dbpedia.org/property/president> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/location",
    "predicate1_mention": "educational",
    "predicate2_uri": "http://dbpedia.org/property/president",
    "predicate2_mention": "president",
    "type_uri": "http://dbpedia.org/ontology/EducationalInstitution",
    "type_mention": "educational institutes",
    "entity1_uri": "http://dbpedia.org/resource/Paud",
    "entity1_mention": "paud",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "779",
    "question": "Count the awards given to the recepients of the Becket fund for religious liberty.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/award",
    "predicate1_mention": "awards",
    "predicate2_uri": "http://dbpedia.org/property/awards",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty",
    "entity1_mention": "Becket fund for religious liberty",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "805",
    "question": "Which purpose of the Maharashtra Chess Association is Abhijit kunte is also know for ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Maharashtra_Chess_Association> <http://dbpedia.org/property/purpose> ?uri. <http://dbpedia.org/resource/Abhijit_Kunte> <http://dbpedia.org/property/knownFor> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/purpose",
    "predicate1_mention": "purpose",
    "predicate2_uri": "http://dbpedia.org/property/knownFor",
    "predicate2_mention": "know for",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Maharashtra_Chess_Association",
    "entity1_mention": "Maharashtra Chess Association",
    "entity2_uri": "http://dbpedia.org/resource/Abhijit_Kunte",
    "entity2_mention": "abhijit kunte"
},
{
    "id": "809",
    "question": "Who was the president under whom, a governor participated in Shay's rebellion?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Shays'_Rebellion> . ?x <http://dbpedia.org/property/president> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Governor>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/battle",
    "predicate1_mention": "rebellion",
    "predicate2_uri": "http://dbpedia.org/property/president",
    "predicate2_mention": "president",
    "type_uri": "http://dbpedia.org/ontology/Governor",
    "type_mention": "governor",
    "entity1_uri": "http://dbpedia.org/resource/Shays'_Rebellion",
    "entity1_mention": "Shay's rebellion",
    "entity2_uri": "",
    "entity2_mention": ""
}
]