[{
    "id": "1036",
    "question": "Where the club of Kiki Cutter located?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kiki_Cutter> <http://dbpedia.org/property/club> ?x . ?x <http://dbpedia.org/ontology/location> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/club",
    "predicate1_mention": "club",
    "predicate2_uri": "http://dbpedia.org/ontology/location",
    "predicate2_mention": "located",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Kiki_Cutter",
    "entity1_mention": "Kiki Cutter",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1037",
    "question": "Who penned Emma and Jane Austen in Manhatten?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jane_Austen_in_Manhattan> <http://dbpedia.org/ontology/writer> ?uri. <http://dbpedia.org/resource/Emma_(novel)> <http://dbpedia.org/property/author> ?uri . }",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/writer",
    "predicate1_mention": "penned",
    "predicate2_uri": "http://dbpedia.org/property/author",
    "predicate2_mention": "penned",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jane_Austen_in_Manhattan",
    "entity1_mention": "Jane Austen in Manhatten",
    "entity2_uri": "http://dbpedia.org/resource/Emma_(novel)",
    "entity2_mention": "emma"
},
{
    "id": "1052",
    "question": "Is Microsoft office written in C++",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/programmingLanguage",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Microsoft_Office",
    "entity1_mention": "microsoft office",
    "entity2_uri": "http://dbpedia.org/resource/C++",
    "entity2_mention": "c++"
},
{
    "id": "1061",
    "question": "Which university of Alexandre Tichonov is the place of death of Valentin Muratov ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alexandre_Tichonov> <http://dbpedia.org/property/university> ?uri. <http://dbpedia.org/resource/Valentin_Muratov> <http://dbpedia.org/property/placeOfDeath> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/university",
    "predicate1_mention": "university",
    "predicate2_uri": "http://dbpedia.org/property/placeOfDeath",
    "predicate2_mention": "place of death",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Alexandre_Tichonov",
    "entity1_mention": "university of Alexandre Tichonov",
    "entity2_uri": "http://dbpedia.org/resource/Valentin_Muratov",
    "entity2_mention": "valentin muratov"
},
{
    "id": "1067",
    "question": "Which fictional character's portrayer was edited by Roger Barton?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Roger_Barton_(film_editor)> . ?uri <http://dbpedia.org/ontology/portrayer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/editing",
    "predicate1_mention": "edited",
    "predicate2_uri": "http://dbpedia.org/ontology/portrayer",
    "predicate2_mention": "portrayer",
    "type_uri": "http://dbpedia.org/ontology/FictionalCharacter",
    "type_mention": "fictional character's",
    "entity1_uri": "http://dbpedia.org/resource/Roger_Barton_(film_editor)",
    "entity1_mention": "Roger Barton",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1068",
    "question": "Which country does the current team of Darren McNamara belong to?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Darren_McNamara> <http://dbpedia.org/property/currentTeam> ?x . ?x <http://dbpedia.org/ontology/locationCountry> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentTeam",
    "predicate1_mention": "current team",
    "predicate2_uri": "http://dbpedia.org/ontology/locationCountry",
    "predicate2_mention": "country",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Darren_McNamara",
    "entity1_mention": "Darren McNamara",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1093",
    "question": "Name the movies in which music is give by  Laurie Johnson and edited by Anthony Harvey ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Laurie_Johnson> . ?uri <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Anthony_Harvey>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/music",
    "predicate1_mention": "music",
    "predicate2_uri": "http://dbpedia.org/ontology/editing",
    "predicate2_mention": "edited",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movies",
    "entity1_uri": "http://dbpedia.org/resource/Laurie_Johnson",
    "entity1_mention": "Laurie Johnson",
    "entity2_uri": "http://dbpedia.org/resource/Anthony_Harvey",
    "entity2_mention": "anthony harvey"
},
{
    "id": "1104",
    "question": " Count the participants of the NBA.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/league",
    "predicate1_mention": "participants",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/National_Basketball_Association",
    "entity1_mention": "NBA",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1105",
    "question": "How many politicians are in the US Senate?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/order> <http://dbpedia.org/resource/United_States_Senate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/order",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "predicate2_mention": "politicians",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States_Senate",
    "entity1_mention": " the US Senate",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1106",
    "question": "How many players participated in the 2004-05 FC Barcelona season?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/2004\u201305_FC_Barcelona_season> <http://dbpedia.org/property/name> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer>}",
    "sparql_id": "402",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/name",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/SoccerPlayer",
    "predicate2_mention": "players",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/2004\u201305_FC_Barcelona_season",
    "entity1_mention": "the 2004-05 FC Barcelona season",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1137",
    "question": "Count the number of religions followed by Janta Dal members.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/party",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "religions",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Janata_Dal",
    "entity1_mention": "Janta Dal",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1140",
    "question": "Where are the tombs of kings and queens who have died in England?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/placeOfBurial> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/placeOfDeath",
    "predicate1_mention": "died in",
    "predicate2_uri": "http://dbpedia.org/property/placeOfBurial",
    "predicate2_mention": "tombs",
    "type_uri": "http://dbpedia.org/ontology/Royalty",
    "type_mention": "kings and queens",
    "entity1_uri": "http://dbpedia.org/resource/England",
    "entity1_mention": "england",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1162",
    "question": "Name the sports played by Jamiatu Muslim Mindanao?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/athletics",
    "predicate1_mention": "sports",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao",
    "entity1_mention": "Jamiatu Muslim Mindanao",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1179",
    "question": "Name the appliance produced by Foxconn and its OS is provided by PlayStation 3 system software ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> . ?uri <http://dbpedia.org/property/os> <http://dbpedia.org/resource/PlayStation_3_system_software>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate1_mention": "software",
    "predicate2_uri": "http://dbpedia.org/property/os",
    "predicate2_mention": "os",
    "type_uri": "http://dbpedia.org/ontology/InformationAppliance",
    "type_mention": "appliance",
    "entity1_uri": "http://dbpedia.org/resource/Foxconn",
    "entity1_mention": "foxconn",
    "entity2_uri": "http://dbpedia.org/resource/PlayStation_3_system_software",
    "entity2_mention": "PlayStation 3 system software"
},
{
    "id": "1181",
    "question": "Did Alexander Magleby study at the Dartmouth College?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Alexander_Magleby> <http://dbpedia.org/ontology/university> <http://dbpedia.org/resource/Dartmouth_College> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/university",
    "predicate1_mention": "study at",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Alexander_Magleby",
    "entity1_mention": "alexander magleby",
    "entity2_uri": "http://dbpedia.org/resource/Dartmouth_College",
    "entity2_mention": "dartmouth college"
},
{
    "id": "1185",
    "question": "In which city is the sister station of WCSE-LP located ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WCSE-LP> <http://dbpedia.org/property/sisterStations> ?x . ?x <http://dbpedia.org/property/city> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/sisterStations",
    "predicate1_mention": "sister station",
    "predicate2_uri": "http://dbpedia.org/property/city",
    "predicate2_mention": "city",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/WCSE-LP",
    "entity1_mention": "wcse-lp",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1188",
    "question": "Where are the homestadiums of the seasons chaired by Merritt Paulson?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/chairman",
    "predicate1_mention": "chaired",
    "predicate2_uri": "http://dbpedia.org/ontology/homeStadium",
    "predicate2_mention": "homestadiums",
    "type_uri": "http://dbpedia.org/ontology/SoccerClubSeason",
    "type_mention": "seasons",
    "entity1_uri": "http://dbpedia.org/resource/Merritt_Paulson",
    "entity1_mention": "Merritt Paulson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1192",
    "question": "List softwares written in C++ and runs on Mac OS ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS> . ?uri <http://dbpedia.org/ontology/programmingLanguage> <http://dbpedia.org/resource/C++>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/operatingSystem",
    "predicate1_mention": "OS",
    "predicate2_uri": "http://dbpedia.org/ontology/programmingLanguage",
    "predicate2_mention": "written",
    "type_uri": "http://dbpedia.org/ontology/Software",
    "type_mention": "softwares",
    "entity1_uri": "http://dbpedia.org/resource/Mac_OS",
    "entity1_mention": "mac os",
    "entity2_uri": "http://dbpedia.org/resource/C++",
    "entity2_mention": "c++"
},
{
    "id": "1195",
    "question": "How many have former teams as Indianapolis Colts and Carolina Panthers?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Indianapolis_Colts> . ?uri <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Carolina_Panthers>} ",
    "sparql_id": "107",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/formerTeam",
    "predicate1_mention": "former teams",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Indianapolis_Colts",
    "entity1_mention": "indianapolis colts",
    "entity2_uri": "http://dbpedia.org/resource/Carolina_Panthers",
    "entity2_mention": "Carolina Panthers"
},
{
    "id": "1207",
    "question": "Is lion an animal?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/kingdom",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Lion",
    "entity1_mention": "lion",
    "entity2_uri": "http://dbpedia.org/resource/Animal",
    "entity2_mention": "animal"
},
{
    "id": "1211",
    "question": "What is the religion of the political party which is an international party of Hamas?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hamas> <http://dbpedia.org/property/international> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/PoliticalParty>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/international",
    "predicate1_mention": "international",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "religion",
    "type_uri": "http://dbpedia.org/ontology/PoliticalParty",
    "type_mention": "political party",
    "entity1_uri": "http://dbpedia.org/resource/Hamas",
    "entity1_mention": "hamas",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1226",
    "question": "Count the number of judges who've come on CTV network shows.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/network",
    "predicate1_mention": "network",
    "predicate2_uri": "http://dbpedia.org/property/judges",
    "predicate2_mention": "judges",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/CTV_Television_Network",
    "entity1_mention": "CTV network shows",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1234",
    "question": "?What are the airline hubs of Cascade Airways",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/hubs",
    "predicate1_mention": "hubs",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Cascade_Airways",
    "entity1_mention": "cascade airways",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1245",
    "question": "Name some people working at someplace owned by News Corp.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/owners",
    "predicate1_mention": "owned",
    "predicate2_uri": "http://dbpedia.org/ontology/employer",
    "predicate2_mention": "people working",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/News_Corp",
    "entity1_mention": "News Corp",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1251",
    "question": "What are some products of the company whose parent is BBC?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/parent> <http://dbpedia.org/resource/BBC> . ?x <http://dbpedia.org/property/products> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/parent",
    "predicate1_mention": "parent",
    "predicate2_uri": "http://dbpedia.org/property/products",
    "predicate2_mention": "products",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "company",
    "entity1_uri": "http://dbpedia.org/resource/BBC",
    "entity1_mention": "bbc",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1260",
    "question": "List the books whose authors are in Alcal de Henares.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Alcal\u00e1_de_Henares> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/author",
    "predicate2_mention": "authors",
    "type_uri": "http://dbpedia.org/ontology/Book",
    "type_mention": "books",
    "entity1_uri": "http://dbpedia.org/resource/Alcal\u00e1_de_Henares",
    "entity1_mention": "Alcal de Henares",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1262",
    "question": "what are some journals of academic Philosophy",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/discipline",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Philosophy",
    "entity1_mention": "philosophy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1273",
    "question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/venue",
    "predicate1_mention": "where",
    "predicate2_uri": "http://dbpedia.org/ontology/tenant",
    "predicate2_mention": "tenants",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/SummerSlam_(2004)",
    "entity1_mention": "summer slam 2004",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1278",
    "question": "Where is the origin of Filbert's Old Time Root Beer ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Filbert's_Old_Time_Root_Beer> <http://dbpedia.org/ontology/origin> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/origin",
    "predicate1_mention": "origin",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Filbert's_Old_Time_Root_Beer",
    "entity1_mention": "Filbert's Old Time Root Beer",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1283",
    "question": "Hugh Hefner is editor of which magazine?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/editor> <http://dbpedia.org/resource/Hugh_Hefner>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Magazine>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/editor",
    "predicate1_mention": "editor",
    "predicate2_uri": "http://dbpedia.org/ontology/Magazine",
    "predicate2_mention": "magazine",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Hugh_Hefner",
    "entity1_mention": "Hugh Hefner",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1325",
    "question": "Name the movies written by the group Monty Python ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Monty_Python>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/writer",
    "predicate1_mention": "written",
    "predicate2_uri": "http://dbpedia.org/ontology/Film",
    "predicate2_mention": "movies",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Monty_Python",
    "entity1_mention": "Monty Python",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1344",
    "question": "What did the people buried in Toronto die of?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/restingPlace",
    "predicate1_mention": "buried in",
    "predicate2_uri": "http://dbpedia.org/ontology/deathCause",
    "predicate2_mention": "die of",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Toronto",
    "entity1_mention": "toronto",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1356",
    "question": "Is coffee a main ingredient of Hopje?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Hopje> <http://dbpedia.org/property/mainIngredient> <http://dbpedia.org/resource/Coffee> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/mainIngredient",
    "predicate1_mention": "main ingredient",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Hopje",
    "entity1_mention": "hopje",
    "entity2_uri": "http://dbpedia.org/resource/Coffee",
    "entity2_mention": "coffee"
},
{
    "id": "1368",
    "question": "Count the number of places where alumini of Edinburgh university have died?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/education> <http://dbpedia.org/resource/University_of_Edinburgh> . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/education",
    "predicate1_mention": "edinburgh",
    "predicate2_uri": "http://dbpedia.org/ontology/deathPlace",
    "predicate2_mention": "died",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/University_of_Edinburgh",
    "entity1_mention": "Edinburgh university",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1402",
    "question": "List all the nicknames of the city which has Toru gingerbread as one of it ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nickname> <http://dbpedia.org/resource/Toru\u0144_gingerbread> . ?x <http://dbpedia.org/property/nickname> ?uri  . }",
    "sparql_id": "11",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/nickname",
    "predicate1_mention": "nicknames",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Toru\u0144_gingerbread",
    "entity1_mention": "Toru gingerbread",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1416",
    "question": "Who are some authoritative persons on the matter of Megabalanus concinnus?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Megabalanus_concinnus> <http://dbpedia.org/ontology/binomialAuthority> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/binomialAuthority",
    "predicate1_mention": "authoritative",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Megabalanus_concinnus",
    "entity1_mention": "megabalanus concinnus",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1420",
    "question": "Which famous person is born in Marlboro Township, New Jersey?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Marlboro_Township,_New_Jersey>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/homeTown",
    "predicate1_mention": "is born in",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Marlboro_Township,_New_Jersey",
    "entity1_mention": "Marlboro Township, New Jersey",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1427",
    "question": "Of how many battles is Chickasaw Campaign of 1736 consisted?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chickasaw_Campaign_of_1736> <http://dbpedia.org/property/combatant> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/combatant",
    "predicate1_mention": "battles",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Chickasaw_Campaign_of_1736",
    "entity1_mention": "Chickasaw Campaign of 1736",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1428",
    "question": "Jerry Bock's musicals has been adapted from how many things?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Jerry_Bock> . ?x <http://dbpedia.org/ontology/basedOn> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/music",
    "predicate1_mention": "musicals",
    "predicate2_uri": "http://dbpedia.org/ontology/basedOn",
    "predicate2_mention": "been",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jerry_Bock",
    "entity1_mention": "Jerry Bock's",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1432",
    "question": "Who are the spouse of the parents of Kimberly Stewart?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/ontology/spouse> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/parent",
    "predicate1_mention": "parents",
    "predicate2_uri": "http://dbpedia.org/ontology/spouse",
    "predicate2_mention": "spouse",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Kimberly_Stewart",
    "entity1_mention": "kimberly stewart",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1434",
    "question": "Where were Micheal Santos and Wendy Jaquet born?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_G._Santos> <http://dbpedia.org/ontology/birthPlace> ?uri. <http://dbpedia.org/resource/Wendy_Jaquet> <http://dbpedia.org/property/placeOfBirth> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate1_mention": "born",
    "predicate2_uri": "http://dbpedia.org/property/placeOfBirth",
    "predicate2_mention": "Where",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Michael_G._Santos",
    "entity1_mention": "Micheal Santos",
    "entity2_uri": "http://dbpedia.org/resource/Wendy_Jaquet",
    "entity2_mention": "Wendy Jaquet"
}
]