[{
    "id": "2978",
    "question": "What is the location country of the bank whose successor is Mauritius Bank ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Mauritius_Bank> . ?x <http://dbpedia.org/property/locationCountry> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bank>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/successor",
    "predicate1_mention": "successor",
    "predicate2_uri": "http://dbpedia.org/property/locationCountry",
    "predicate2_mention": "location country",
    "type_uri": "http://dbpedia.org/ontology/Bank",
    "type_mention": "bank",
    "entity1_uri": "http://dbpedia.org/resource/Mauritius_Bank",
    "entity1_mention": "mauritius bank",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2995",
    "question": "List down all the cast members of Tony n' Tina's Wedding ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tony_n'_Tina's_Wedding> <http://dbpedia.org/property/starring> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/starring",
    "predicate1_mention": "cast",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Tony_n'_Tina's_Wedding",
    "entity1_mention": "Tony n' Tina's Wedding",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3000",
    "question": "What is the university whose affiliations is Graham Holdings Company?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Graham_Holdings_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/affiliations",
    "predicate1_mention": "affiliations",
    "predicate2_uri": "http://dbpedia.org/ontology/University",
    "predicate2_mention": "university",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Graham_Holdings_Company",
    "entity1_mention": "Graham Holdings Company",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3002",
    "question": "Name the basketball player who played for Phoenix Suns and Los Angeles Clippers was his draft team?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Phoenix_Suns> . ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Los_Angeles_Clippers>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/team",
    "predicate1_mention": "team",
    "predicate2_uri": "http://dbpedia.org/property/draftTeam",
    "predicate2_mention": "draft team",
    "type_uri": "http://dbpedia.org/ontology/BasketballPlayer",
    "type_mention": "basketball player",
    "entity1_uri": "http://dbpedia.org/resource/Phoenix_Suns",
    "entity1_mention": "phoenix suns",
    "entity2_uri": "http://dbpedia.org/resource/Los_Angeles_Clippers",
    "entity2_mention": "Los Angeles Clippers"
},
{
    "id": "3018",
    "question": "Count the different types of Flatbread ?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Flatbread>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/type",
    "predicate1_mention": "types",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Flatbread",
    "entity1_mention": "flatbread",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3026",
    "question": "Which artist was taught by Jos Ruiz y Blasco?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/training> <http://dbpedia.org/resource/Jos\u00e9_Ruiz_y_Blasco>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/training",
    "predicate1_mention": "taught",
    "predicate2_uri": "http://dbpedia.org/ontology/Artist",
    "predicate2_mention": "artist",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jos\u00e9_Ruiz_y_Blasco",
    "entity1_mention": "Jos Ruiz y Blasco",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3036",
    "question": "Bridge that starts at Seberang Perai crosses over what?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Seberang_Perai> . ?x <http://dbpedia.org/property/crosses> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/routeStart",
    "predicate1_mention": "starts",
    "predicate2_uri": "http://dbpedia.org/property/crosses",
    "predicate2_mention": "crosses",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Seberang_Perai",
    "entity1_mention": "seberang perai",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3043",
    "question": "Which musical artist associated with Tony Allen has label with Celluloid Records ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Allen_(musician)> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/associatedMusicalArtist",
    "predicate1_mention": "musical artist associated",
    "predicate2_uri": "http://dbpedia.org/property/label",
    "predicate2_mention": "label",
    "type_uri": "http://dbpedia.org/ontology/MusicalArtist",
    "type_mention": "musical artist",
    "entity1_uri": "http://dbpedia.org/resource/Tony_Allen_(musician)",
    "entity1_mention": "Tony Allen",
    "entity2_uri": "http://dbpedia.org/resource/Celluloid_Records",
    "entity2_mention": "celluloid records"
},
{
    "id": "3044",
    "question": "Whose labels are Victor Entertainment and Celluloid Records?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records> . }",
    "sparql_id": "7",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/label",
    "predicate1_mention": "labels",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Victor_Entertainment",
    "entity1_mention": "Victor Entertainment",
    "entity2_uri": "http://dbpedia.org/resource/Celluloid_Records",
    "entity2_mention": "Celluloid Records"
},
{
    "id": "3047",
    "question": "Do the west coast airlines fly to seattle?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/West_Coast_Airlines> <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Seattle> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/targetAirport",
    "predicate1_mention": "airlines fly",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/West_Coast_Airlines",
    "entity1_mention": "west coast airlines",
    "entity2_uri": "http://dbpedia.org/resource/Seattle",
    "entity2_mention": "seattle"
},
{
    "id": "3075",
    "question": "List all the former partners of the figure skater whose one of the former partner was Andrea poapst ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerPartner> <http://dbpedia.org/resource/Andrea_Poapst> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FigureSkater>}",
    "sparql_id": "311",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/formerPartner",
    "predicate1_mention": "former partners",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/FigureSkater",
    "type_mention": "figure skater",
    "entity1_uri": "http://dbpedia.org/resource/Andrea_Poapst",
    "entity1_mention": "Andrea poapst",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3076",
    "question": "What river originates in the Connecticut Lakes?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Connecticut_Lakes>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/source",
    "predicate1_mention": "originates",
    "predicate2_uri": "http://dbpedia.org/ontology/River",
    "predicate2_mention": "river",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Connecticut_Lakes",
    "entity1_mention": "connecticut lakes",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "3077",
    "question": "Which band made the song Take me There, and has collaborated with Blayse in the past?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)> <http://dbpedia.org/ontology/musicalBand> ?uri. <http://dbpedia.org/resource/Blayse> <http://dbpedia.org/ontology/associatedBand> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/musicalBand",
    "predicate1_mention": "band",
    "predicate2_uri": "http://dbpedia.org/ontology/associatedBand",
    "predicate2_mention": "collaborated",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)",
    "entity1_mention": "Take me There",
    "entity2_uri": "http://dbpedia.org/resource/Blayse",
    "entity2_mention": "blayse"
},
{
    "id": "3080",
    "question": "In which countries are there banks which came after the National Commercial Bank of Mauritius?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/National_Commercial_Bank_Mauritius> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/property/locationCountry> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bank>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/successor",
    "predicate1_mention": "came after",
    "predicate2_uri": "http://dbpedia.org/property/locationCountry",
    "predicate2_mention": "countries",
    "type_uri": "http://dbpedia.org/ontology/Bank",
    "type_mention": "bank",
    "entity1_uri": "http://dbpedia.org/resource/National_Commercial_Bank_Mauritius",
    "entity1_mention": "National Commercial Bank of Mauritius",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
        "id": "3127",
        "question": "How many movies did Michael Deeley produce?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "sparql_id": "401",
        "classx": "2",
        "predicate1_uri": "http://dbpedia.org/property/producer",
        "predicate1_mention": "produce",
        "predicate2_uri": "http://dbpedia.org/ontology/Film",
        "predicate2_mention": "movies",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Michael_Deeley",
        "entity1_mention": "michael deeley",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3132",
        "question": "Enumerate all the first teams  which were held in Watkins Glen NY?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Watkins_Glen,_New_York> . ?x <http://dbpedia.org/property/firstTeam> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/location",
        "predicate1_mention": "were held in",
        "predicate2_uri": "http://dbpedia.org/property/firstTeam",
        "predicate2_mention": "first teams",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Watkins_Glen,_New_York",
        "entity1_mention": "Watkins Glen NY",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3148",
        "question": "Name the river with source as Columbia Lake and river mouth is located in Clatsop Country ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon> . ?uri <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
        "sparql_id": "308",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/riverMouth",
        "predicate1_mention": "river mouth",
        "predicate2_uri": "http://dbpedia.org/ontology/source",
        "predicate2_mention": "source",
        "type_uri": "http://dbpedia.org/ontology/River",
        "type_mention": "river",
        "entity1_uri": "http://dbpedia.org/resource/Clatsop_County,_Oregon",
        "entity1_mention": "clatsop country",
        "entity2_uri": "http://dbpedia.org/resource/Columbia_Lake",
        "entity2_mention": "columbia lake"
    },
    {
        "id": "3159",
        "question": "Who all have been canonized by Pope Paul VI",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } ",
        "sparql_id": "1",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/canonizedBy",
        "predicate1_mention": "canonized by",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Pope_Paul_VI",
        "entity1_mention": "pope paul vi",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3161",
        "question": "Who produces the trains operated by the MTR?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR> . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>}",
        "sparql_id": "305",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/operator",
        "predicate1_mention": "operated",
        "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
        "predicate2_mention": "mtr",
        "type_uri": "http://dbpedia.org/ontology/Train",
        "type_mention": "trains",
        "entity1_uri": "http://dbpedia.org/resource/MTR",
        "entity1_mention": "mtr",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3162",
        "question": "What religion did the spouse of Richie Aprile follow?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richie_Aprile> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/spouse",
        "predicate1_mention": "spouse",
        "predicate2_uri": "http://dbpedia.org/ontology/religion",
        "predicate2_mention": "religion",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Richie_Aprile",
        "entity1_mention": "richie aprile",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3172",
        "question": "Give me the count of artist in the company whose Artist is Jean Fran\u00e7ois Cot\u00e9 ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }",
        "sparql_id": "111",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/artist",
        "predicate1_mention": "artist",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9",
        "entity1_mention": "Jean Fran\u00e7ois Cot\u00e9",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3187",
        "question": "Which person won Screen actors Guild Life Time Achievement award and has resting place in Palo Alto, California ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Palo_Alto,_California> . ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screen_Actors_Guild_Life_Achievement_Award>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "sparql_id": "308",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/restingPlace",
        "predicate1_mention": "resting place",
        "predicate2_uri": "http://dbpedia.org/ontology/award",
        "predicate2_mention": "award",
        "type_uri": "http://dbpedia.org/ontology/Person",
        "type_mention": "person",
        "entity1_uri": "http://dbpedia.org/resource/Palo_Alto,_California",
        "entity1_mention": "Palo Alto, California",
        "entity2_uri": "http://dbpedia.org/resource/Screen_Actors_Guild_Life_Achievement_Award",
        "entity2_mention": "Screen actors Guild Life Time Achievement award"
    },
    {
        "id": "3188",
        "question": "Give me a list of all the people driving at pole positions in the Grand Prixes where Renault was a first team?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/firstTeam> <http://dbpedia.org/resource/Renault_in_Formula_One> . ?x <http://dbpedia.org/ontology/poleDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}",
        "sparql_id": "305",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/firstTeam",
        "predicate1_mention": "first team",
        "predicate2_uri": "http://dbpedia.org/ontology/poleDriver",
        "predicate2_mention": "people driving at pole positions",
        "type_uri": "http://dbpedia.org/ontology/GrandPrix",
        "type_mention": "grand prixes",
        "entity1_uri": "http://dbpedia.org/resource/Renault_in_Formula_One",
        "entity1_mention": "renault",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3189",
        "question": "Which mainter of Cheasty Boulevard South is also the county seat of the King County, Washingtonsu ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?uri. <http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/maintainedBy",
        "predicate1_mention": "mainter",
        "predicate2_uri": "http://dbpedia.org/ontology/countySeat",
        "predicate2_mention": "county seat",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Cheasty_Boulevard_South",
        "entity1_mention": "cheasty boulevard south",
        "entity2_uri": "http://dbpedia.org/resource/King_County,_Washington",
        "entity2_mention": "King County, Washingtonsu"
    },
    {
        "id": "3196",
        "question": "Which founder of European School, karlsruhe is also the jursdiction of Eurpoean Border of Coast guard ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/European_Border_and_Coast_Guard> <http://dbpedia.org/property/jurisdiction> ?uri. <http://dbpedia.org/resource/European_School,_Karlsruhe> <http://dbpedia.org/property/founder> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/jurisdiction",
        "predicate1_mention": "jursdiction",
        "predicate2_uri": "http://dbpedia.org/property/founder",
        "predicate2_mention": "founder",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/European_Border_and_Coast_Guard",
        "entity1_mention": "Eurpoean Border of Coast guard",
        "entity2_uri": "http://dbpedia.org/resource/European_School,_Karlsruhe",
        "entity2_mention": "european school, karlsruhe"
    },
    {
        "id": "3199",
        "question": "Trevor Peacock has narrated in which movie?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Trevor_Peacock>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "sparql_id": "301",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/narrator",
        "predicate1_mention": "narrated",
        "predicate2_uri": "http://dbpedia.org/ontology/Film",
        "predicate2_mention": "movie",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Trevor_Peacock",
        "entity1_mention": "trevor peacock",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3221",
        "question": "List the common prime minister of the Robert Ray and graham richardson ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Ray_(Australian_politician)> <http://dbpedia.org/ontology/primeMinister> ?uri. <http://dbpedia.org/resource/Graham_Richardson> <http://dbpedia.org/ontology/primeMinister> ?uri . }",
        "sparql_id": "15",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/primeMinister",
        "predicate1_mention": "prime minister",
        "predicate2_uri": "",
        "predicate2_mention": "r",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Robert_Ray_(Australian_politician)",
        "entity1_mention": "robert ray",
        "entity2_uri": "http://dbpedia.org/resource/Graham_Richardson",
        "entity2_mention": "graham richardson"
    },
    {
        "id": "3223",
        "question": "List the common religion affiliation of khadra Haji Ismail and Yasmin khatun ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Khadra_Haji_Ismail_Geid> <http://dbpedia.org/property/religion> ?uri. <http://dbpedia.org/resource/Yasmin_Khatun> <http://dbpedia.org/ontology/religion> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/religion",
        "predicate1_mention": "religion",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Khadra_Haji_Ismail_Geid",
        "entity1_mention": "khadra haji ismail",
        "entity2_uri": "http://dbpedia.org/resource/Yasmin_Khatun",
        "entity2_mention": "yasmin khatun"
    },
    {
        "id": "3226",
        "question": "Cleopatra V of Egypt is father to which royalty?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mother> <http://dbpedia.org/resource/Cleopatra_V_of_Egypt> } ",
        "sparql_id": "1",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/mother",
        "predicate1_mention": "father",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Cleopatra_V_of_Egypt",
        "entity1_mention": "cleopatra v of egypt",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3227",
        "question": "Which founder of sea Gayle Music is also the judge of Rising Star ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sea_Gayle_Music> <http://dbpedia.org/property/founder> ?uri. <http://dbpedia.org/resource/Rising_Star_(U.S._TV_series)> <http://dbpedia.org/property/judges> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/founder",
        "predicate1_mention": "founder",
        "predicate2_uri": "http://dbpedia.org/property/judges",
        "predicate2_mention": "judge",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Sea_Gayle_Music",
        "entity1_mention": "sea Gayle Music",
        "entity2_uri": "http://dbpedia.org/resource/Rising_Star_(U.S._TV_series)",
        "entity2_mention": "rising star"
    },
    {
        "id": "3240",
        "question": "Humes High School is alma mater to which person?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Humes_High_School>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "sparql_id": "301",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/education",
        "predicate1_mention": "alma mater",
        "predicate2_uri": "http://dbpedia.org/ontology/Person",
        "predicate2_mention": "person",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Humes_High_School",
        "entity1_mention": "humes high school",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3248",
        "question": "UEM group have made bridges crossing over what?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/UEM_Group> . ?x <http://dbpedia.org/property/crosses> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/designer",
        "predicate1_mention": "made",
        "predicate2_uri": "http://dbpedia.org/property/crosses",
        "predicate2_mention": "crossing",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/UEM_Group",
        "entity1_mention": "uem group",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3263",
        "question": "Who were the opponents of the people buried in the tower of London?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "sparql_id": "305",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/restingPlace",
        "predicate1_mention": "buried in",
        "predicate2_uri": "http://dbpedia.org/ontology/opponent",
        "predicate2_mention": "opponents",
        "type_uri": "http://dbpedia.org/ontology/Person",
        "type_mention": "people",
        "entity1_uri": "http://dbpedia.org/resource/Tower_of_London",
        "entity1_mention": "tower of london",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3273",
        "question": "What is the currency of the country of Kerguelen Islands?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?x . ?x <http://dbpedia.org/ontology/currency> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/governmentType",
        "predicate1_mention": "country",
        "predicate2_uri": "http://dbpedia.org/ontology/currency",
        "predicate2_mention": "currency",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Kerguelen_Islands",
        "entity1_mention": "kerguelen islands",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3275",
        "question": "For which country did Alexander Lippisch design airplanes?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Alexander_Lippisch> . ?x <http://dbpedia.org/property/nationalOrigin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Aircraft>}",
        "sparql_id": "305",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/designer",
        "predicate1_mention": "design",
        "predicate2_uri": "http://dbpedia.org/property/nationalOrigin",
        "predicate2_mention": "country",
        "type_uri": "http://dbpedia.org/ontology/Aircraft",
        "type_mention": "airplanes",
        "entity1_uri": "http://dbpedia.org/resource/Alexander_Lippisch",
        "entity1_mention": "alexander lippisch",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3279",
        "question": "What is the country whose speaker is Pandikar Amin Mulia?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Pandikar_Amin_Mulia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
        "sparql_id": "301",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/leaderName",
        "predicate1_mention": "speaker",
        "predicate2_uri": "http://dbpedia.org/ontology/Country",
        "predicate2_mention": "country",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Pandikar_Amin_Mulia",
        "entity1_mention": "pandikar amin mulia",
        "entity2_uri": "",
        "entity2_mention": ""
    }
]