[{
    "id": "234",
    "question": "Which label released the movie written by Thomas Meehan?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Thomas_Meehan_(writer)> . ?x <http://dbpedia.org/property/label> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/writer",
    "predicate1_mention": "written",
    "predicate2_uri": "http://dbpedia.org/property/label",
    "predicate2_mention": "label",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movie",
    "entity1_uri": "http://dbpedia.org/resource/Thomas_Meehan_(writer)",
    "entity1_mention": "thomas meehan",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "237",
    "question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/federalState",
    "predicate1_mention": "state",
    "predicate2_uri": "http://dbpedia.org/property/cities",
    "predicate2_mention": "cities",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mecklenburg-Vorpommern",
    "entity1_mention": "Mecklenburg-Vorpommern",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "239",
    "question": "Count the number of actors in Lucy Sullivan Is Getting Married.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }",
    "sparql_id": "102",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/starring",
    "predicate1_mention": "actors",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married",
    "entity1_mention": "Lucy Sullivan Is Getting Married",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "243",
    "question": "Which sports are played in the alma mater of Amitava Datta?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Amitava_Datta> <http://dbpedia.org/property/almaMater> ?x . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/almaMater",
    "predicate1_mention": "alma mater",
    "predicate2_uri": "http://dbpedia.org/ontology/sport",
    "predicate2_mention": "sports",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Amitava_Datta",
    "entity1_mention": "amitava datta",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "245",
    "question": "Count all the scientologists.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/religion",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Scientology",
    "entity1_mention": "scientologists",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "252",
    "question": "In how many  territories were the wars fought where Fusil Gras Mile 1874 were used?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?x . ?x <http://dbpedia.org/ontology/territory> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
    "sparql_id": "403",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/usedInWar",
    "predicate1_mention": "used",
    "predicate2_uri": "http://dbpedia.org/ontology/territory",
    "predicate2_mention": "territories",
    "type_uri": "http://dbpedia.org/ontology/MilitaryConflict",
    "type_mention": "wars",
    "entity1_uri": "http://dbpedia.org/resource/Fusil_Gras_mle_1874",
    "entity1_mention": "Fusil Gras Mile 1874",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "258",
    "question": "Name the company whose one of the product is Pixar Image Computer and has one of the key person as Edwin Catmull?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer> . ?uri <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/product",
    "predicate1_mention": "product",
    "predicate2_uri": "http://dbpedia.org/ontology/keyPerson",
    "predicate2_mention": "key person",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "company",
    "entity1_uri": "http://dbpedia.org/resource/Pixar_Image_Computer",
    "entity1_mention": "Pixar Image Computer",
    "entity2_uri": "http://dbpedia.org/resource/Edwin_Catmull",
    "entity2_mention": "Edwin Catmull"
},
{
    "id": "272",
    "question": "Who was the architect of the stadium currently run by the Pittsburgh Pirates?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/Pittsburgh_Pirates> . ?x <http://dbpedia.org/property/architect> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/operator",
    "predicate1_mention": "run by",
    "predicate2_uri": "http://dbpedia.org/property/architect",
    "predicate2_mention": "architect",
    "type_uri": "http://dbpedia.org/ontology/Stadium",
    "type_mention": "stadium",
    "entity1_uri": "http://dbpedia.org/resource/Pittsburgh_Pirates",
    "entity1_mention": "pittsburgh pirates",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "279",
    "question": "Which branch of american military have both George Siebels jr and Leroy Collins served?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_G._Siebels,_Jr.> <http://dbpedia.org/property/branch> ?uri. <http://dbpedia.org/resource/LeRoy_Collins> <http://dbpedia.org/property/branch> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}",
    "sparql_id": "315",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/branch",
    "predicate1_mention": "branch",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/MilitaryUnit",
    "type_mention": "military",
    "entity1_uri": "http://dbpedia.org/resource/George_G._Siebels,_Jr.",
    "entity1_mention": "George Siebels jr",
    "entity2_uri": "http://dbpedia.org/resource/LeRoy_Collins",
    "entity2_mention": "Leroy Collins"
},
{
    "id": "288",
    "question": "In which branch of the government does James L. McConaughy belong?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/James_L._McConaughy> <http://dbpedia.org/ontology/governor> ?x . ?x <http://dbpedia.org/property/branch> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/governor",
    "predicate1_mention": "government",
    "predicate2_uri": "http://dbpedia.org/property/branch",
    "predicate2_mention": "branch",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/James_L._McConaughy",
    "entity1_mention": "James L. McConaughy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "309",
    "question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/largestCity",
    "predicate1_mention": "biggest town",
    "predicate2_uri": "http://dbpedia.org/property/archipelago",
    "predicate2_mention": "archipelago,",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Papeete",
    "entity1_mention": "papeete",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "318",
    "question": "Eric roth wrote how many screenplays?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/screenplay> <http://dbpedia.org/resource/Eric_Roth>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/screenplay",
    "predicate1_mention": "screenplays",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Eric_Roth",
    "entity1_mention": "Eric roth",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "319",
    "question": "What is the common race of the Martin Molony and race of the Coneygree ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?uri. <http://dbpedia.org/resource/Coneygree> <http://dbpedia.org/property/race> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/race",
    "predicate1_mention": "race",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Martin_Molony",
    "entity1_mention": "Martin Molony",
    "entity2_uri": "http://dbpedia.org/resource/Coneygree",
    "entity2_mention": "coneygree"
},
{
    "id": "342",
    "question": "Paul Morphy compiled journals of which field?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/editor> <http://dbpedia.org/resource/Paul_Morphy> . ?x <http://dbpedia.org/property/discipline> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/editor",
    "predicate1_mention": "compiled",
    "predicate2_uri": "http://dbpedia.org/property/discipline",
    "predicate2_mention": "field",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Paul_Morphy",
    "entity1_mention": "Paul Morphy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "354",
    "question": "Did stan lee narrate the incredible hulk tv show?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/The_Incredible_Hulk_(1982_TV_series)> <http://dbpedia.org/ontology/narrator> <http://dbpedia.org/resource/Stan_Lee> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/narrator",
    "predicate1_mention": "narrate",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/The_Incredible_Hulk_(1982_TV_series)",
    "entity1_mention": "incredible hulk tv",
    "entity2_uri": "http://dbpedia.org/resource/Stan_Lee",
    "entity2_mention": "stan lee"
},
{
    "id": "358",
    "question": "What is the religion of the person who is in the cast of Master's Sun ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Master's_Sun> <http://dbpedia.org/ontology/starring> ?x . ?x <http://dbpedia.org/property/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/starring",
    "predicate1_mention": "cast",
    "predicate2_uri": "http://dbpedia.org/property/religion",
    "predicate2_mention": "religion",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "person",
    "entity1_uri": "http://dbpedia.org/resource/Master's_Sun",
    "entity1_mention": "Master's Sun",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "365",
    "question": "What is the common licence of the Frontaccounting and nUbuntu?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frontaccounting> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/NUbuntu> <http://dbpedia.org/ontology/license> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/license",
    "predicate1_mention": "licence",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Frontaccounting",
    "entity1_mention": "frontaccounting",
    "entity2_uri": "http://dbpedia.org/resource/NUbuntu",
    "entity2_mention": "nubuntu"
},
{
    "id": "366",
    "question": "Which TV shows distributor is Broadcast syndication and developed by Brian Graden ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/Brian_Graden> . ?uri <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Broadcast_syndication>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/developer",
    "predicate1_mention": "developed",
    "predicate2_uri": "http://dbpedia.org/ontology/distributor",
    "predicate2_mention": "distributor",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "TV shows",
    "entity1_uri": "http://dbpedia.org/resource/Brian_Graden",
    "entity1_mention": "brian graden",
    "entity2_uri": "http://dbpedia.org/resource/Broadcast_syndication",
    "entity2_mention": "Broadcast syndication"
},
{
    "id": "372",
    "question": "Name few companies founded in Texas?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/foundationPlace",
    "predicate1_mention": "founded",
    "predicate2_uri": "http://dbpedia.org/ontology/Company",
    "predicate2_mention": "companies",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Texas",
    "entity1_mention": "texas",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "378",
    "question": "What are the books written by the the person who made the Novelas ejemplares?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Novelas_ejemplares> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/notableWork",
    "predicate1_mention": "made",
    "predicate2_uri": "http://dbpedia.org/ontology/author",
    "predicate2_mention": "written",
    "type_uri": "http://dbpedia.org/ontology/Book",
    "type_mention": "books",
    "entity1_uri": "http://dbpedia.org/resource/Novelas_ejemplares",
    "entity1_mention": "Novelas ejemplares",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "387",
    "question": "Which company founded by Fusajiro Yamauchi gives service as Nintendo Network?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Fusajiro_Yamauchi> . ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_Network>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/foundedBy",
    "predicate1_mention": "founded by",
    "predicate2_uri": "http://dbpedia.org/property/services",
    "predicate2_mention": "service",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "company",
    "entity1_uri": "http://dbpedia.org/resource/Fusajiro_Yamauchi",
    "entity1_mention": "Fusajiro Yamauchi",
    "entity2_uri": "http://dbpedia.org/resource/Nintendo_Network",
    "entity2_mention": "nintendo network"
},
{
    "id": "392",
    "question": "What are some US citizens famous for?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/nationality",
    "predicate1_mention": "citizens",
    "predicate2_uri": "http://dbpedia.org/ontology/knownFor",
    "predicate2_mention": "famous for",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States",
    "entity1_mention": "US",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "393",
    "question": "Which genre of books are published by Random House?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> . ?x <http://dbpedia.org/property/subject> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/publisher",
    "predicate1_mention": "published",
    "predicate2_uri": "http://dbpedia.org/property/subject",
    "predicate2_mention": "genre",
    "type_uri": "http://dbpedia.org/ontology/Book",
    "type_mention": "books",
    "entity1_uri": "http://dbpedia.org/resource/Random_House",
    "entity1_mention": "random house",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "401",
    "question": "Who coached the marquet golden eagels during 2013",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/coach",
    "predicate1_mention": "coached",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team",
    "entity1_mention": "marquet golden eagels during 2013",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "406",
    "question": "How many famous people are born in Long Island?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Long_Island>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate1_mention": "are born in",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Long_Island",
    "entity1_mention": "Long Island",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "414",
    "question": "Who is the person who are on the board of Freedom of the City?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/board",
    "predicate1_mention": "board",
    "predicate2_uri": "http://dbpedia.org/ontology/Person",
    "predicate2_mention": "person",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Freedom_of_the_City",
    "entity1_mention": "Freedom of the City",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "416",
    "question": "Which astronauts went on the Gemini 8 mission?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Gemini_8>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/mission",
    "predicate1_mention": "mission",
    "predicate2_uri": "http://dbpedia.org/ontology/Astronaut",
    "predicate2_mention": "astronauts",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Gemini_8",
    "entity1_mention": "Gemini 8",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "420",
    "question": "Does Caroline Augusta Foley Rhys Davids study Buddhism?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Caroline_Augusta_Foley_Rhys_Davids> <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Buddhism> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/field",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Caroline_Augusta_Foley_Rhys_Davids",
    "entity1_mention": "Caroline Augusta Foley Rhys Davids",
    "entity2_uri": "http://dbpedia.org/resource/Buddhism",
    "entity2_mention": "buddhism"
},
{
    "id": "435",
    "question": "Name the chairman of the soccer club for which Mike Salmon currently plays?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mike_Salmon> <http://dbpedia.org/property/currentclub> ?x . ?x <http://dbpedia.org/property/chairman> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentclub",
    "predicate1_mention": "currently",
    "predicate2_uri": "http://dbpedia.org/property/chairman",
    "predicate2_mention": "chairman",
    "type_uri": "http://dbpedia.org/ontology/SoccerClub",
    "type_mention": "soccer club",
    "entity1_uri": "http://dbpedia.org/resource/Mike_Salmon",
    "entity1_mention": "Mike Salmon",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "438",
    "question": "Which draft team of bob Macmillan is also the prospect team of Mikhail Pashnin ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mikhail_Pashnin> <http://dbpedia.org/property/prospectTeam> ?uri. <http://dbpedia.org/resource/Bob_MacMillan> <http://dbpedia.org/property/draftTeam> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/prospectTeam",
    "predicate1_mention": "prospect team",
    "predicate2_uri": "http://dbpedia.org/property/draftTeam",
    "predicate2_mention": "draft team",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mikhail_Pashnin",
    "entity1_mention": "Mikhail Pashnin",
    "entity2_uri": "http://dbpedia.org/resource/Bob_MacMillan",
    "entity2_mention": "bob Macmillan"
},
{
    "id": "460",
    "question": "List the destinations of the airlines which also serves Mediterranean Sea ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Mediterranean_Sea> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>}",
    "sparql_id": "311",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/destinations",
    "predicate1_mention": "destinations",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Airline",
    "type_mention": "airlines",
    "entity1_uri": "http://dbpedia.org/resource/Mediterranean_Sea",
    "entity1_mention": "Mediterranean Sea",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "461",
    "question": "Was the  2d Command and Control Squadron barracked in Colorado?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/2d_Command_and_Control_Squadron> <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Colorado> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/garrison",
    "predicate1_mention": "barracked",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/2d_Command_and_Control_Squadron",
    "entity1_mention": "2d Command and Control Squadron",
    "entity2_uri": "http://dbpedia.org/resource/Colorado",
    "entity2_mention": "colorado"
},
{
    "id": "463",
    "question": "Name the members of youth clubs which have Camp Nou as their homeground.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/ground",
    "predicate1_mention": "homeground",
    "predicate2_uri": "http://dbpedia.org/property/youthclubs",
    "predicate2_mention": "youth clubs",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Camp_Nou",
    "entity1_mention": "camp nou",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "486",
    "question": "How many mammals are in the Chordate phylum?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/phylum",
    "predicate1_mention": "phylum",
    "predicate2_uri": "http://dbpedia.org/ontology/Mammal",
    "predicate2_mention": "mammals",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Chordate",
    "entity1_mention": "chordate",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "487",
    "question": "How many people were opponents of the ones buried in the tower of London?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/restingPlace",
    "predicate1_mention": "buried in",
    "predicate2_uri": "http://dbpedia.org/ontology/opponent",
    "predicate2_mention": "opponents",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "people",
    "entity1_uri": "http://dbpedia.org/resource/Tower_of_London",
    "entity1_mention": "tower of London",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "490",
    "question": "In which country did the planes designed by Ursula Hanle originate?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Ursula_H\u00e4nle> . ?x <http://dbpedia.org/property/nationalOrigin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Aircraft>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/designer",
    "predicate1_mention": "designed",
    "predicate2_uri": "http://dbpedia.org/property/nationalOrigin",
    "predicate2_mention": "originate",
    "type_uri": "http://dbpedia.org/ontology/Aircraft",
    "type_mention": "originate",
    "entity1_uri": "http://dbpedia.org/resource/Ursula_H\u00e4nle",
    "entity1_mention": "Ursula Hanle",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "496",
    "question": "Where did Fort Lauderdale Strikers season of 2016 take place?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2016_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/ground> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/ground",
    "predicate1_mention": "take place",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/2016_Fort_Lauderdale_Strikers_season",
    "entity1_mention": "Fort Lauderdale Strikers season of 2016",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "500",
    "question": "What writers have nationality as Statelessness?  ",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/nationality",
    "predicate1_mention": "nationality",
    "predicate2_uri": "http://dbpedia.org/ontology/Writer",
    "predicate2_mention": "writers",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Statelessness",
    "entity1_mention": "Statelessness",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "505",
    "question": "How many people have written stuff broadcasted on the Tokyo Broadcasting System?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> . ?x <http://dbpedia.org/property/writer> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/network",
    "predicate1_mention": "broadcasted",
    "predicate2_uri": "http://dbpedia.org/property/writer",
    "predicate2_mention": "written",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "people",
    "entity1_uri": "http://dbpedia.org/resource/Tokyo_Broadcasting_System",
    "entity1_mention": "Tokyo Broadcasting System",
    "entity2_uri": "",
    "entity2_mention": ""
}
]