[{
    "id": "2389",
    "question": "Who follow religions led by David Miscavige?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/David_Miscavige> . ?uri <http://dbpedia.org/ontology/religion> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/leaderName",
    "predicate1_mention": "led",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "religions",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/David_Miscavige",
    "entity1_mention": "David Miscavige",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2401",
    "question": "Which royal people are buried in Rome?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/placeOfBurial> <http://dbpedia.org/resource/Rome>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/placeOfBurial",
    "predicate1_mention": "buried",
    "predicate2_uri": "http://dbpedia.org/ontology/Royalty",
    "predicate2_mention": "royal",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Rome",
    "entity1_mention": "rome",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2411",
    "question": "What shows are aired on sister channels of BBC Parliaments",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/BBC_Parliament> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/sisterNames",
    "predicate1_mention": "sister",
    "predicate2_uri": "http://dbpedia.org/ontology/network",
    "predicate2_mention": "aired on",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/BBC_Parliament",
    "entity1_mention": "BBC Parliaments",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2418",
    "question": "Count the  origin of the beverages which have been originated in england /",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/origin",
    "predicate1_mention": "origin",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/England",
    "entity1_mention": "england",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2423",
    "question": "What is the river that falls into North Sea and Thames Estuary?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea> . ?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Thames_Estuary> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "307",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/riverMouth",
    "predicate1_mention": "river that falls into",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/River",
    "type_mention": "river",
    "entity1_uri": "http://dbpedia.org/resource/North_Sea",
    "entity1_mention": "North Sea",
    "entity2_uri": "http://dbpedia.org/resource/Thames_Estuary",
    "entity2_mention": "Thames Estuary"
},
{
    "id": "2425",
    "question": "Name the newspaper owned by Schibsted and headquartered at Stockholm?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted> . ?uri <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/owners",
    "predicate1_mention": "owned",
    "predicate2_uri": "http://dbpedia.org/property/headquarters",
    "predicate2_mention": "headquartered",
    "type_uri": "http://dbpedia.org/ontology/Newspaper",
    "type_mention": "newspaper",
    "entity1_uri": "http://dbpedia.org/resource/Schibsted",
    "entity1_mention": "schibsted",
    "entity2_uri": "http://dbpedia.org/resource/Stockholm",
    "entity2_mention": "stockholm"
},
{
    "id": "2438",
    "question": "How many honorary title are there of the scientists who has  Australian of the Year award  ?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year> . ?x <http://dbpedia.org/ontology/award> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/award",
    "predicate1_mention": "award",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Australian_of_the_Year",
    "entity1_mention": "Australian of the Year award ",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2450",
    "question": "Give me a count of everything made by the company which offers electronical manufacturing too.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/service",
    "predicate1_mention": "offers",
    "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate2_mention": "manufacturing",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Electronics_manufacturing_services",
    "entity1_mention": "electronical manufacturing",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2460",
    "question": "List all the wine regions of the grapes whose one of the wine region is Mississippi ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Mississippi> . ?x <http://dbpedia.org/ontology/wineRegion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>}",
    "sparql_id": "311",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/wineRegion",
    "predicate1_mention": "wine regions",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Grape",
    "type_mention": "grapes",
    "entity1_uri": "http://dbpedia.org/resource/Mississippi",
    "entity1_mention": "mississippi",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2461",
    "question": "Which city was designed by saleen Pator which is also the birth location of Jimmy Diggs ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Saleen_S5S_Raptor> <http://dbpedia.org/property/designer> ?uri. <http://dbpedia.org/resource/Jimmy_Diggs> <http://dbpedia.org/ontology/birthPlace> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/designer",
    "predicate1_mention": "designed",
    "predicate2_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate2_mention": "birth location",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Saleen_S5S_Raptor",
    "entity1_mention": "saleen Pator",
    "entity2_uri": "http://dbpedia.org/resource/Jimmy_Diggs",
    "entity2_mention": "jimmy diggs"
},
{
    "id": "2463",
    "question": "Name the office holder whose theatre is Siege of Fort Recovery and belongs to Indian territory branch ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> . ?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Indiana_Territory>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/battle",
    "predicate1_mention": "theatre",
    "predicate2_uri": "http://dbpedia.org/property/branch",
    "predicate2_mention": "branch",
    "type_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "type_mention": "office holder",
    "entity1_uri": "http://dbpedia.org/resource/Siege_of_Fort_Recovery",
    "entity1_mention": "Siege of Fort Recovery",
    "entity2_uri": "http://dbpedia.org/resource/Indiana_Territory",
    "entity2_mention": "Indian territory"
},
{
    "id": "2471",
    "question": "Which producer of Boeing F/A-18E/F Super Hornet has a key person Dennis Muilenburg ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Dennis_Muilenburg> . ?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Boeing_F/A-18E/F_Super_Hornet>  . }",
    "sparql_id": "8",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/keyPeople",
    "predicate1_mention": "key person",
    "predicate2_uri": "http://dbpedia.org/property/products",
    "predicate2_mention": "producer",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Dennis_Muilenburg",
    "entity1_mention": "Dennis Muilenburg",
    "entity2_uri":"http://dbpedia.org/resource/Boeing_F/A-18E/F_Super_Hornet",
    "entity2_mention": "Boeing F/A-18E/F Super Hornet"
},
{
    "id": "2476",
    "question": "To which party does the politician belong, who was born in Nandurbar?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Nandurbar> . ?x <http://dbpedia.org/ontology/party> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/placeOfBirth",
    "predicate1_mention": "was born in",
    "predicate2_uri": "http://dbpedia.org/ontology/party",
    "predicate2_mention": "party",
    "type_uri": "http://dbpedia.org/ontology/Politician",
    "type_mention": "politician",
    "entity1_uri": "http://dbpedia.org/resource/Nandurbar",
    "entity1_mention": "nandurbar",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2480",
    "question": "What is the city  of the television station whose affiliations is LATV?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/LATV> . ?x <http://dbpedia.org/property/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionStation>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/affiliations",
    "predicate1_mention": "affiliations",
    "predicate2_uri": "http://dbpedia.org/property/city",
    "predicate2_mention": "city",
    "type_uri": "http://dbpedia.org/ontology/TelevisionStation",
    "type_mention": "television station",
    "entity1_uri": "http://dbpedia.org/resource/LATV",
    "entity1_mention": "latv",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2495",
    "question": "What software is developed by GNOWSYS and is licensed by Frontaccounting?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frontaccounting> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/GNOWSYS> <http://dbpedia.org/ontology/developer> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/license",
    "predicate1_mention": "licensed",
    "predicate2_uri": "http://dbpedia.org/ontology/developer",
    "predicate2_mention": "developed",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Frontaccounting",
    "entity1_mention": "frontaccounting",
    "entity2_uri": "http://dbpedia.org/resource/GNOWSYS",
    "entity2_mention": "gnowsys"
},
{
    "id": "2512",
    "question": "Name a few whose live in a place where Indian English is an official language",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/officialLanguage",
    "predicate1_mention": "official language",
    "predicate2_uri": "http://dbpedia.org/ontology/residence",
    "predicate2_mention": "live in a place",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Indian_English",
    "entity1_mention": "Indian English",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2515",
    "question": "What are some Louisiana based models known for?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Louisiana> . ?x <http://dbpedia.org/property/knownFor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Model>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/placeOfBirth",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/knownFor",
    "predicate2_mention": "known for",
    "type_uri": "http://dbpedia.org/ontology/Model",
    "type_mention": "models",
    "entity1_uri": "http://dbpedia.org/resource/Louisiana",
    "entity1_mention": "louisiana",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2521",
    "question": "Where does the publisher of Kathimerini live?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kathimerini> <http://dbpedia.org/ontology/publisher> ?x . ?x <http://dbpedia.org/property/residence> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/publisher",
    "predicate1_mention": "publisher",
    "predicate2_uri": "http://dbpedia.org/property/residence",
    "predicate2_mention": "live",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Kathimerini",
    "entity1_mention": "kathimerini",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2525",
    "question": "What sports are played at institutes affiliated by the Association of Southeast Asian Institutes of Higher Learning?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/affiliation",
    "predicate1_mention": "affiliated",
    "predicate2_uri": "http://dbpedia.org/ontology/sport",
    "predicate2_mention": "sports",
    "type_uri": "http://dbpedia.org/ontology/EducationalInstitution",
    "type_mention": "institutes",
    "entity1_uri": "http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning",
    "entity1_mention": "Association of Southeast Asian Institutes of Higher Learning",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2530",
    "question": "Where can i find salad based food?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/mainIngredient> <http://dbpedia.org/resource/Salad> . ?x <http://dbpedia.org/property/country> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/mainIngredient",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/country",
    "predicate2_mention": "Where",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Salad",
    "entity1_mention": "salad",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2531",
    "question": "What is the name of the television show whose company is Paramount Television and theme music composer is Gary Portnoy?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/Paramount_Television> . ?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Gary_Portnoy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/company",
    "predicate1_mention": "company",
    "predicate2_uri": "http://dbpedia.org/property/themeMusicComposer",
    "predicate2_mention": "theme music composer",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "television show",
    "entity1_uri": "http://dbpedia.org/resource/Paramount_Television",
    "entity1_mention": "Paramount Television",
    "entity2_uri": "http://dbpedia.org/resource/Gary_Portnoy",
    "entity2_mention": "Gary Portnoy"
},
{
    "id": "2574",
    "question": "Which river originate from limerick?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mouthLocation> <http://dbpedia.org/resource/Limerick>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/mouthLocation",
    "predicate1_mention": "originate from",
    "predicate2_uri": "http://dbpedia.org/ontology/River",
    "predicate2_mention": "river",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Limerick",
    "entity1_mention": "limerick",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2579",
    "question": "In which country was GM was first aired which is also the mouth country of Upper Neretva?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Upper_Neretva> <http://dbpedia.org/ontology/mouthCountry> ?uri. <http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)> <http://dbpedia.org/property/firstAired> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/mouthCountry",
    "predicate1_mention": "country",
    "predicate2_uri": "http://dbpedia.org/property/firstAired",
    "predicate2_mention": "first aired",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Upper_Neretva",
    "entity1_mention": "Upper Neretva",
    "entity2_uri": "http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)",
    "entity2_mention": "GM"
},
{
    "id": "2580",
    "question": "What is the hometown of the volleyball player whose club is VC Lokomotiv Novosibirsk ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/VC_Lokomotiv_Novosibirsk> . ?x <http://dbpedia.org/property/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VolleyballPlayer>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/club",
    "predicate1_mention": "club",
    "predicate2_uri": "http://dbpedia.org/property/hometown",
    "predicate2_mention": "hometown",
    "type_uri": "http://dbpedia.org/ontology/VolleyballPlayer",
    "type_mention": "volleyball player",
    "entity1_uri": "http://dbpedia.org/resource/VC_Lokomotiv_Novosibirsk",
    "entity1_mention": "VC Lokomotiv Novosibirsk",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2584",
    "question": "What is the state of the administrative region where Oscoda, Michigan is located?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oscoda,_Michigan> <http://dbpedia.org/ontology/isPartOf> ?x . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/isPartOf",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/state",
    "predicate2_mention": "state",
    "type_uri": "http://dbpedia.org/ontology/AdministrativeRegion",
    "type_mention": "administrative region",
    "entity1_uri": "http://dbpedia.org/resource/Oscoda,_Michigan",
    "entity1_mention": "Oscoda, Michigan",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2586",
    "question": "Which city's foundeer is John Forbes?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/John_Forbes_(British_Army_officer)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/founder",
    "predicate1_mention": "foundeer",
    "predicate2_uri": "http://dbpedia.org/ontology/City",
    "predicate2_mention": "city's",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/John_Forbes_(British_Army_officer)",
    "entity1_mention": "John Forbes",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2598",
    "question": "Was the street dogs of south central narrated by Queen Latifah?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Street_Dogs_of_South_Central> <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Queen_Latifah> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/narrator",
    "predicate1_mention": "narrated",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Street_Dogs_of_South_Central",
    "entity1_mention": "street dogs of south central",
    "entity2_uri": "http://dbpedia.org/resource/Queen_Latifah",
    "entity2_mention": "Queen Latifah"
},
{
    "id": "2599",
    "question": "What fictional character's species is American Pekin duck",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/species",
    "predicate1_mention": "species",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/American_Pekin_duck",
    "entity1_mention": "american pekin duck",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2601",
    "question": "How many books are there whose author's tomb is in Madrid?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Madrid> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
    "sparql_id": "406",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/restingPlace",
    "predicate1_mention": "tomb",
    "predicate2_uri": "http://dbpedia.org/ontology/author",
    "predicate2_mention": "author's",
    "type_uri": "http://dbpedia.org/ontology/Book",
    "type_mention": "books",
    "entity1_uri": "http://dbpedia.org/resource/Madrid",
    "entity1_mention": "madrid",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2605",
    "question": "Purnima Banerjee and Rishang Keishing are politicians of what party ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rishang_Keishing> <http://dbpedia.org/property/party> ?uri. <http://dbpedia.org/resource/Purnima_Banerjee> <http://dbpedia.org/ontology/party> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/party",
    "predicate1_mention": "party",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Rishang_Keishing",
    "entity1_mention": "Rishang Keishing",
    "entity2_uri": "http://dbpedia.org/resource/Purnima_Banerjee",
    "entity2_mention": "Purnima Banerjee"
},
{
    "id": "2619",
    "question": "List the authors of the musicals whose songwriter is Richard M. Sherman.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Richard_M._Sherman> . ?x <http://dbpedia.org/ontology/author> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/musicBy",
    "predicate1_mention": "songwriter",
    "predicate2_uri": "http://dbpedia.org/ontology/author",
    "predicate2_mention": "authors",
    "type_uri": "http://dbpedia.org/ontology/Musical",
    "type_mention": "musicals",
    "entity1_uri": "http://dbpedia.org/resource/Richard_M._Sherman",
    "entity1_mention": "Richard M. Sherman",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2622",
    "question": "What is the name of the information appliance by sony whose predecessor is PlayStation 2?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> . ?uri <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/PlayStation_2>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/predecessor",
    "predicate2_mention": "predecessor",
    "type_uri": "http://dbpedia.org/ontology/InformationAppliance",
    "type_mention": "information appliance",
    "entity1_uri": "http://dbpedia.org/resource/Sony",
    "entity1_mention": "sony",
    "entity2_uri": "http://dbpedia.org/resource/PlayStation_2",
    "entity2_mention": "playstation 2"
},
{
    "id": "2629",
    "question": "Where did ed podolak go to high school",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/highschool",
    "predicate1_mention": "high school",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ed_Podolak",
    "entity1_mention": "ed podolak",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2633",
    "question": "Count all those whose youth club was managed by Luis Enrique.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/manager",
    "predicate1_mention": "managed",
    "predicate2_uri": "http://dbpedia.org/property/youthclubs",
    "predicate2_mention": "youth club",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Luis_Enrique_(footballer)",
    "entity1_mention": "Luis Enrique",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2634",
    "question": "How many areas are led by Willem Alexander?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/leader",
    "predicate1_mention": "led by",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands",
    "entity1_mention": "Willem Alexander",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2650",
    "question": "Which minister was responsible for Kriminalpolizie?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/leader",
    "predicate1_mention": "minister",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Kriminalpolizei",
    "entity1_mention": "Kriminalpolizie",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2652",
    "question": "How many awards have been awarded to people who are buried in Glendale, California?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Glendale,_California> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/restingPlace",
    "predicate1_mention": "buried",
    "predicate2_uri": "http://dbpedia.org/ontology/award",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Glendale,_California",
    "entity1_mention": "Glendale, California",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2653",
    "question": "What is the river whose mouth is in deadsea?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Dead_Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/riverMouth",
    "predicate1_mention": "river whose mouth",
    "predicate2_uri": "http://dbpedia.org/ontology/River",
    "predicate2_mention": "river",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Dead_Sea",
    "entity1_mention": "deadsea",
    "entity2_uri": "",
    "entity2_mention": ""
}
]