[{
    "id": "1440",
    "question": "Name the television show created by CE Webber and also has actor named Companion?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> . ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/C._E._Webber>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/starring",
    "predicate1_mention": "actor",
    "predicate2_uri": "http://dbpedia.org/ontology/creator",
    "predicate2_mention": "created by",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "television show",
    "entity1_uri": "http://dbpedia.org/resource/Companion_(Doctor_Who)",
    "entity1_mention": "companion",
    "entity2_uri": "http://dbpedia.org/resource/C._E._Webber",
    "entity2_mention": "CE Webber"
},
{
    "id": "1448",
    "question": "Which university has chancellor as Nicholas S. Zeppos?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/chancellor> <http://dbpedia.org/resource/Nicholas_S._Zeppos>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/chancellor",
    "predicate1_mention": "chancellor",
    "predicate2_uri": "http://dbpedia.org/ontology/University",
    "predicate2_mention": "university",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Nicholas_S._Zeppos",
    "entity1_mention": "Nicholas S. Zeppos",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1450",
    "question": "How many countries have people participated in the Excelsior Stakes?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/race> <http://dbpedia.org/resource/Excelsior_Stakes> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/race",
    "predicate1_mention": "participated",
    "predicate2_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Excelsior_Stakes",
    "entity1_mention": "excelsior stakes",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1452",
    "question": "List some people who were opponents of someone who was died by hanging? ",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/deathCause> <http://dbpedia.org/resource/Hanging> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/deathCause",
    "predicate1_mention": "died by",
    "predicate2_uri": "http://dbpedia.org/ontology/opponent",
    "predicate2_mention": "opponents",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "people",
    "entity1_uri": "http://dbpedia.org/resource/Hanging",
    "entity1_mention": "hanging",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1455",
    "question": "What is the total number of guests on the show whose theme music is Let me be your star?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Let_Me_Be_Your_Star> . ?x <http://dbpedia.org/property/guests> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/music",
    "predicate1_mention": "theme music",
    "predicate2_uri": "http://dbpedia.org/property/guests",
    "predicate2_mention": "guests",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Let_Me_Be_Your_Star",
    "entity1_mention": "Let me be your star",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1462",
    "question": "What are the movies whose music is composed by Vangelis?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Vangelis>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/musicComposer",
    "predicate1_mention": "composed by",
    "predicate2_uri": "http://dbpedia.org/ontology/Film",
    "predicate2_mention": "movies",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Vangelis",
    "entity1_mention": "vangelis",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1469",
    "question": "What are some primates?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/order",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Primate",
    "entity1_mention": "primates",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1472",
    "question": "Count the different causes of death of Christians.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/religion",
    "predicate1_mention": ".",
    "predicate2_uri": "http://dbpedia.org/ontology/deathCause",
    "predicate2_mention": "causes of death",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Christianity",
    "entity1_mention": "Christians",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1474",
    "question": "Who is the office holder whose deputy was Andrew Peacock and predecessor was Alexander Downer?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/deputy> <http://dbpedia.org/resource/Andrew_Peacock> . ?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Alexander_Downer>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/deputy",
    "predicate1_mention": "deputy",
    "predicate2_uri": "http://dbpedia.org/ontology/predecessor",
    "predicate2_mention": "predecessor",
    "type_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "type_mention": "office holder",
    "entity1_uri": "http://dbpedia.org/resource/Andrew_Peacock",
    "entity1_mention": "Andrew Peacock",
    "entity2_uri": "http://dbpedia.org/resource/Alexander_Downer",
    "entity2_mention": "alexander downer"
},
{
    "id": "1475",
    "question": "Who was the editor of the newspaper owned by the the UK government?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Government_of_the_United_Kingdom> . ?x <http://dbpedia.org/property/editor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/owners",
    "predicate1_mention": "owned",
    "predicate2_uri": "http://dbpedia.org/property/editor",
    "predicate2_mention": "editor",
    "type_uri": "http://dbpedia.org/ontology/Newspaper",
    "type_mention": "newspaper",
    "entity1_uri": "http://dbpedia.org/resource/Government_of_the_United_Kingdom",
    "entity1_mention": "the the UK government",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1480",
    "question": "Which baseball team is owned by Robert Nutting?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Robert_Nutting>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballTeam>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/owner",
    "predicate1_mention": "owned",
    "predicate2_uri": "http://dbpedia.org/ontology/BaseballTeam",
    "predicate2_mention": "baseball team",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Robert_Nutting",
    "entity1_mention": "Robert Nutting",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1485",
    "question": "What are some other services of the company whose service is Onedrive?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/OneDrive> . ?x <http://dbpedia.org/property/services> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/service",
    "predicate1_mention": "service",
    "predicate2_uri": "http://dbpedia.org/property/services",
    "predicate2_mention": "services",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "company",
    "entity1_uri": "http://dbpedia.org/resource/OneDrive",
    "entity1_mention": "onedrive",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1496",
    "question": "Give me the characters who last appeared in Star Wars Episode 3",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/last",
    "predicate1_mention": "last",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith",
    "entity1_mention": "star wars episode 3",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1504",
    "question": "In how many different places can I find Modern Architectural buildings?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/architecturalStyle> <http://dbpedia.org/resource/Modern_architecture> . ?x <http://dbpedia.org/property/address> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/architecturalStyle",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/address",
    "predicate2_mention": "places",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Modern_architecture",
    "entity1_mention": "Modern Architectural",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1506",
    "question": "Which movie produced by Michael Deeley was distributed by Warner Bros ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.> . ?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/distributor",
    "predicate1_mention": "distributed by",
    "predicate2_uri": "http://dbpedia.org/property/producer",
    "predicate2_mention": "produced by",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movie",
    "entity1_uri": "http://dbpedia.org/resource/Warner_Bros.",
    "entity1_mention": "warner bros",
    "entity2_uri": "http://dbpedia.org/resource/Michael_Deeley",
    "entity2_mention": "michael deeley"
},
{
    "id": "1509",
    "question": "For which team did Cam Plante and Doug Acomb both play atleast once?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cam_Plante> <http://dbpedia.org/property/playedFor> ?uri. <http://dbpedia.org/resource/Doug_Acomb> <http://dbpedia.org/property/playedFor> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/playedFor",
    "predicate1_mention": "play",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Cam_Plante",
    "entity1_mention": "Cam Plante",
    "entity2_uri": "http://dbpedia.org/resource/Doug_Acomb",
    "entity2_mention": "Doug Acomb"
},
{
    "id": "1515",
    "question": "Which military commander fought his battle at Fort Gadsen?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/battle",
    "predicate1_mention": "battle",
    "predicate2_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "predicate2_mention": "military commander",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Fort_Gadsden",
    "entity1_mention": "Fort Gadsen",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1523",
    "question": "Which draft team od Dale Mitchell is also the tenant of Master Card center ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)> <http://dbpedia.org/ontology/draftTeam> ?uri. <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/draftTeam",
    "predicate1_mention": "draft team",
    "predicate2_uri": "http://dbpedia.org/property/tenants",
    "predicate2_mention": "tenant",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)",
    "entity1_mention": "Dale Mitchell",
    "entity2_uri": "http://dbpedia.org/resource/MasterCard_Centre",
    "entity2_mention": "Master Card center"
},
{
    "id": "1532",
    "question": "Which cities are located around the sea into which the ionian flows?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ionian_Sea> <http://dbpedia.org/ontology/outflow> ?x . ?x <http://dbpedia.org/property/cities> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/outflow",
    "predicate1_mention": "flows",
    "predicate2_uri": "http://dbpedia.org/property/cities",
    "predicate2_mention": "cities",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ionian_Sea",
    "entity1_mention": "ionian",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1536",
    "question": "Who all are buried in Arlington national cementary?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/placeofburial> <http://dbpedia.org/resource/Arlington_National_Cemetery> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/placeofburial",
    "predicate1_mention": "buried in",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Arlington_National_Cemetery",
    "entity1_mention": "Arlington national cementary",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1545",
    "question": "In which areas can we find the networks owned by the govt of Mauritius?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Government_of_Mauritius> . ?x <http://dbpedia.org/property/broadcastArea> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BroadcastNetwork>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/owningCompany",
    "predicate1_mention": "owned by",
    "predicate2_uri": "http://dbpedia.org/property/broadcastArea",
    "predicate2_mention": "areas",
    "type_uri": "http://dbpedia.org/ontology/BroadcastNetwork",
    "type_mention": "networks",
    "entity1_uri": "http://dbpedia.org/resource/Government_of_Mauritius",
    "entity1_mention": "the govt of Mauritius",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1554",
    "question": "Who is the mfr. of the engine used in Ford Transit ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Transit> <http://dbpedia.org/property/engine> ?x . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Engine>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/engine",
    "predicate1_mention": "engine",
    "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate2_mention": "mfr.",
    "type_uri": "http://dbpedia.org/ontology/Engine",
    "type_mention": "engine",
    "entity1_uri": "http://dbpedia.org/resource/Ford_Transit",
    "entity1_mention": "Ford Transit",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1557",
    "question": "Which division of Serbia national team is also the region of Dobinsk Ice Cave ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?uri. <http://dbpedia.org/resource/Dob\u0161insk\u00e1_Ice_Cave> <http://dbpedia.org/ontology/region> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/division",
    "predicate1_mention": "division",
    "predicate2_uri": "http://dbpedia.org/ontology/region",
    "predicate2_mention": "region",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Serbia_national_American_football_team",
    "entity1_mention": "Serbia national team",
    "entity2_uri": "http://dbpedia.org/resource/Dob\u0161insk\u00e1_Ice_Cave",
    "entity2_mention": "Dobinsk Ice Cave"
},
{
    "id": "1558",
    "question": "Name the common current team of the Shaun Thong and Kaannder ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shaun_Thong> <http://dbpedia.org/property/currentTeam> ?uri. <http://dbpedia.org/resource/Kaan_\u00d6nder> <http://dbpedia.org/property/currentTeam> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentTeam",
    "predicate1_mention": "current team",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Shaun_Thong",
    "entity1_mention": "Shaun Thong",
    "entity2_uri": "http://dbpedia.org/resource/Kaan_\u00d6nder",
    "entity2_mention": "Kaannder"
},
{
    "id": "1575",
    "question": "In how many nations is Coconut a common food ingredient?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> . ?x <http://dbpedia.org/property/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/ingredient",
    "predicate1_mention": "ingredient",
    "predicate2_uri": "http://dbpedia.org/property/country",
    "predicate2_mention": "nations",
    "type_uri": "http://dbpedia.org/ontology/Country",
    "type_mention": "nations",
    "entity1_uri": "http://dbpedia.org/resource/Coconut",
    "entity1_mention": "coconut",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1582",
    "question": "Give me some shows related to the ones created by Russell Davies",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Russell_T_Davies> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/creator",
    "predicate1_mention": "created",
    "predicate2_uri": "http://dbpedia.org/ontology/related",
    "predicate2_mention": "related",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/Russell_T_Davies",
    "entity1_mention": "russell davies",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1583",
    "question": "List the total number of regions of the building whose are located in Grand Forks Air Force Base?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base> . ?x <http://dbpedia.org/ontology/region> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/region",
    "predicate1_mention": "regions",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Grand_Forks_Air_Force_Base",
    "entity1_mention": "Grand Forks Air Force Base",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1584",
    "question": "Where is the headquarters of the company which runs the Metro Blue Line in minnesota?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Metro_Blue_Line_(Minnesota)> <http://dbpedia.org/property/operator> ?x . ?x <http://dbpedia.org/property/headquarters> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/operator",
    "predicate1_mention": "metro",
    "predicate2_uri": "http://dbpedia.org/property/headquarters",
    "predicate2_mention": "headquarters",
    "type_uri": "http://dbpedia.org/ontology/Organisation",
    "type_mention": "runs",
    "entity1_uri": "http://dbpedia.org/resource/Metro_Blue_Line_(Minnesota)",
    "entity1_mention": "Metro Blue Line in minnesota",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1587",
    "question": "Count the different alma maters of people employed by the CNN",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/employer",
    "predicate1_mention": "employed",
    "predicate2_uri": "http://dbpedia.org/ontology/almaMater",
    "predicate2_mention": "alma maters",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/CNN",
    "entity1_mention": "cnn",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1602",
    "question": "Name the person with opponents Ike Clanton and Tom McLaury?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> . ?uri <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Tom_McLaury> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "307",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/opponent",
    "predicate1_mention": "opponents",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "person",
    "entity1_uri": "http://dbpedia.org/resource/Ike_Clanton",
    "entity1_mention": "Ike Clanton",
    "entity2_uri": "http://dbpedia.org/resource/Tom_McLaury",
    "entity2_mention": "Tom McLaury"
},
{
    "id": "1610",
    "question": "Where is the successor of john waldo from?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/John_B._Waldo> . ?x <http://dbpedia.org/property/state> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/successor",
    "predicate1_mention": "successor",
    "predicate2_uri": "http://dbpedia.org/property/state",
    "predicate2_mention": "Where",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/John_B._Waldo",
    "entity1_mention": "john waldo",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1616",
    "question": "List everything in which saxophone players have been casted.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/instrument",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/starring",
    "predicate2_mention": "casted",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Saxophone",
    "entity1_mention": "saxophone",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1627",
    "question": "To what region is Sukhumbhand Paribatra, a leader?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/leaderName",
    "predicate1_mention": "leader",
    "predicate2_uri": "http://dbpedia.org/ontology/Region",
    "predicate2_mention": "region",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Sukhumbhand_Paribatra",
    "entity1_mention": "Sukhumbhand Paribatra",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1628",
    "question": "Where was Picasso Last Words recorded ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Picasso's_Last_Words_(Drink_to_Me)> <http://dbpedia.org/property/recorded> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/recorded",
    "predicate1_mention": "recorded",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Picasso's_Last_Words_(Drink_to_Me)",
    "entity1_mention": "Picasso Last Words recorded",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1630",
    "question": "For how many movies have the music composer composed music, who have collaborated with Yes ?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Yes_(band)> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "406",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/associatedMusicalArtist",
    "predicate1_mention": "music",
    "predicate2_uri": "http://dbpedia.org/ontology/musicComposer",
    "predicate2_mention": "music composer",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movies",
    "entity1_uri": "http://dbpedia.org/resource/Yes_(band)",
    "entity1_mention": "yes",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1634",
    "question": "What is the total number of other nearest countries to the lakes whose nearest countries is Uganda?",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda> . ?x <http://dbpedia.org/ontology/nearestCity> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/nearestCity",
    "predicate1_mention": "nearest countries",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Uganda",
    "entity1_mention": "uganda",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1644",
    "question": "Which education institute of Duncan U. Fletcher is also the university of Vanderbilt Commodores ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Duncan_U._Fletcher> <http://dbpedia.org/ontology/almaMater> ?uri. <http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/almaMater",
    "predicate1_mention": "education institute",
    "predicate2_uri": "http://dbpedia.org/ontology/university",
    "predicate2_mention": "university",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Duncan_U._Fletcher",
    "entity1_mention": "Duncan U. Fletcher",
    "entity2_uri": "http://dbpedia.org/resource/Vanderbilt_Commodores",
    "entity2_mention": "vanderbilt commodores"
},
{
    "id": "1651",
    "question": "List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/poleDriver> <http://dbpedia.org/resource/Mika_H\u00e4kkinen> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/poleDriver",
    "predicate1_mention": "pole driver",
    "predicate2_uri": "http://dbpedia.org/ontology/firstDriver",
    "predicate2_mention": "first drivers",
    "type_uri": "http://dbpedia.org/ontology/GrandPrix",
    "type_mention": "Grand Prixes",
    "entity1_uri": "http://dbpedia.org/resource/Mika_H\u00e4kkinen",
    "entity1_mention": "Mika Hakkinen",
    "entity2_uri": "",
    "entity2_mention": ""
}
]