[{
    "id": "1653",
    "question": "Name the royalty whose daughter was Cleopatra V and was married to Ptolemy XIV of Egypt?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mother> <http://dbpedia.org/resource/Cleopatra_V_of_Egypt> . ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Ptolemy_XIV_of_Egypt>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/mother",
    "predicate1_mention": "daughter",
    "predicate2_uri": "http://dbpedia.org/ontology/spouse",
    "predicate2_mention": "married",
    "type_uri": "http://dbpedia.org/ontology/Royalty",
    "type_mention": "royalty",
    "entity1_uri": "http://dbpedia.org/resource/Cleopatra_V_of_Egypt",
    "entity1_mention": "Cleopatra V",
    "entity2_uri": "http://dbpedia.org/resource/Ptolemy_XIV_of_Egypt",
    "entity2_mention": "Ptolemy XIV of Egypt"
},
{
    "id": "1654",
    "question": "What are some islands in the bahamas?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/archipelago> <http://dbpedia.org/resource/The_Bahamas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/archipelago",
    "predicate1_mention": "islands",
    "predicate2_uri": "http://dbpedia.org/ontology/Island",
    "predicate2_mention": "islands",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/The_Bahamas",
    "entity1_mention": "the bahamas",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1659",
    "question": "Which fields' academic journals are found in the US?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/discipline> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/country",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/discipline",
    "predicate2_mention": "fields'",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States",
    "entity1_mention": "US",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1667",
    "question": "Name the office holder with predecessor as Mark Latham and partner Tim Mathieson ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Mark_Latham> . ?uri <http://dbpedia.org/ontology/partner> <http://dbpedia.org/resource/Tim_Mathieson>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/predecessor",
    "predicate1_mention": "predecessor",
    "predicate2_uri": "http://dbpedia.org/ontology/partner",
    "predicate2_mention": "partner",
    "type_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "type_mention": "office holder",
    "entity1_uri": "http://dbpedia.org/resource/Mark_Latham",
    "entity1_mention": "Mark Latham",
    "entity2_uri": "http://dbpedia.org/resource/Tim_Mathieson",
    "entity2_mention": "Tim Mathieson"
},
{
    "id": "1672",
    "question": "Which video game's artist is Hiroji Kiyotake and computing platform is Virtual Console?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Hiroji_Kiyotake> . ?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/artist",
    "predicate1_mention": "artist",
    "predicate2_uri": "http://dbpedia.org/ontology/computingPlatform",
    "predicate2_mention": "computing platform",
    "type_uri": "http://dbpedia.org/ontology/VideoGame",
    "type_mention": "video game's",
    "entity1_uri": "http://dbpedia.org/resource/Hiroji_Kiyotake",
    "entity1_mention": "Hiroji Kiyotake",
    "entity2_uri": "http://dbpedia.org/resource/Virtual_Console",
    "entity2_mention": "virtual console"
},
{
    "id": "1688",
    "question": "Count all the places where companies located in Ontario operate.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/locationCity",
    "predicate1_mention": "located",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ontario",
    "entity1_mention": "ontario",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1689",
    "question": "What is the famous relative of Mrunalini Kunte known for?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Mrunalini_Kunte> . ?x <http://dbpedia.org/property/knownFor> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/relatives",
    "predicate1_mention": "relative",
    "predicate2_uri": "http://dbpedia.org/property/knownFor",
    "predicate2_mention": "known for",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mrunalini_Kunte",
    "entity1_mention": "mrunalini kunte",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1717",
    "question": "How many basketball players studied in the Midland College?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Midland_College>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/college",
    "predicate1_mention": "college",
    "predicate2_uri": "http://dbpedia.org/ontology/BasketballPlayer",
    "predicate2_mention": "basketball players",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Midland_College",
    "entity1_mention": "midland college",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1720",
    "question": "Is Liang Chow the headcoach of Shawn Johnson?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Shawn_Johnson> <http://dbpedia.org/property/headcoach> <http://dbpedia.org/resource/Liang_Chow> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/headcoach",
    "predicate1_mention": "headcoach",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Shawn_Johnson",
    "entity1_mention": "Shawn Johnson",
    "entity2_uri": "http://dbpedia.org/resource/Liang_Chow",
    "entity2_mention": "liang chow"
},
{
    "id": "1726",
    "question": "Which american football players currently plays for Michigan Wolverines?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentteam> <http://dbpedia.org/resource/Michigan_Wolverines>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/currentteam",
    "predicate1_mention": "currently plays for",
    "predicate2_uri": "http://dbpedia.org/ontology/AmericanFootballPlayer",
    "predicate2_mention": "american football players",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Michigan_Wolverines",
    "entity1_mention": "Michigan Wolverines",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1730",
    "question": "List down the common sports played by PATTS College of Aeronautics and lytechnic University of the Philippines Taguig ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/PATTS_College_of_Aeronautics> <http://dbpedia.org/property/athletics> ?uri. <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/athletics",
    "predicate1_mention": "aeronautics",
    "predicate2_uri": "http://dbpedia.org/ontology/sport",
    "predicate2_mention": "sports",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/PATTS_College_of_Aeronautics",
    "entity1_mention": "PATTS College of Aeronautics",
    "entity2_uri": "http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig",
    "entity2_mention": "lytechnic University of the Philippines Taguig"
},
{
    "id": "1739",
    "question": "Give me some softwares which run on mac os",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/operatingSystem",
    "predicate1_mention": "os",
    "predicate2_uri": "http://dbpedia.org/ontology/Software",
    "predicate2_mention": "softwares",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mac_OS",
    "entity1_mention": "mac os",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1741",
    "question": "What are some scientists who have stateless citizenship?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/citizenship",
    "predicate1_mention": "citizenship",
    "predicate2_uri": "http://dbpedia.org/ontology/Scientist",
    "predicate2_mention": "scientists",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Statelessness",
    "entity1_mention": "stateless",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1774",
    "question": "Count the total religions followed by the ones living in England.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/residence",
    "predicate1_mention": "living in",
    "predicate2_uri": "http://dbpedia.org/property/religion",
    "predicate2_mention": "religions",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/England",
    "entity1_mention": "England",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1795",
    "question": "Which football teams are in a city where Oakland Athletics were the tenants?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/Oakland_Athletics> . ?uri <http://dbpedia.org/ontology/locationCity> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballTeam>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/tenant",
    "predicate1_mention": "tenants",
    "predicate2_uri": "http://dbpedia.org/ontology/locationCity",
    "predicate2_mention": "city",
    "type_uri": "http://dbpedia.org/ontology/AmericanFootballTeam",
    "type_mention": "football",
    "entity1_uri": "http://dbpedia.org/resource/Oakland_Athletics",
    "entity1_mention": "Oakland Athletics",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1800",
    "question": "King crimson has been recorded in which places?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/King_Crimson> . ?x <http://dbpedia.org/ontology/recordedIn> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/artist",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/recordedIn",
    "predicate2_mention": "recorded in",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/King_Crimson",
    "entity1_mention": "King crimson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1807",
    "question": "What are the nicknames of the schools whose color is royal blue?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/colour> <http://dbpedia.org/resource/Royal_blue> . ?x <http://dbpedia.org/property/nickname> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/colour",
    "predicate1_mention": "color",
    "predicate2_uri": "http://dbpedia.org/property/nickname",
    "predicate2_mention": "nicknames",
    "type_uri": "http://dbpedia.org/ontology/School",
    "type_mention": "schools",
    "entity1_uri": "http://dbpedia.org/resource/Royal_blue",
    "entity1_mention": "royal blue",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1826",
    "question": "To which books Thomas Egerton, an editor?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Thomas_Egerton_(publisher)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/publisher",
    "predicate1_mention": "editor",
    "predicate2_uri": "http://dbpedia.org/ontology/Book",
    "predicate2_mention": "books",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Thomas_Egerton_(publisher)",
    "entity1_mention": "Thomas Egerton",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1836",
    "question": "Which countries share a similar sociocultural and ethnic heritage of that of Native Indonesians?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Native_Indonesians> <http://dbpedia.org/property/region> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/region",
    "predicate1_mention": "share",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Native_Indonesians",
    "entity1_mention": "sociocultural and ethnic heritage of that of native indonesians",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1859",
    "question": "With whom is the institution of David Charles affiliated?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/David_Charles_(physician)> <http://dbpedia.org/property/workInstitutions> ?x . ?x <http://dbpedia.org/property/affiliation> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/workInstitutions",
    "predicate1_mention": "institution",
    "predicate2_uri": "http://dbpedia.org/property/affiliation",
    "predicate2_mention": "affiliated",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/David_Charles_(physician)",
    "entity1_mention": "David Charles",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1862",
    "question": "What are the movies whose musicians's home town is Volos?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Volos> . ?uri <http://dbpedia.org/property/music> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/hometown",
    "predicate1_mention": "home town",
    "predicate2_uri": "http://dbpedia.org/property/music",
    "predicate2_mention": "musicians's",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movies",
    "entity1_uri": "http://dbpedia.org/resource/Volos",
    "entity1_mention": "volos",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1867",
    "question": "What made Jon Speelman and Eric Schiller famous?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?uri. <http://dbpedia.org/resource/Eric_Schiller> <http://dbpedia.org/ontology/knownFor> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/field",
    "predicate1_mention": "made",
    "predicate2_uri": "http://dbpedia.org/ontology/knownFor",
    "predicate2_mention": "famous",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jon_Speelman",
    "entity1_mention": "Jon Speelman",
    "entity2_uri": "http://dbpedia.org/resource/Eric_Schiller",
    "entity2_mention": "Eric Schiller"
},
{
    "id": "1871",
    "question": "How many people currently play for Stoke City F.C.?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Stoke_City_F.C.>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/currentclub",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Stoke_City_F.C.",
    "entity1_mention": "Stoke City F.C.",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1877",
    "question": "List the relatives of the children of Jon Voight ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Voight> <http://dbpedia.org/property/children> ?x . ?x <http://dbpedia.org/ontology/relative> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/children",
    "predicate1_mention": "children",
    "predicate2_uri": "http://dbpedia.org/ontology/relative",
    "predicate2_mention": "relatives",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jon_Voight",
    "entity1_mention": "Jon Voight",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1888",
    "question": "Who composed songs in the Mr Tambourine Man album?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Mr._Tambourine_Man_(album)> . ?x <http://dbpedia.org/ontology/composer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Song>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/album",
    "predicate1_mention": "album",
    "predicate2_uri": "http://dbpedia.org/ontology/composer",
    "predicate2_mention": "composed",
    "type_uri": "http://dbpedia.org/ontology/Song",
    "type_mention": "songs",
    "entity1_uri": "http://dbpedia.org/resource/Mr._Tambourine_Man_(album)",
    "entity1_mention": "Mr Tambourine Man album",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1892",
    "question": "Which american football player's current team is Michigan Wolverines and former team was  Baltimore Ravens ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentteam> <http://dbpedia.org/resource/Michigan_Wolverines> . ?uri <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/1998_Baltimore_Ravens_season>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/currentteam",
    "predicate1_mention": "current team",
    "predicate2_uri": "http://dbpedia.org/ontology/formerTeam",
    "predicate2_mention": "former team",
    "type_uri": "http://dbpedia.org/ontology/AmericanFootballPlayer",
    "type_mention": "american football player's",
    "entity1_uri": "http://dbpedia.org/resource/Michigan_Wolverines",
    "entity1_mention": "Michigan Wolverines",
    "entity2_uri": "http://dbpedia.org/resource/1998_Baltimore_Ravens_season",
    "entity2_mention": "baltimore ravens"
},
{
    "id": "1897",
    "question": "What are the veneration of the one for which there's a major shrine in Hebron?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/majorShrine> <http://dbpedia.org/resource/Hebron> . ?x <http://dbpedia.org/property/veneratedIn> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/majorShrine",
    "predicate1_mention": "major shrine",
    "predicate2_uri": "http://dbpedia.org/property/veneratedIn",
    "predicate2_mention": "veneration",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Hebron",
    "entity1_mention": "hebron",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1912",
    "question": "Name the television show developed by J. Michael Straczynski and distributed by Warner Bros. Television?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/J._Michael_Straczynski> . ?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros._Television>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/developer",
    "predicate1_mention": "developed",
    "predicate2_uri": "http://dbpedia.org/property/distributor",
    "predicate2_mention": "distributed",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "television show",
    "entity1_uri": "http://dbpedia.org/resource/J._Michael_Straczynski",
    "entity1_mention": "J. Michael Straczynski",
    "entity2_uri": "http://dbpedia.org/resource/Warner_Bros._Television",
    "entity2_mention": "Warner Bros. Television"
},
{
    "id": "1913",
    "question": "Who did Bruce Bochy play for ? ",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/team",
    "predicate1_mention": "play",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Bruce_Bochy",
    "entity1_mention": "bruce bochy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1918",
    "question": "What is the home town of the band which is the artist of Your Ice Cream's Dirty ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Your_Ice_Cream's_Dirty> <http://dbpedia.org/property/artist> ?x . ?x <http://dbpedia.org/ontology/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/artist",
    "predicate1_mention": "artist",
    "predicate2_uri": "http://dbpedia.org/ontology/hometown",
    "predicate2_mention": "home town",
    "type_uri": "http://dbpedia.org/ontology/Band",
    "type_mention": "band",
    "entity1_uri": "http://dbpedia.org/resource/Your_Ice_Cream's_Dirty",
    "entity1_mention": "Your Ice Cream's Dirty",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1933",
    "question": "What is the local authority of the Buckhurst Hill County High School is also the birth place of Sarah hampion ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?uri. <http://dbpedia.org/resource/Sarah_Champion_(presenter)> <http://dbpedia.org/property/birthPlace> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/localAuthority",
    "predicate1_mention": "local authority",
    "predicate2_uri": "http://dbpedia.org/property/birthPlace",
    "predicate2_mention": "birth place",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Buckhurst_Hill_County_High_School",
    "entity1_mention": "Buckhurst Hill County High School",
    "entity2_uri": "http://dbpedia.org/resource/Sarah_Champion_(presenter)",
    "entity2_mention": "Sarah hampion"
},
{
    "id": "1946",
    "question": "Is Dave Schulz a band member of Berlin?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Berlin_(band)> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Dave_Schulz_(musician)> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/bandMember",
    "predicate1_mention": "band member",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Berlin_(band)",
    "entity1_mention": "berlin",
    "entity2_uri": "http://dbpedia.org/resource/Dave_Schulz_(musician)",
    "entity2_mention": "Dave Schulz"
},
{
    "id": "1950",
    "question": "where did Alfred Tarnowski die?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alfred_Tarnowski> <http://dbpedia.org/property/placeOfDeath> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/placeOfDeath",
    "predicate1_mention": "die",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Alfred_Tarnowski",
    "entity1_mention": "Alfred Tarnowski",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1965",
    "question": "Whose wife is a presenter at WWE?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/WWE> . ?uri <http://dbpedia.org/ontology/spouse> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/presenter",
    "predicate1_mention": "presenter",
    "predicate2_uri": "http://dbpedia.org/ontology/spouse",
    "predicate2_mention": "wife",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/WWE",
    "entity1_mention": "wwe",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1967",
    "question": "What is the parent company of company which owns Sony Bank?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sony_Bank> <http://dbpedia.org/property/parent> ?x . ?x <http://dbpedia.org/ontology/parentCompany> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/parent",
    "predicate1_mention": "parent",
    "predicate2_uri": "http://dbpedia.org/ontology/parentCompany",
    "predicate2_mention": "parent company",
    "type_uri": "http://dbpedia.org/ontology/Company",
    "type_mention": "company",
    "entity1_uri": "http://dbpedia.org/resource/Sony_Bank",
    "entity1_mention": "sony bank",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "1978",
    "question": "How many home stadiums are there of the seasons whose chairman in Merritt Paulson?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/chairman",
    "predicate1_mention": "chairman",
    "predicate2_uri": "http://dbpedia.org/ontology/homeStadium",
    "predicate2_mention": "home stadiums",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Merritt_Paulson",
    "entity1_mention": "Merritt Paulson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2005",
    "question": "Which cities have the river one of whose Tributary is the Missouri's big spring?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Big_Spring_(Missouri)> . ?x <http://dbpedia.org/ontology/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/rightTributary",
    "predicate1_mention": "tributary",
    "predicate2_uri": "http://dbpedia.org/ontology/city",
    "predicate2_mention": "cities",
    "type_uri": "http://dbpedia.org/ontology/River",
    "type_mention": "river",
    "entity1_uri": "http://dbpedia.org/resource/Big_Spring_(Missouri)",
    "entity1_mention": "big spring",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2025",
    "question": "The successor of Ellsworth Bunker belongs to which religion?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ellsworth_Bunker> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/region> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/successor",
    "predicate1_mention": "successor",
    "predicate2_uri": "http://dbpedia.org/ontology/region",
    "predicate2_mention": "religion",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ellsworth_Bunker",
    "entity1_mention": "ellsworth bunker",
    "entity2_uri": "",
    "entity2_mention": ""
}
]