[{
        "id": "3291",
        "question": "List the mountains of the range Sierra Nevada (U.S.) located in  California?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)> . ?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}",
        "sparql_id": "308",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/mountainRange",
        "predicate1_mention": "mountains",
        "predicate2_uri": "http://dbpedia.org/ontology/locatedInArea",
        "predicate2_mention": "located",
        "type_uri": "http://dbpedia.org/ontology/Mountain",
        "type_mention": "mountains",
        "entity1_uri": "http://dbpedia.org/resource/Sierra_Nevada_(U.S.)",
        "entity1_mention": "sierra nevada (u.s.)",
        "entity2_uri": "http://dbpedia.org/resource/California",
        "entity2_mention": "california"
    },
    {
        "id": "3295",
        "question": "In which company's boards does the founder of Bomis sit?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bomis> <http://dbpedia.org/ontology/foundedBy> ?x . ?x <http://dbpedia.org/ontology/board> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/foundedBy",
        "predicate1_mention": "founder",
        "predicate2_uri": "http://dbpedia.org/ontology/board",
        "predicate2_mention": "boards",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Bomis",
        "entity1_mention": "bomis",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3320",
        "question": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/ontology/almaMater",
        "predicate1_mention": "graduated from",
        "predicate2_uri": "http://dbpedia.org/ontology/award",
        "predicate2_mention": "awards",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens",
        "entity1_mention": "National and Kapodistrian University of Athens",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3323",
        "question": "Name the narrators of the album which has been narrated by Alan Thicke ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/narrated> <http://dbpedia.org/resource/Alan_Thicke> . ?x <http://dbpedia.org/property/narrated> ?uri  . }",
        "sparql_id": "11",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/narrated",
        "predicate1_mention": "narrated",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Alan_Thicke",
        "entity1_mention": "alan thicke",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3357",
        "question": "Is GIMP written in C?",
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> <http://dbpedia.org/resource/C_(programming_language)> }",
        "sparql_id": "151",
        "classx": "4",
        "predicate1_uri": "http://dbpedia.org/ontology/programmingLanguage",
        "predicate1_mention": "",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/GIMP",
        "entity1_mention": "gimp",
        "entity2_uri": "http://dbpedia.org/resource/C_(programming_language)",
        "entity2_mention": "C"
    },
    {
        "id": "3361",
        "question": "How many people have played for the NBA?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }",
        "sparql_id": "101",
        "classx": "2",
        "predicate1_uri": "http://dbpedia.org/property/league",
        "predicate1_mention": "",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/National_Basketball_Association",
        "entity1_mention": "NBA",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3362",
        "question": "Name the river  whose source location is Nevado Mismi and region is Arequipa Region?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/sourceLocation> <http://dbpedia.org/resource/Nevado_Mismi> . ?uri <http://dbpedia.org/property/sourceRegion> <http://dbpedia.org/resource/Arequipa_Region>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
        "sparql_id": "308",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/sourceLocation",
        "predicate1_mention": "source location",
        "predicate2_uri": "http://dbpedia.org/property/sourceRegion",
        "predicate2_mention": "region",
        "type_uri": "http://dbpedia.org/ontology/River",
        "type_mention": "river",
        "entity1_uri": "http://dbpedia.org/resource/Nevado_Mismi",
        "entity1_mention": "nevado mismi",
        "entity2_uri": "http://dbpedia.org/resource/Arequipa_Region",
        "entity2_mention": "arequipa region"
    },
    {
        "id": "3375",
        "question": "What is the former partner of the figure skaters whose current partner is Alexa Scimeca?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/currentPartner> <http://dbpedia.org/resource/Alexa_Scimeca> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FigureSkater>}",
        "sparql_id": "305",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/currentPartner",
        "predicate1_mention": "current partner",
        "predicate2_uri": "http://dbpedia.org/ontology/formerPartner",
        "predicate2_mention": "former partner",
        "type_uri": "http://dbpedia.org/ontology/FigureSkater",
        "type_mention": "figure",
        "entity1_uri": "http://dbpedia.org/resource/Alexa_Scimeca",
        "entity1_mention": "alexa scimeca",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3377",
        "question": "Name all the broadcast area of the TV stations which has Rodrigues ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/broadcastArea> <http://dbpedia.org/resource/Rodrigues> . ?x <http://dbpedia.org/property/broadcastArea> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionStation>}",
        "sparql_id": "311",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/broadcastArea",
        "predicate1_mention": "broadcast area",
        "predicate2_uri": "http://dbpedia.org/ontology/TelevisionStation",
        "predicate2_mention": "tv stations",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Rodrigues",
        "entity1_mention": "rodrigues",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3378",
        "question": "What band has Joe Hahn and Chester Bennington?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Joe_Hahn> . ?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Chester_Bennington> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
        "sparql_id": "307",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/currentMembers",
        "predicate1_mention": "",
        "predicate2_uri": "http://dbpedia.org/property/currentMembers",
        "predicate2_mention": "",
        "type_uri": "http://dbpedia.org/ontology/Band",
        "type_mention": "band",
        "entity1_uri": "http://dbpedia.org/resource/Joe_Hahn",
        "entity1_mention": "joe hahn",
        "entity2_uri": "http://dbpedia.org/resource/Chester_Bennington",
        "entity2_mention": "chester bennington"
    },
    {
        "id": "3379",
        "question": "In which cities are there american football teams where Matt Snorton played?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Matt_Snorton> <http://dbpedia.org/property/pastteams> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballTeam>}",
        "sparql_id": "303",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/pastteams",
        "predicate1_mention": "teams",
        "predicate2_uri": "http://dbpedia.org/ontology/locationCity",
        "predicate2_mention": "cities",
        "type_uri": "http://dbpedia.org/ontology/AmericanFootballTeam",
        "type_mention": "american football teams",
        "entity1_uri": "http://dbpedia.org/resource/Matt_Snorton",
        "entity1_mention": "matt snorton",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3381",
        "question": "Name the office holder whose constituency is Noe Valley, San Francisco and belongs to military unit USS Kittiwake (ASR-13)?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Noe_Valley,_San_Francisco> . ?uri <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/USS_Kittiwake_(ASR-13)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
        "sparql_id": "308",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/constituency",
        "predicate1_mention": "constituency",
        "predicate2_uri": "http://dbpedia.org/ontology/militaryUnit",
        "predicate2_mention": "military unit",
        "type_uri": "http://dbpedia.org/ontology/OfficeHolder",
        "type_mention": "office holder",
        "entity1_uri": "http://dbpedia.org/resource/Noe_Valley,_San_Francisco",
        "entity1_mention": "Noe Valley, San Francisco",
        "entity2_uri": "http://dbpedia.org/resource/USS_Kittiwake_(ASR-13)",
        "entity2_mention": "USS Kittiwake (ASR-13)"
    },
    {
        "id": "3393",
        "question": "Where are the burial grounds of Willem Cornelis Janse van Rensburg and Thomas Franois Burgers?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Willem_Cornelis_Janse_van_Rensburg> <http://dbpedia.org/property/restingplace> ?uri. <http://dbpedia.org/resource/Thomas_Fran\u00e7ois_Burgers> <http://dbpedia.org/property/restingplace> ?uri . }",
        "sparql_id": "15",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/restingplace",
        "predicate1_mention": "burial grounds",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Willem_Cornelis_Janse_van_Rensburg",
        "entity1_mention": "Willem Cornelis Janse van Rensburg",
        "entity2_uri": "http://dbpedia.org/resource/Thomas_Fran\u00e7ois_Burgers",
        "entity2_mention": "Thomas Franois Burgers"
    },
    {
        "id": "3396",
        "question": "In which city was the company founded , which owns Grasim Bhiwani Textiles?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Grasim_Bhiwani_Textiles> <http://dbpedia.org/property/parent> ?x . ?x <http://dbpedia.org/property/foundation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
        "sparql_id": "303",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/parent",
        "predicate1_mention": "owns",
        "predicate2_uri": "http://dbpedia.org/property/foundation",
        "predicate2_mention": "founded",
        "type_uri": "http://dbpedia.org/ontology/Company",
        "type_mention": "company",
        "entity1_uri": "http://dbpedia.org/resource/Grasim_Bhiwani_Textiles",
        "entity1_mention": "Grasim Bhiwani Textiles",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3402",
        "question": "Which country has outflow of  Lake Uniamsi and  inflows of the Cahora Bassa?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lake_Uniam\u00e9si> <http://dbpedia.org/property/outflow> ?uri. <http://dbpedia.org/resource/Cahora_Bassa> <http://dbpedia.org/property/inflow> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/outflow",
        "predicate1_mention": "outflow",
        "predicate2_uri": "http://dbpedia.org/property/inflow",
        "predicate2_mention": "inflows",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Lake_Uniam\u00e9si",
        "entity1_mention": "Lake Uniamsi",
        "entity2_uri": "http://dbpedia.org/resource/Cahora_Bassa",
        "entity2_mention": "cahora bassa"
    },
    {
        "id": "3405",
        "question": "Give me the total number of Guests of the television episodes whose one of the  Guests is Michael Cristofer?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/guests> <http://dbpedia.org/resource/Michael_Cristofer> . ?x <http://dbpedia.org/property/guests> ?uri }",
        "sparql_id": "111",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/guests",
        "predicate1_mention": "guests",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Michael_Cristofer",
        "entity1_mention": "michael cristofer",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3416",
        "question": "Which region of English American is also the place of Death of Brent Darby ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/English_Americans> <http://dbpedia.org/property/region> ?uri. <http://dbpedia.org/resource/Brent_Darby> <http://dbpedia.org/property/placeOfDeath> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/region",
        "predicate1_mention": "region",
        "predicate2_uri": "http://dbpedia.org/property/placeOfDeath",
        "predicate2_mention": "place of death",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/English_Americans",
        "entity1_mention": "english american",
        "entity2_uri": "http://dbpedia.org/resource/Brent_Darby",
        "entity2_mention": "brent darby"
    },
    {
        "id": "3426",
        "question": "List all the narrator of the albums which had Alan Barzman as one of the narrator ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/narrated> <http://dbpedia.org/resource/Alan_Barzman> . ?x <http://dbpedia.org/property/narrated> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}",
        "sparql_id": "311",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/narrated",
        "predicate1_mention": "narrator",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "http://dbpedia.org/ontology/Album",
        "type_mention": "albums",
        "entity1_uri": "http://dbpedia.org/resource/Alan_Barzman",
        "entity1_mention": "alan barzman",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3427",
        "question": "is Mazhar Ul Haq High School Beerwah is affiliated to Islamic Religion",
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }",
        "sparql_id": "152",
        "classx": "4",
        "predicate1_uri": "http://dbpedia.org/property/religiousAffiliation",
        "predicate1_mention": "affiliated",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah",
        "entity1_mention": "Mazhar Ul Haq High School Beerwah",
        "entity2_uri": "http://dbpedia.org/resource/Islam",
        "entity2_mention": "Islamic Religion"
    },
    {
        "id": "3434",
        "question": "List the significant buildings of the arch. whose one of the important work is Government Building Kiev ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Government_Building,_Kiev> . ?x <http://dbpedia.org/ontology/significantBuilding> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>}",
        "sparql_id": "311",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/significantBuilding",
        "predicate1_mention": "significant buildings",
        "predicate2_uri": "http://dbpedia.org/ontology/Architect",
        "predicate2_mention": "arch.",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Government_Building,_Kiev",
        "entity1_mention": "government building Kiev",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3467",
        "question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/birthPlace",
        "predicate1_mention": "birth location",
        "predicate2_uri": "http://dbpedia.org/ontology/country",
        "predicate2_mention": "state",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong",
        "entity1_mention": "monroe gilchrist",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3473",
        "question": "Name the common institution of the Erica Frank and Douglass North?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?uri. <http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?uri . }",
        "sparql_id": "15",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/institution",
        "predicate1_mention": "institution",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Erica_Frank",
        "entity1_mention": "erica frank",
        "entity2_uri": "http://dbpedia.org/resource/Douglass_North",
        "entity2_mention": "douglass north"
    },
    {
        "id": "3475",
        "question": "What is the ethicity of Ted Falon?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ted_Failon> <http://dbpedia.org/ontology/ethnicity> ?uri } ",
        "sparql_id": "2",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/ethnicity",
        "predicate1_mention": "ethicity",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Ted_Failon",
        "entity1_mention": "Ted Falon",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3480",
        "question": "ARM Architecture acts as a game platform for how many things?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture>  . }",
        "sparql_id": "101",
        "classx": "2",
        "predicate1_uri": "http://dbpedia.org/ontology/computingPlatform",
        "predicate1_mention": "platform",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/ARM_architecture",
        "entity1_mention": "arm architecture",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3483",
        "question": "Cricket is played by which countries' citizens?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Cricket> . ?x <http://dbpedia.org/ontology/stateOfOrigin> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/occupation",
        "predicate1_mention": "",
        "predicate2_uri": "http://dbpedia.org/ontology/stateOfOrigin",
        "predicate2_mention": "citizens",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Cricket",
        "entity1_mention": "cricket",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3491",
        "question": "Name the common former team of Marv mcFadden and Carlos Emmons ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marv_McFadden> <http://dbpedia.org/property/pastteams> ?uri. <http://dbpedia.org/resource/Carlos_Emmons_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?uri} ",
        "sparql_id": "16",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/pastteams",
        "predicate1_mention": "team",
        "predicate2_uri": "http://dbpedia.org/ontology/formerTeam",
        "predicate2_mention": "former team",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Marv_McFadden",
        "entity1_mention": "marv mcfadden",
        "entity2_uri": "http://dbpedia.org/resource/Carlos_Emmons_(American_football)",
        "entity2_mention": "Carlos Emmons"
    },
    {
        "id": "3497",
        "question": "Name the common institute of Robert hall and Erica Frank ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?uri. <http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?uri . }",
        "sparql_id": "15",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/institution",
        "predicate1_mention": "institute",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Robert_Hall_(economist)",
        "entity1_mention": "robert hall",
        "entity2_uri": "http://dbpedia.org/resource/Erica_Frank",
        "entity2_mention": "erica frank"
    },
    {
        "id": "3499",
        "question": "What were robert sarvis and JAck Ryan nominated for ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Sarvis> <http://dbpedia.org/ontology/nominee> ?uri. <http://dbpedia.org/resource/Jack_Ryan_(politician)> <http://dbpedia.org/ontology/nominee> ?uri . }",
        "sparql_id": "15",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/nominee",
        "predicate1_mention": "nominated",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Robert_Sarvis",
        "entity1_mention": "robert sarvis",
        "entity2_uri": "http://dbpedia.org/resource/Jack_Ryan_(politician)",
        "entity2_mention": "jack ryan"
    },
    {
        "id": "3526",
        "question": "name the home stadium of FC Spartak Moscow season 2011-12",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } ",
        "sparql_id": "2",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/homeStadium",
        "predicate1_mention": "home stadium",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season",
        "entity1_mention": "spartak moscow season",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3654",
        "question": "List the religions of the commanders of Royal Thai Army.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/property/notableCommanders",
        "predicate1_mention": "commanders",
        "predicate2_uri": "http://dbpedia.org/ontology/religion",
        "predicate2_mention": "religions",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Royal_Thai_Army",
        "entity1_mention": "royal thai",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3668",
        "question": "List few authors whose education took place in Saint Petersburg ?   ",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "sparql_id": "301",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/education",
        "predicate1_mention": "education",
        "predicate2_uri": "http://dbpedia.org/ontology/Writer",
        "predicate2_mention": "list",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Saint_Petersburg",
        "entity1_mention": "saint petersburg",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "3676",
        "question": "Is Eddie Bravo the trainer of Alan Jouban",
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }",
        "sparql_id": "152",
        "classx": "4",
        "predicate1_uri": "http://dbpedia.org/ontology/trainer",
        "predicate1_mention": "trainer",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Alan_Jouban",
        "entity1_mention": "alan jouban",
        "entity2_uri": "http://dbpedia.org/resource/Eddie_Bravo",
        "entity2_mention": "eddie bravo"
    },
    {
        "id": "4015",
        "question": "Where is the mouth of the river whose tributary is Bjelimi\u0107ka  Rijeka ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/rightTributary",
        "predicate1_mention": "tributary",
        "predicate2_uri": "http://dbpedia.org/ontology/mouthCountry",
        "predicate2_mention": "mouth",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka",
        "entity1_mention": "bjelimi\u0107ka rijeka",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4038",
        "question": "For everyone who died in paris, count their different fields of work.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/deathPlace",
        "predicate1_mention": "died in",
        "predicate2_uri": "http://dbpedia.org/property/fields",
        "predicate2_mention": "fields",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Paris",
        "entity1_mention": "paris",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4048",
        "question": "List the sports played in private universities.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/type",
        "predicate1_mention": "",
        "predicate2_uri": "http://dbpedia.org/ontology/sport",
        "predicate2_mention": "sports",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Private_university",
        "entity1_mention": "private universities",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4073",
        "question": "Give me the number of home stadiums of teams managed by John Spencer.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/manager",
        "predicate1_mention": "managed",
        "predicate2_uri": "http://dbpedia.org/ontology/homeStadium",
        "predicate2_mention": "home stadiums",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)",
        "entity1_mention": "John Spencer",
        "entity2_uri": "",
        "entity2_mention": ""
    }
]