[{
    "id": "2042",
    "question": "In which military conflict were Phm Vn ng and John McEwen commanders ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Ph\u1ea1m_V\u0103n_\u0110\u1ed3ng> . ?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/John_McEwen> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
    "sparql_id": "307",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/commander",
    "predicate1_mention": "commanders",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/MilitaryConflict",
    "type_mention": "military conflict",
    "entity1_uri": "http://dbpedia.org/resource/Ph\u1ea1m_V\u0103n_\u0110\u1ed3ng",
    "entity1_mention": "Phm Vn ng",
    "entity2_uri": "http://dbpedia.org/resource/John_McEwen",
    "entity2_mention": "John McEwen"
},
{
    "id": "2045",
    "question": "What is the predecessor of the car engine which was succeeded by  BMW M43 ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/BMW_M43> . ?x <http://dbpedia.org/property/predecessor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Engine>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/successor",
    "predicate1_mention": "succeeded",
    "predicate2_uri": "http://dbpedia.org/property/predecessor",
    "predicate2_mention": "predecessor",
    "type_uri": "http://dbpedia.org/ontology/Engine",
    "type_mention": "engine",
    "entity1_uri": "http://dbpedia.org/resource/BMW_M43",
    "entity1_mention": "BMW M43",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2094",
    "question": "does the journal of cancer have the creative commons license?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Journal_of_Cancer> <http://dbpedia.org/property/license> <http://dbpedia.org/resource/Creative_Commons_license> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/license",
    "predicate1_mention": "license",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Journal_of_Cancer",
    "entity1_mention": "journal of cancer",
    "entity2_uri": "http://dbpedia.org/resource/Creative_Commons_license",
    "entity2_mention": "creative commons license"
},
{
    "id": "2101",
    "question": "List the relegion of tani University which is also the life stance of udit Raj ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/\u014ctani_University> <http://dbpedia.org/property/affiliation> ?uri. <http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/affiliation",
    "predicate1_mention": "life stance",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "relegion",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/\u014ctani_University",
    "entity1_mention": "tani University",
    "entity2_uri": "http://dbpedia.org/resource/Udit_Raj",
    "entity2_mention": "udit raj"
},
{
    "id": "2104",
    "question": "What is the mascot of the military unit of David Prowse?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/David_Prowse_(politician)> <http://dbpedia.org/property/branch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/branch",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/mascot",
    "predicate2_mention": "mascot",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/David_Prowse_(politician)",
    "entity1_mention": "David Prowse",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2115",
    "question": "What is the genre for the developer of Interplay Entertainment?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/Interplay_Entertainment> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/developer",
    "predicate1_mention": "developer",
    "predicate2_uri": "http://dbpedia.org/ontology/genre",
    "predicate2_mention": "genre",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Interplay_Entertainment",
    "entity1_mention": "Interplay Entertainment",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2123",
    "question": "Did Paul Weatherwax an editor of Behave Yourself?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Behave_Yourself!> <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Paul_Weatherwax> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/editing",
    "predicate1_mention": "editor",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Behave_Yourself!",
    "entity1_mention": "Behave Yourself",
    "entity2_uri": "http://dbpedia.org/resource/Paul_Weatherwax",
    "entity2_mention": "Paul Weatherwax"
},
{
    "id": "2132",
    "question": "Name some shows similar to the one whose theme song is made by Murray Gold.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Murray_Gold> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/themeMusicComposer",
    "predicate1_mention": "made by",
    "predicate2_uri": "http://dbpedia.org/ontology/related",
    "predicate2_mention": "similar",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "shows",
    "entity1_uri": "http://dbpedia.org/resource/Murray_Gold",
    "entity1_mention": "Murray Gold",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2138",
    "question": "Who are some people whose relation is hqed in Gold Base?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Gold_Base> . ?uri <http://dbpedia.org/ontology/religion> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/headquarters",
    "predicate1_mention": "hqed",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "relation",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Gold_Base",
    "entity1_mention": "gold base",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2146",
    "question": "Name everyone working for a company owned by Roman Abramovich.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/owningCompany",
    "predicate1_mention": "company",
    "predicate2_uri": "http://dbpedia.org/ontology/occupation",
    "predicate2_mention": "working for",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Roman_Abramovich",
    "entity1_mention": "Roman Abramovich",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2149",
    "question": "What is the place of death of the gymnast who was the silver medalist at the 1956 Summer Olympics Men's rings ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gymnastics_at_the_1956_Summer_Olympics_\u2013_Men's_rings> <http://dbpedia.org/ontology/silverMedalist> ?x . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/silverMedalist",
    "predicate1_mention": "silver medalist",
    "predicate2_uri": "http://dbpedia.org/property/placeOfDeath",
    "predicate2_mention": "place of death",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Gymnastics_at_the_1956_Summer_Olympics_\u2013_Men's_rings",
    "entity1_mention": "the 1956 Summer Olympics Men's rings",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2159",
    "question": "List the awards won by the wife of Ingrid von Rosen.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/spouse",
    "predicate1_mention": "wife",
    "predicate2_uri": "http://dbpedia.org/property/awards",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ingrid_von_Rosen",
    "entity1_mention": "Ingrid von Rosen",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2178",
    "question": "The pope whose shrine is in St Peter's Basilica was venerated in which sects?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/majorShrine> <http://dbpedia.org/resource/St._Peter's_Basilica> . ?x <http://dbpedia.org/property/veneratedIn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Pope>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/majorShrine",
    "predicate1_mention": "shrine",
    "predicate2_uri": "http://dbpedia.org/property/veneratedIn",
    "predicate2_mention": "venerated in",
    "type_uri": "http://dbpedia.org/ontology/Pope",
    "type_mention": "pope",
    "entity1_uri": "http://dbpedia.org/resource/St._Peter's_Basilica",
    "entity1_mention": "St Peter's Basilica",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2184",
    "question": "Stan Van Gundy is president for which basketball team?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Stan_Van_Gundy> } ",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/president",
    "predicate1_mention": "president",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Stan_Van_Gundy",
    "entity1_mention": "Stan Van Gundy",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2187",
    "question": "Where is the head quarters of the parent company of Mall of America located?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mall_of_America> <http://dbpedia.org/property/owned> ?x . ?x <http://dbpedia.org/property/headquarters> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/owned",
    "predicate1_mention": "located",
    "predicate2_uri": "http://dbpedia.org/property/headquarters",
    "predicate2_mention": "head quarters",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mall_of_America",
    "entity1_mention": "Mall of America",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2191",
    "question": "Which associate musical artist of Carolyn Dennis is also the composer of Motorpsycho Nitemare ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carolyn_Dennis> <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri. <http://dbpedia.org/resource/Motorpsycho_Nitemare> <http://dbpedia.org/property/composer> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/associatedMusicalArtist",
    "predicate1_mention": "associate musical artist",
    "predicate2_uri": "http://dbpedia.org/property/composer",
    "predicate2_mention": "composer",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Carolyn_Dennis",
    "entity1_mention": "carolyn dennis",
    "entity2_uri": "http://dbpedia.org/resource/Motorpsycho_Nitemare",
    "entity2_mention": "motorpsycho nitemare"
},
{
    "id": "2194",
    "question": "What genre is PyChess from, which employes Craig Van Tilbury?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/PyChess> <http://dbpedia.org/property/genre> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/occupation",
    "predicate1_mention": "employes",
    "predicate2_uri": "http://dbpedia.org/property/genre",
    "predicate2_mention": "genre",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Craig_Van_Tilbury",
    "entity1_mention": "Craig Van Tilbury",
    "entity2_uri": "http://dbpedia.org/resource/PyChess",
    "entity2_mention": "PyChess"
},
{
    "id": "2207",
    "question": "Which distributer of Glover is also the stockholder of Seattle Mariners ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Glover_(video_game)> <http://dbpedia.org/ontology/distributor> ?uri. <http://dbpedia.org/resource/Seattle_Mariners> <http://dbpedia.org/ontology/owner> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/distributor",
    "predicate1_mention": "distributer",
    "predicate2_uri": "http://dbpedia.org/ontology/owner",
    "predicate2_mention": "stockholder",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Glover_(video_game)",
    "entity1_mention": "glover",
    "entity2_uri": "http://dbpedia.org/resource/Seattle_Mariners",
    "entity2_mention": "Seattle Mariners"
},
{
    "id": "2223",
    "question": "Count the drinks originated in England.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/origin",
    "predicate1_mention": "originated",
    "predicate2_uri": "http://dbpedia.org/ontology/Beverage",
    "predicate2_mention": "drinks",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/England",
    "entity1_mention": "England",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2225",
    "question": "Is Angola Avante the anthem of Angola?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Angola> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Angola_Avante> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/anthem",
    "predicate1_mention": "anthem",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Angola",
    "entity1_mention": "angola",
    "entity2_uri": "http://dbpedia.org/resource/Angola_Avante",
    "entity2_mention": "Angola Avante"
},
{
    "id": "2238",
    "question": "Where has GARAGE recorded its singles?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> . ?x <http://dbpedia.org/ontology/recordedIn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/producer",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/recordedIn",
    "predicate2_mention": "recorded",
    "type_uri": "http://dbpedia.org/ontology/Single",
    "type_mention": "singles",
    "entity1_uri": "http://dbpedia.org/resource/Garbage_(band)",
    "entity1_mention": "GARAGE",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2239",
    "question": "Which employer of Manu Cornet has also written Google.by ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Manu_Cornet> <http://dbpedia.org/property/employer> ?uri. <http://dbpedia.org/resource/Google.by> <http://dbpedia.org/ontology/author> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/employer",
    "predicate1_mention": "employer",
    "predicate2_uri": "http://dbpedia.org/ontology/author",
    "predicate2_mention": "written",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Manu_Cornet",
    "entity1_mention": "Manu Cornet",
    "entity2_uri": "http://dbpedia.org/resource/Google.by",
    "entity2_mention": "google.by"
},
{
    "id": "2260",
    "question": "Which builder has made concrete bridges?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/material> <http://dbpedia.org/resource/Concrete> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/material",
    "predicate1_mention": "made",
    "predicate2_uri": "http://dbpedia.org/ontology/builder",
    "predicate2_mention": "builder",
    "type_uri": "http://dbpedia.org/ontology/Bridge",
    "type_mention": "bridges",
    "entity1_uri": "http://dbpedia.org/resource/Concrete",
    "entity1_mention": "concrete",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2264",
    "question": "Which vice president of Warren G. Harsing is also the president of Evans Hughes ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Warren_G._Harding> <http://dbpedia.org/ontology/vicePresident> ?uri. <http://dbpedia.org/resource/Charles_Evans_Hughes> <http://dbpedia.org/ontology/president> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/vicePresident",
    "predicate1_mention": "vice president",
    "predicate2_uri": "http://dbpedia.org/ontology/president",
    "predicate2_mention": "president",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Warren_G._Harding",
    "entity1_mention": "Warren G. Harsing",
    "entity2_uri": "http://dbpedia.org/resource/Charles_Evans_Hughes",
    "entity2_mention": "Evans Hughes"
},
{
    "id": "2266",
    "question": "In which countries can i find broadcasted TV in southeast asia?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/broadcastArea> <http://dbpedia.org/resource/Southeast_Asia> . ?x <http://dbpedia.org/property/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionStation>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/broadcastArea",
    "predicate1_mention": "broadcasted",
    "predicate2_uri": "http://dbpedia.org/property/country",
    "predicate2_mention": "countries",
    "type_uri": "http://dbpedia.org/ontology/TelevisionStation",
    "type_mention": "southeast",
    "entity1_uri": "http://dbpedia.org/resource/Southeast_Asia",
    "entity1_mention": "southeast asia",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2274",
    "question": "Name the kingdom with currency Solidus (coin) and administrative headquarters in Nicomedia?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> . ?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>  . }",
    "sparql_id": "8",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/currency",
    "predicate1_mention": "currency",
    "predicate2_uri": "http://dbpedia.org/ontology/capital",
    "predicate2_mention": "administrative headquarters",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Solidus_(coin)",
    "entity1_mention": "solidus (coin)",
    "entity2_uri": "http://dbpedia.org/resource/Nicomedia",
    "entity2_mention": "nicomedia"
},
{
    "id": "2277",
    "question": "Where are the politicians buried who succeeded George Whitefield Davis?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/George_Whitefield_Davis> . ?x <http://dbpedia.org/property/restingplace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}",
    "sparql_id": "605",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/predecessor",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/restingplace",
    "predicate2_mention": "buried",
    "type_uri": "http://dbpedia.org/ontology/OfficeHolder",
    "type_mention": "politicians",
    "entity1_uri": "http://dbpedia.org/resource/George_Whitefield_Davis",
    "entity1_mention": "George Whitefield Davis",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2280",
    "question": "What are some music artists whose bands have signed up with Entertainment One Music?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Entertainment_One_Music> . ?x <http://dbpedia.org/ontology/bandMember> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/label",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/bandMember",
    "predicate2_mention": "bands",
    "type_uri": "http://dbpedia.org/ontology/Band",
    "type_mention": "bands",
    "entity1_uri": "http://dbpedia.org/resource/Entertainment_One_Music",
    "entity1_mention": "Entertainment One Music",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2284",
    "question": "Which type of building is Qun Thnh Temple ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Qu\u00e1n_Th\u00e1nh_Temple> <http://dbpedia.org/property/buildingType> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/buildingType",
    "predicate1_mention": "type of building",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Qu\u00e1n_Th\u00e1nh_Temple",
    "entity1_mention": "Qun Thnh Temple ",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2287",
    "question": "Who is the common distributer of Bombay Sapphire and Rev ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bombay_Sapphire> <http://dbpedia.org/property/distributor> ?uri. <http://dbpedia.org/resource/Rev_(drink)> <http://dbpedia.org/ontology/distributor> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/distributor",
    "predicate1_mention": "distributer",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Bombay_Sapphire",
    "entity1_mention": "Bombay Sapphire",
    "entity2_uri": "http://dbpedia.org/resource/Rev_(drink)",
    "entity2_mention": "rev"
},
{
    "id": "2299",
    "question": "In which continent do Air 2000 and Novair International airways operate?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Air_2000> <http://dbpedia.org/property/destinations> ?uri. <http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/property/destinations> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Continent>}",
    "sparql_id": "315",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/destinations",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Continent",
    "type_mention": "continent",
    "entity1_uri": "http://dbpedia.org/resource/Air_2000",
    "entity1_mention": "Air 2000",
    "entity2_uri": "http://dbpedia.org/resource/Novair_International_Airways",
    "entity2_mention": "Novair International airways"
},
{
    "id": "2302",
    "question": "Does Abdelhameed Amarri currently play for Khartoum?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Abdelhameed_Amarri> <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Khartoum> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/currentclub",
    "predicate1_mention": "currently",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Abdelhameed_Amarri",
    "entity1_mention": "abdelhameed amarri",
    "entity2_uri": "http://dbpedia.org/resource/Khartoum",
    "entity2_mention": "khartoum"
},
{
    "id": "2313",
    "question": "What are some devices made by Taiwanese companies?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/Taiwan> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Device>}",
    "sparql_id": "306",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/locationCity",
    "predicate1_mention": "companies",
    "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate2_mention": "made by",
    "type_uri": "http://dbpedia.org/ontology/Device",
    "type_mention": "devices",
    "entity1_uri": "http://dbpedia.org/resource/Taiwan",
    "entity1_mention": "Taiwanese",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2314",
    "question": "What is a salthill?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/type",
    "predicate1_mention": "",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Salthill",
    "entity1_mention": "salthill",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2330",
    "question": "Does mumbai manage the railway line going to the daund railway junction?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> <http://dbpedia.org/resource/Mumbai> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/servingRailwayLine",
    "predicate1_mention": "railway line",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Daund_Junction_railway_station",
    "entity1_mention": "daund railway junction",
    "entity2_uri": "http://dbpedia.org/resource/Mumbai",
    "entity2_mention": "mumbai"
},
{
    "id": "2331",
    "question": "Whihc place of birth of the Nina Vislova is also the largest city of Union State ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Union_State> <http://dbpedia.org/property/largestCity> ?uri. <http://dbpedia.org/resource/Nina_Vislova> <http://dbpedia.org/property/placeOfBirth> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/largestCity",
    "predicate1_mention": "largest city",
    "predicate2_uri": "http://dbpedia.org/property/placeOfBirth",
    "predicate2_mention": "place of birth",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Union_State",
    "entity1_mention": "union state",
    "entity2_uri": "http://dbpedia.org/resource/Nina_Vislova",
    "entity2_mention": "Nina Vislova"
},
{
    "id": "2344",
    "question": "What is the venerated in of the Abraham and religion of the Saima Chowdhury",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abraham> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/property/religion> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/veneratedIn",
    "predicate1_mention": "venerated",
    "predicate2_uri": "http://dbpedia.org/property/religion",
    "predicate2_mention": "religion",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Abraham",
    "entity1_mention": "abraham",
    "entity2_uri": "http://dbpedia.org/resource/Saima_Chowdhury",
    "entity2_mention": "Saima Chowdhury"
},
{
    "id": "2355",
    "question": "Which country gave birth to the Lemberger LD20b and Start+Flug H101 aircrafts?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lemberger_LD20b> <http://dbpedia.org/property/nationalOrigin> ?uri. <http://dbpedia.org/resource/Start_+_Flug_H-101> <http://dbpedia.org/property/nationalOrigin> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/nationalOrigin",
    "predicate1_mention": "gave birth to",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Lemberger_LD20b",
    "entity1_mention": "lemberger ld20b",
    "entity2_uri": "http://dbpedia.org/resource/Start_+_Flug_H-101",
    "entity2_mention": "Start+Flug H101"
},
{
    "id": "2372",
    "question": "Which companies have launched a rocket from Cape Canaveral Air Force station?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station> . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Rocket>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/launchSite",
    "predicate1_mention": "launched",
    "predicate2_uri": "http://dbpedia.org/ontology/manufacturer",
    "predicate2_mention": "companies",
    "type_uri": "http://dbpedia.org/ontology/Rocket",
    "type_mention": "rocket",
    "entity1_uri": "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station",
    "entity1_mention": "Cape Canaveral Air Force station",
    "entity2_uri": "",
    "entity2_mention": ""
}
]