[{
        "id": "4196",
        "question": "What are some products manufactured by Sony? ",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }",
        "sparql_id": "1",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/manufacturer",
        "predicate1_mention": "manufactured",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Sony",
        "entity1_mention": "Sony",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4197",
        "question": "What is the almamater of the successor of F. A. Little, Jr.? ",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/successor",
        "predicate1_mention": "successor",
        "predicate2_uri": "http://dbpedia.org/ontology/almaMater",
        "predicate2_mention": "almamater",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/F._A._Little,_Jr.",
        "entity1_mention": "F. A. Little, Jr.",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4198",
        "question": "List the alma mater of the person who is wedded to Sissela Bok.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/spouse",
        "predicate1_mention": "wedded to",
        "predicate2_uri": "http://dbpedia.org/property/almaMater",
        "predicate2_mention": "alma mater",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Sissela_Bok",
        "entity1_mention": "sissela bok.",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4230",
        "question": "List the children of the parent of Marvin Bush.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }",
        "sparql_id": "3",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/parent",
        "predicate1_mention": "parent",
        "predicate2_uri": "http://dbpedia.org/property/children",
        "predicate2_mention": "children",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Marvin_Bush",
        "entity1_mention": "marvin bush",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4299",
        "question": "Count the different religions followed by Second Lieutenants in military.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/ontology/militaryRank",
        "predicate1_mention": "military.",
        "predicate2_uri": "http://dbpedia.org/ontology/religion",
        "predicate2_mention": "religions",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Second_lieutenant",
        "entity1_mention": "Second Lieutenants",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4350",
        "question": "Count the different genres of games published by Titus Software",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/publisher",
        "predicate1_mention": "published",
        "predicate2_uri": "http://dbpedia.org/ontology/genre",
        "predicate2_mention": "genres",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Titus_Software",
        "entity1_mention": "titus software",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4415",
        "question": "How many bacterias have taxonomy as Bacillales and domain as Bacteria? ",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> } ",
        "sparql_id": "108",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/ontology/order",
        "predicate1_mention": "",
        "predicate2_uri": "http://dbpedia.org/property/domain",
        "predicate2_mention": "domain",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Bacillales",
        "entity1_mention": "bacillales",
        "entity2_uri": "http://dbpedia.org/resource/Bacteria",
        "entity2_mention": "Bacteria"
    },
    {
        "id": "4513",
        "question": "To which company is the service \"Nintendo eShop\" associated with?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_eShop>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
        "sparql_id": "301",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/property/services",
        "predicate1_mention": "service",
        "predicate2_uri": "http://dbpedia.org/ontology/Company",
        "predicate2_mention": "company",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Nintendo_eShop",
        "entity1_mention": "Nintendo eShop",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4525",
        "question": "Name the ones who debuted in the San Francisco 49ers",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }",
        "sparql_id": "1",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/debutTeam",
        "predicate1_mention": "debuted",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/San_Francisco_49ers",
        "entity1_mention": "san francisco 49ers",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4561",
        "question": "Count the religions followed by people living in British Columbia.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/residence",
        "predicate1_mention": "",
        "predicate2_uri": "http://dbpedia.org/property/religion",
        "predicate2_mention": "religions",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/British_Columbia",
        "entity1_mention": "British Columbia",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4676",
        "question": "Estimate the number of sports divisions at the universities under international association of universities.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "sparql_id": "5",
        "classx": "1",
        "predicate1_uri": "http://dbpedia.org/ontology/affiliation",
        "predicate1_mention": "association",
        "predicate2_uri": "http://dbpedia.org/ontology/sport",
        "predicate2_mention": "sports",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/International_Association_of_Universities",
        "entity1_mention": "international association of universities",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4712",
        "question": "Count the tenants of the stadiums owned by toronto.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }",
        "sparql_id": "105",
        "classx": "3",
        "predicate1_uri": "http://dbpedia.org/property/owner",
        "predicate1_mention": "owned",
        "predicate2_uri": "http://dbpedia.org/property/tenants",
        "predicate2_mention": "tenants",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Toronto",
        "entity1_mention": "toronto",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4741",
        "question": "Name the part of Liverpool city region >",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_City_Region> <http://dbpedia.org/ontology/part> ?uri } ",
        "sparql_id": "2",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/part",
        "predicate1_mention": "part",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Liverpool_City_Region",
        "entity1_mention": "liverpool city region",
        "entity2_uri": "",
        "entity2_mention": ""
    },
    {
        "id": "4825",
        "question": "Which river goes through cohoes, NY",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri } ",
        "sparql_id": "2",
        "classx": "0",
        "predicate1_uri": "http://dbpedia.org/ontology/river",
        "predicate1_mention": "river",
        "predicate2_uri": "",
        "predicate2_mention": "",
        "type_uri": "",
        "type_mention": "",
        "entity1_uri": "http://dbpedia.org/resource/Cohoes,_New_York",
        "entity1_mention": "cohoes, NY",
        "entity2_uri": "",
        "entity2_mention": ""
    }
]