[{
    "id": "8",
    "question": "Which company which assembles its cars in Broadmeadows, Victoria?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/assembly> <http://dbpedia.org/resource/Broadmeadows,_Victoria> . ?x <http://dbpedia.org/ontology/parentCompany> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/assembly",
    "predicate1_mention": "assembles",
    "predicate2_uri": "http://dbpedia.org/ontology/parentCompany",
    "predicate2_mention": "company",
    "type_uri": "http://dbpedia.org/ontology/Automobile",
    "type_mention": "cars",
    "entity1_uri": "http://dbpedia.org/resource/Broadmeadows,_Victoria",
    "entity1_mention": "broadmeadows, victoria",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "17",
    "question": "What is the common genere of Abhijit Kunte and Kasparov ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abhijit_Kunte> <http://dbpedia.org/property/knownFor> ?uri. <http://dbpedia.org/resource/Virtual_Kasparov> <http://dbpedia.org/ontology/genre> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/knownFor",
    "predicate1_mention": "common",
    "predicate2_uri": "http://dbpedia.org/ontology/genre",
    "predicate2_mention": "genere",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Abhijit_Kunte",
    "entity1_mention": "Abhijit Kunte",
    "entity2_uri": "http://dbpedia.org/resource/Virtual_Kasparov",
    "entity2_mention": "kasparov"
},
{
    "id": "29",
    "question": "Who is the common manager of Aston Villa 2000-02 season and aldo the manager of Middlesbrough F.C. season 2009-10",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season> <http://dbpedia.org/property/name> ?uri. <http://dbpedia.org/resource/2009\u201310_Middlesbrough_F.C._season> <http://dbpedia.org/ontology/manager> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/name",
    "predicate1_mention": "Who",
    "predicate2_uri": "http://dbpedia.org/ontology/manager",
    "predicate2_mention": "manager",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season",
    "entity1_mention": "Aston Villa 2000-02 season",
    "entity2_uri": "http://dbpedia.org/resource/2009\u201310_Middlesbrough_F.C._season",
    "entity2_mention": "Middlesbrough F.C. season 2009-10"
},
{
    "id": "30",
    "question": "Name the mascot of the military branch of William Harper.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/militaryBranch",
    "predicate1_mention": "military branch",
    "predicate2_uri": "http://dbpedia.org/property/mascot",
    "predicate2_mention": "mascot",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)",
    "entity1_mention": "William Harper.",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "31",
    "question": "How many tenats have been there, of the constructions of PCL constructures?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction> . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/builder",
    "predicate1_mention": "constructions",
    "predicate2_uri": "http://dbpedia.org/ontology/tenant",
    "predicate2_mention": "tenats",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/PCL_Construction",
    "entity1_mention": "PCL constructures",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "43",
    "question": "How many people have headed organizations headquartered at Niederkirchnerstrae?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Niederkirchnerstra\u00dfe> . ?x <http://dbpedia.org/ontology/leader> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/headquarter",
    "predicate1_mention": "headquartered",
    "predicate2_uri": "http://dbpedia.org/ontology/leader",
    "predicate2_mention": "headed",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Niederkirchnerstra\u00dfe",
    "entity1_mention": "Niederkirchnerstrae",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "45",
    "question": "Which shareholder of Dagenham wind turbines is also the parent company of the Ford Falcon Cobra?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?uri. <http://dbpedia.org/resource/Dagenham_wind_turbines> <http://dbpedia.org/property/owner> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/parentCompany",
    "predicate1_mention": "parent company",
    "predicate2_uri": "http://dbpedia.org/property/owner",
    "predicate2_mention": "shareholder",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Ford_Falcon_Cobra",
    "entity1_mention": "Ford Falcon Cobra",
    "entity2_uri": "http://dbpedia.org/resource/Dagenham_wind_turbines",
    "entity2_mention": "Dagenham wind turbines"
},
{
    "id": "50",
    "question": "Which planet was discovered by Johann Gottfried and Urbain Le Verrier ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discoverer> <http://dbpedia.org/resource/Johann_Gottfried_Galle> . ?uri <http://dbpedia.org/ontology/discoverer> <http://dbpedia.org/resource/Urbain_Le_Verrier>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Planet>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/discoverer",
    "predicate1_mention": "discovered by",
    "predicate2_uri":"" ,
    "predicate2_mention": "planet",
    "type_uri": "http://dbpedia.org/ontology/Planet",
    "type_mention": "planet",
    "entity1_uri": "http://dbpedia.org/resource/Johann_Gottfried_Galle",
    "entity1_mention": "Johann Gottfried",
    "entity2_uri": "http://dbpedia.org/resource/Urbain_Le_Verrier",
    "entity2_mention": "Urbain Le Verrier"
},
{
    "id": "52",
    "question": "Name the team for which Hensley Meulens played, which was also the debut team od Steve Ontiveros ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steve_Ontiveros_(infielder)> <http://dbpedia.org/property/debutteam> ?uri. <http://dbpedia.org/resource/Hensley_Meulens> <http://dbpedia.org/ontology/team> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/debutteam",
    "predicate1_mention": "debut team",
    "predicate2_uri": "http://dbpedia.org/ontology/team",
    "predicate2_mention": "team",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Steve_Ontiveros_(infielder)",
    "entity1_mention": "od Steve Ontiveros",
    "entity2_uri": "http://dbpedia.org/resource/Hensley_Meulens",
    "entity2_mention": "Hensley Meulens"
},
{
    "id": "57",
    "question": "What company involved in the development of Sherlock did Arthur Levinson work for?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arthur_D._Levinson> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/Sherlock_(software)> <http://dbpedia.org/ontology/developer> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/occupation",
    "predicate1_mention": "work for",
    "predicate2_uri": "http://dbpedia.org/ontology/developer",
    "predicate2_mention": "development",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Arthur_D._Levinson",
    "entity1_mention": "Arthur Levinson",
    "entity2_uri": "http://dbpedia.org/resource/Sherlock_(software)",
    "entity2_mention": "sherlock"
},
{
    "id": "58",
    "question": "Which tenants of the Master Card center is also th draft team of Sam Carrick ",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/tenants",
    "predicate1_mention": "tenants",
    "predicate2_uri": "http://dbpedia.org/property/draftTeam",
    "predicate2_mention": "draft team",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/MasterCard_Centre",
    "entity1_mention": "Master Card center",
    "entity2_uri": "http://dbpedia.org/resource/Sam_Carrick",
    "entity2_mention": "Sam Carrick"
},
{
    "id": "68",
    "question": "With what company is the service OneDrive associated?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/OneDrive>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/services",
    "predicate1_mention": "service",
    "predicate2_uri": "http://dbpedia.org/ontology/Company",
    "predicate2_mention": "company",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/OneDrive",
    "entity1_mention": "onedrive",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "73",
    "question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/anthem",
    "predicate1_mention": "anthem",
    "predicate2_uri": "http://dbpedia.org/property/currency",
    "predicate2_mention": "currency",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Oj,_svijetla_majska_zoro",
    "entity1_mention": "Oj, svijetla majska zoro",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "82",
    "question": "Name the members of  boards of Freedom of the City and Trinity House?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> . ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House> . }",
    "sparql_id": "7",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/board",
    "predicate1_mention": "boards",
    "predicate2_uri": "http://dbpedia.org/ontology/board",
    "predicate2_mention": "boards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Freedom_of_the_City",
    "entity1_mention": "Freedom of the City",
    "entity2_uri": "http://dbpedia.org/resource/Trinity_House",
    "entity2_mention": "trinity house"
},
{
    "id": "87",
    "question": "What can be cooked out of things belonging to the order Sapindales?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Sapindales> . ?uri <http://dbpedia.org/ontology/ingredient> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/order",
    "predicate1_mention": "order",
    "predicate2_uri": "http://dbpedia.org/ontology/ingredient",
    "predicate2_mention": "things",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Sapindales",
    "entity1_mention": "sapindales",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "92",
    "question": "How many total religions are followed by people whose hometown is somewhere in India?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/hometown",
    "predicate1_mention": "hometown",
    "predicate2_uri": "http://dbpedia.org/property/religion",
    "predicate2_mention": "religions",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/India",
    "entity1_mention": "india",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "100",
    "question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).",
    "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }",
    "sparql_id": "111",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/commander",
    "predicate1_mention": "commander",
    "predicate2_uri": "http://dbpedia.org/ontology/commander",
    "predicate2_mention": "commander",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Roundhead_(Wyandot)",
    "entity1_mention": "Roundhead (Wyandot).",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "103",
    "question": "How many factions have fought in wars where Francois Marie Le Marchand de Lignery was involved?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Fran\u00e7ois-Marie_Le_Marchand_de_Lignery> <http://dbpedia.org/ontology/battle> ?x . ?x <http://dbpedia.org/property/combatant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
    "sparql_id": "403",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/battle",
    "predicate1_mention": "fought",
    "predicate2_uri": "http://dbpedia.org/property/combatant",
    "predicate2_mention": "wars",
    "type_uri": "http://dbpedia.org/ontology/MilitaryConflict",
    "type_mention": "fought",
    "entity1_uri": "http://dbpedia.org/resource/Fran\u00e7ois-Marie_Le_Marchand_de_Lignery",
    "entity1_mention": "Francois Marie Le Marchand de Lignery",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "104",
    "question": "Who is the leader of the town where the Myntdu river originates?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Myntdu_River> <http://dbpedia.org/ontology/origin> ?x . ?x <http://dbpedia.org/ontology/leaderName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Town>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/origin",
    "predicate1_mention": "originates",
    "predicate2_uri": "http://dbpedia.org/ontology/leaderName",
    "predicate2_mention": "leader",
    "type_uri": "http://dbpedia.org/ontology/Town",
    "type_mention": "town",
    "entity1_uri": "http://dbpedia.org/resource/Myntdu_River",
    "entity1_mention": "myntdu river",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "115",
    "question": "What were the major actions taken by the politicians living in Gales Ferry, Connecticut?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> . ?x <http://dbpedia.org/ontology/battle> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/residence",
    "predicate1_mention": "living in",
    "predicate2_uri": "http://dbpedia.org/ontology/battle",
    "predicate2_mention": "actions",
    "type_uri": "http://dbpedia.org/ontology/Politician",
    "type_mention": "politicians",
    "entity1_uri": "http://dbpedia.org/resource/Gales_Ferry,_Connecticut",
    "entity1_mention": "Gales Ferry, Connecticut",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "121",
    "question": "What is the common nickname given both to Harding academy and Lyons township high school?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harding_Academy_(Memphis)> <http://dbpedia.org/property/nickname> ?uri. <http://dbpedia.org/resource/Lyons_Township_High_School> <http://dbpedia.org/property/nickname> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/nickname",
    "predicate1_mention": "nickname",
    "predicate2_uri": "http://dbpedia.org/property/nickname",
    "predicate2_mention": "nickname",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Harding_Academy_(Memphis)",
    "entity1_mention": "harding academy",
    "entity2_uri": "http://dbpedia.org/resource/Lyons_Township_High_School",
    "entity2_mention": "Lyons township high school"
},
{
    "id": "122",
    "question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
    "sparql_id": "106",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/ground",
    "predicate1_mention": "stadium",
    "predicate2_uri": "http://dbpedia.org/property/youthclubs",
    "predicate2_mention": "youth club",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Rosario,_Santa_Fe",
    "entity1_mention": "the Rosario, Santa Fe stadium",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "128",
    "question": "Did Steve Sampson manage a club of Santa Clara university",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/managerClub",
    "predicate1_mention": "manage a club",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Steve_Sampson",
    "entity1_mention": "Steve Sampson",
    "entity2_uri": "http://dbpedia.org/resource/Santa_Clara_University",
    "entity2_mention": "Santa Clara university"
},
{
    "id": "129",
    "question": "What newspapers's owners is Schibsted",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/owners",
    "predicate1_mention": "owners",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Newspaper",
    "type_mention": "newspapers's",
    "entity1_uri": "http://dbpedia.org/resource/Schibsted",
    "entity1_mention": "schibsted",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "141",
    "question": "Music for what was made by someone who died of a cardiovascular disease?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Cardiovascular_disease> . ?uri <http://dbpedia.org/property/music> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/deathCause",
    "predicate1_mention": "died of",
    "predicate2_uri": "http://dbpedia.org/property/music",
    "predicate2_mention": "music",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Cardiovascular_disease",
    "entity1_mention": "cardiovascular disease",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "152",
    "question": "Joe Hahn is the member of what band?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Joe_Hahn>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/currentMembers",
    "predicate1_mention": "member",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Band",
    "type_mention": "band",
    "entity1_uri": "http://dbpedia.org/resource/Joe_Hahn",
    "entity1_mention": "Joe Hahn",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "168",
    "question": "Where does the successor of Thongsuk Samdaengpan reside?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thongsuk_Samdaengpan> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/ontology/location> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/successor",
    "predicate1_mention": "successor",
    "predicate2_uri": "http://dbpedia.org/ontology/location",
    "predicate2_mention": "reside",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Thongsuk_Samdaengpan",
    "entity1_mention": "Thongsuk Samdaengpan",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "183",
    "question": "Count the wars in which people awarded with the Croix de guerre fought.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Croix_de_guerre_1939\u20131945_(France)> . ?x <http://dbpedia.org/property/battles> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/awards",
    "predicate1_mention": "awarded",
    "predicate2_uri": "http://dbpedia.org/property/battles",
    "predicate2_mention": "wars",
    "type_uri": "http://dbpedia.org/ontology/MilitaryConflict",
    "type_mention": "count",
    "entity1_uri": "http://dbpedia.org/resource/Croix_de_guerre_1939\u20131945_(France)",
    "entity1_mention": "Croix de guerre",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "187",
    "question": "How many battles have involved commanders of 1st Free French Division?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/1st_Free_French_Division> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/property/battles> ?uri  . }",
    "sparql_id": "103",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/notableCommanders",
    "predicate1_mention": "commanders",
    "predicate2_uri": "http://dbpedia.org/property/battles",
    "predicate2_mention": "battles",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/1st_Free_French_Division",
    "entity1_mention": "1st Free French Division",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "188",
    "question": "Count the number of cities on the Mediterranean Sea?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri  . }",
    "sparql_id": "102",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/cities",
    "predicate1_mention": "cities",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mediterranean_Sea",
    "entity1_mention": "the Mediterranean Sea",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "194",
    "question": "Which executive producer of Into the Dalek also produced Wizards vs Aliens ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Into_the_Dalek> <http://dbpedia.org/property/executiveProducer> ?uri. <http://dbpedia.org/resource/Wizards_vs_Aliens> <http://dbpedia.org/ontology/producer> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/executiveProducer",
    "predicate1_mention": "executive producer",
    "predicate2_uri": "http://dbpedia.org/ontology/producer",
    "predicate2_mention": "producer",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Into_the_Dalek",
    "entity1_mention": "Into the Dalek",
    "entity2_uri": "http://dbpedia.org/resource/Wizards_vs_Aliens",
    "entity2_mention": "Wizards vs Aliens"
},
{
    "id": "205",
    "question": "List the cities which share the same water body as that of Florida ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Florida> . ?x <http://dbpedia.org/property/cities> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BodyOfWater>}",
    "sparql_id": "311",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/cities",
    "predicate1_mention": "cities",
    "predicate2_uri": "http://dbpedia.org/property/cities",
    "predicate2_mention": "cities",
    "type_uri": "http://dbpedia.org/ontology/BodyOfWater",
    "type_mention": "the same water body as",
    "entity1_uri": "http://dbpedia.org/resource/Florida",
    "entity1_mention": "florida",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "208",
    "question": "From how many coutries do companies come, which are headquartered in the Klang Valley?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Klang_Valley> . ?x <http://dbpedia.org/property/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/headquarters",
    "predicate1_mention": "headquartered",
    "predicate2_uri": "http://dbpedia.org/property/country",
    "predicate2_mention": "coutries",
    "type_uri": "http://dbpedia.org/ontology/Country",
    "type_mention": "coutries",
    "entity1_uri": "http://dbpedia.org/resource/Klang_Valley",
    "entity1_mention": "Klang Valley",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "210",
    "question": "What are the notable works of the person who produced Queer as Folk?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Queer_as_Folk_(UK_TV_series)> <http://dbpedia.org/ontology/producer> ?x . ?x <http://dbpedia.org/property/notableworks> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "303",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/producer",
    "predicate1_mention": "produced",
    "predicate2_uri": "http://dbpedia.org/property/notableworks",
    "predicate2_mention": "notable works",
    "type_uri": "http://dbpedia.org/ontology/Person",
    "type_mention": "person",
    "entity1_uri": "http://dbpedia.org/resource/Queer_as_Folk_(UK_TV_series)",
    "entity1_mention": "Queer as Folk",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "217",
    "question": "The authors of Zhorstoke nebo was influenced by whom ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Zhorstoke_nebo> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/influencedBy> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/author",
    "predicate1_mention": "authors",
    "predicate2_uri": "http://dbpedia.org/ontology/influencedBy",
    "predicate2_mention": "influenced by",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Zhorstoke_nebo",
    "entity1_mention": "zhorstoke nebo",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "219",
    "question": "Who all have rented the stadium whose architect is Populous?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/architect> <http://dbpedia.org/resource/Populous_(company)> . ?x <http://dbpedia.org/ontology/tenant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/architect",
    "predicate1_mention": "architect",
    "predicate2_uri": "http://dbpedia.org/ontology/tenant",
    "predicate2_mention": "rented",
    "type_uri": "http://dbpedia.org/ontology/Stadium",
    "type_mention": "stadium",
    "entity1_uri": "http://dbpedia.org/resource/Populous_(company)",
    "entity1_mention": "populous",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "226",
    "question": "Who is the performer of album which has the song To Where You Are ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/album",
    "predicate1_mention": "album",
    "predicate2_uri": "http://dbpedia.org/ontology/artist",
    "predicate2_mention": "performer",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/To_Where_You_Are",
    "entity1_mention": "To Where You Are",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "228",
    "question": "How many people live in Wilton, Connecticut?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Wilton,_Connecticut>  . }",
    "sparql_id": "101",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/property/residence",
    "predicate1_mention": "live in",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Wilton,_Connecticut",
    "entity1_mention": "Wilton, Connecticut",
    "entity2_uri": "",
    "entity2_mention": ""
}
]