[{
    "id": "2654",
    "question": "List all those whose relatives' nationality is United States.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/nationality",
    "predicate1_mention": "nationality",
    "predicate2_uri": "http://dbpedia.org/ontology/relative",
    "predicate2_mention": "relatives'",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/United_States",
    "entity1_mention": "United States",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2656",
    "question": "Which Stanley Kubrick's movie has music by Laurie Johnson?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Stanley_Kubrick> . ?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Laurie_Johnson>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/director",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/music",
    "predicate2_mention": "music",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movie",
    "entity1_uri": "http://dbpedia.org/resource/Stanley_Kubrick",
    "entity1_mention": "Stanley Kubrick",
    "entity2_uri": "http://dbpedia.org/resource/Laurie_Johnson",
    "entity2_mention": "Laurie Johnson"
},
{
    "id": "2659",
    "question": "Name the TV show with distributor as Broadcast syndication and has theme music composed by Primus ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Broadcast_syndication> . ?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Primus_(band)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/distributor",
    "predicate1_mention": "distributor",
    "predicate2_uri": "http://dbpedia.org/property/themeMusicComposer",
    "predicate2_mention": "theme music composed",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "TV show",
    "entity1_uri": "http://dbpedia.org/resource/Broadcast_syndication",
    "entity1_mention": "Broadcast syndication",
    "entity2_uri": "http://dbpedia.org/resource/Primus_(band)",
    "entity2_mention": "primus"
},
{
    "id": "2666",
    "question": "Name some books by Spanish speaking authors.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/language",
    "predicate1_mention": "speaking",
    "predicate2_uri": "http://dbpedia.org/property/author",
    "predicate2_mention": "authors",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Spanish_language",
    "entity1_mention": "spanish",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2671",
    "question": "List the birthplace of the medicians who studied in Harvard.",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Harvard_Medical_School> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Medician>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/institution",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/birthPlace",
    "predicate2_mention": "birthplace",
    "type_uri": "http://dbpedia.org/ontology/Medician",
    "type_mention": "medicians",
    "entity1_uri": "http://dbpedia.org/resource/Harvard_Medical_School",
    "entity1_mention": "Harvard",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2684",
    "question": "Which countries were the first to play Gumus and Ne daj se, Nina?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)> <http://dbpedia.org/property/firstAired> ?uri. <http://dbpedia.org/resource/Ne_daj_se,_Nina> <http://dbpedia.org/property/firstAired> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/firstAired",
    "predicate1_mention": "first",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)",
    "entity1_mention": "Gumus",
    "entity2_uri": "http://dbpedia.org/resource/Ne_daj_se,_Nina",
    "entity2_mention": "Ne daj se, Nina"
},
{
    "id": "2688",
    "question": "Who were the pole drivers in GP when Damon hill was a first driver?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/firstDriver> <http://dbpedia.org/resource/Damon_Hill> . ?x <http://dbpedia.org/ontology/poleDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}",
    "sparql_id": "305",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/firstDriver",
    "predicate1_mention": "first driver",
    "predicate2_uri": "http://dbpedia.org/ontology/poleDriver",
    "predicate2_mention": "pole drivers",
    "type_uri": "http://dbpedia.org/ontology/GrandPrix",
    "type_mention": "GP",
    "entity1_uri": "http://dbpedia.org/resource/Damon_Hill",
    "entity1_mention": "damon hill",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2689",
    "question": "How many awards have royal designers for industry awardwinners got?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Royal_Designers_for_Industry> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/awards",
    "predicate1_mention": "awards",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Award",
    "type_mention": "awards",
    "entity1_uri": "http://dbpedia.org/resource/Royal_Designers_for_Industry",
    "entity1_mention": "royal designers for industry",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2705",
    "question": "What is the river which comes from Southend on Sea mountain?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Southend-on-Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/mouthMountain",
    "predicate1_mention": "mountain",
    "predicate2_uri": "http://dbpedia.org/ontology/River",
    "predicate2_mention": "river",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Southend-on-Sea",
    "entity1_mention": "Southend on Sea",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2710",
    "question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/party",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/religion",
    "predicate2_mention": "religions",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Malaysian_Chinese_Association",
    "entity1_mention": "Malaysian and Chinese association",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2714",
    "question": "What is the mascot of the Royal Australian Air Force and Austin College?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Australian_Air_Force> <http://dbpedia.org/property/mascot> ?uri. <http://dbpedia.org/resource/Austin_College> <http://dbpedia.org/property/mascot> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/mascot",
    "predicate1_mention": "mascot",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Royal_Australian_Air_Force",
    "entity1_mention": "Royal Australian Air Force",
    "entity2_uri": "http://dbpedia.org/resource/Austin_College",
    "entity2_mention": "Austin College"
},
{
    "id": "2728",
    "question": "How many people live in the Beverly Hills, California?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Beverly_Hills,_California>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
    "sparql_id": "401",
    "classx": "2",
    "predicate1_uri": "http://dbpedia.org/ontology/residence",
    "predicate1_mention": "live in",
    "predicate2_uri": "http://dbpedia.org/ontology/Person",
    "predicate2_mention": "people",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Beverly_Hills,_California",
    "entity1_mention": "Beverly Hills, California",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2748",
    "question": "Name the common record label of I pray on Christmas and Next Thing ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/I_Pray_on_Christmas> <http://dbpedia.org/property/label> ?uri. <http://dbpedia.org/resource/Next_Thing> <http://dbpedia.org/ontology/recordLabel> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/label",
    "predicate1_mention": "label",
    "predicate2_uri": "http://dbpedia.org/ontology/recordLabel",
    "predicate2_mention": "record label",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/I_Pray_on_Christmas",
    "entity1_mention": "I pray on Christmas",
    "entity2_uri": "http://dbpedia.org/resource/Next_Thing",
    "entity2_mention": "Next Thing"
},
{
    "id": "2750",
    "question": "What is the common place of study for jack McGregor and Philip W. Pillsbury ?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?uri. <http://dbpedia.org/resource/Philip_W._Pillsbury> <http://dbpedia.org/property/education> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/education",
    "predicate1_mention": "place of",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Jack_McGregor",
    "entity1_mention": "jack McGregor",
    "entity2_uri": "http://dbpedia.org/resource/Philip_W._Pillsbury",
    "entity2_mention": "Philip W. Pillsbury"
},
{
    "id": "2754",
    "question": "Which television show's theme music composer is Gary Portnoy and subsequent work is Frasier?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Gary_Portnoy> . ?uri <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Frasier>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/themeMusicComposer",
    "predicate1_mention": "theme music composer",
    "predicate2_uri": "http://dbpedia.org/ontology/subsequentWork",
    "predicate2_mention": "subsequent work",
    "type_uri": "http://dbpedia.org/ontology/TelevisionShow",
    "type_mention": "television show's",
    "entity1_uri": "http://dbpedia.org/resource/Gary_Portnoy",
    "entity1_mention": "Gary Portnoy",
    "entity2_uri": "http://dbpedia.org/resource/Frasier",
    "entity2_mention": "frasier"
},
{
    "id": "2763",
    "question": "Does Lionel Messi play in the Argentina National Football Team?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Lionel_Messi> <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Argentina_national_football_team> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/nationalteam",
    "predicate1_mention": "national football team",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Lionel_Messi",
    "entity1_mention": "lionel messi",
    "entity2_uri": "http://dbpedia.org/resource/Argentina_national_football_team",
    "entity2_mention": "argentina national football team"
},
{
    "id": "2765",
    "question": "Was X the Unknown edited by James needs?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/X_the_Unknown> <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/James_Needs> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/editing",
    "predicate1_mention": "edited",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/X_the_Unknown",
    "entity1_mention": "X the Unknown",
    "entity2_uri": "http://dbpedia.org/resource/James_Needs",
    "entity2_mention": "James needs"
},
{
    "id": "2791",
    "question": "With which musical artist is the music group which sung Mind Blowin' related to ?  ",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/musicalArtist",
    "predicate1_mention": "musical artist",
    "predicate2_uri": "http://dbpedia.org/ontology/associatedMusicalArtist",
    "predicate2_mention": "musical artist",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)",
    "entity1_mention": "sung Mind Blowin",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2820",
    "question": "Whose youth clubs used to participate in Argentine Primera Division?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Argentine_Primera_Divisi\u00f3n> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
    "sparql_id": "6",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/league",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/youthclubs",
    "predicate2_mention": "youth clubs",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Argentine_Primera_Divisi\u00f3n",
    "entity1_mention": "Argentine Primera Division",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2822",
    "question": "What are the movies whose music composer is Akira Ifukube?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Akira_Ifukube>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/musicComposer",
    "predicate1_mention": "music composer",
    "predicate2_uri": "http://dbpedia.org/ontology/Film",
    "predicate2_mention": "movies",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Akira_Ifukube",
    "entity1_mention": "Akira Ifukube",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2835",
    "question": "Which work is both Neil Cross and Lars Pearson both known for ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?uri. <http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?uri . }",
    "sparql_id": "15",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/notableWork",
    "predicate1_mention": "work",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Neil_Cross",
    "entity1_mention": "Neil Cross",
    "entity2_uri": "http://dbpedia.org/resource/Lars_Pearson",
    "entity2_mention": "Lars Pearson"
},
{
    "id": "2842",
    "question": "Name the college of the Allama Matthews which also has affiliation with  Monroe Carell Jr. Children's Hospital at Vanderbilt",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Allama_Matthews> <http://dbpedia.org/ontology/college> ?uri. <http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> <http://dbpedia.org/property/affiliation> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/college",
    "predicate1_mention": "college",
    "predicate2_uri": "http://dbpedia.org/property/affiliation",
    "predicate2_mention": "affiliation",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Allama_Matthews",
    "entity1_mention": "Allama Matthews",
    "entity2_uri": "http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt",
    "entity2_mention": "Monroe Carell Jr. Children's Hospital at Vanderbilt"
},
{
    "id": "2855",
    "question": "Is Another Lonely Night in New York by the musical band Robin Gibb?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Another_Lonely_Night_in_New_York> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Robin_Gibb> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/musicalBand",
    "predicate1_mention": "musical band",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Another_Lonely_Night_in_New_York",
    "entity1_mention": "Another Lonely Night in New York",
    "entity2_uri": "http://dbpedia.org/resource/Robin_Gibb",
    "entity2_mention": "robin gibb"
},
{
    "id": "2859",
    "question": "is ANYway in the Quack album?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/ANYway> <http://dbpedia.org/ontology/album> <http://dbpedia.org/resource/Quack_(album)> }",
    "sparql_id": "151",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/ontology/album",
    "predicate1_mention": "album",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/ANYway",
    "entity1_mention": "anyway",
    "entity2_uri": "http://dbpedia.org/resource/Quack_(album)",
    "entity2_mention": "quack album"
},
{
    "id": "2867",
    "question": "Which video game composed by Hirokazu Tanaka can be played on virtual Console ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console> . ?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Hirokazu_Tanaka>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/computingPlatform",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/property/composer",
    "predicate2_mention": "composed",
    "type_uri": "http://dbpedia.org/ontology/VideoGame",
    "type_mention": "video game",
    "entity1_uri": "http://dbpedia.org/resource/Virtual_Console",
    "entity1_mention": "virtual console",
    "entity2_uri": "http://dbpedia.org/resource/Hirokazu_Tanaka",
    "entity2_mention": "hirokazu tanaka"
},
{
    "id": "2895",
    "question": "Is Maldives a member ofof South Asia Subregional Economic Cooperation?",
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/South_Asia_Subregional_Economic_Cooperation> <http://dbpedia.org/property/membership> <http://dbpedia.org/resource/Maldives> }",
    "sparql_id": "152",
    "classx": "4",
    "predicate1_uri": "http://dbpedia.org/property/membership",
    "predicate1_mention": "member",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/South_Asia_Subregional_Economic_Cooperation",
    "entity1_mention": "South Asia Subregional Economic Cooperation",
    "entity2_uri": "http://dbpedia.org/resource/Maldives",
    "entity2_mention": "maldives"
},
{
    "id": "2897",
    "question": "For how many things are people famous, who were born in Nebraska?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Nebraska> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/birthPlace",
    "predicate1_mention": "born in",
    "predicate2_uri": "http://dbpedia.org/ontology/knownFor",
    "predicate2_mention": "famous",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Nebraska",
    "entity1_mention": "nebraska",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2902",
    "question": "Name a famous relative of barry voight",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/relative",
    "predicate1_mention": "relative",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Barry_Voight",
    "entity1_mention": "barry voight",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2905",
    "question": "What awards have been given to some screenwriters?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
    "sparql_id": "5",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/occupation",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/award",
    "predicate2_mention": "awards",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Screenwriter",
    "entity1_mention": "screenwriters",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2924",
    "question": "List the movies produced by Michael Deeley ?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
    "sparql_id": "301",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/producer",
    "predicate1_mention": "produced",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "http://dbpedia.org/ontology/Film",
    "type_mention": "movies",
    "entity1_uri": "http://dbpedia.org/resource/Michael_Deeley",
    "entity1_mention": "michael deeley",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2929",
    "question": "In which state is the team, which has John Roeslein?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Roeslein> <http://dbpedia.org/ontology/team> ?x . ?x <http://dbpedia.org/property/state> ?uri  . }",
    "sparql_id": "3",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/team",
    "predicate1_mention": "team,",
    "predicate2_uri": "http://dbpedia.org/property/state",
    "predicate2_mention": "state",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/John_Roeslein",
    "entity1_mention": "John Roeslein",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2934",
    "question": "How many members are there of the organization headquartered at Amstelveen?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Amstelveen> . ?x <http://dbpedia.org/property/membership> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/property/headquarters",
    "predicate1_mention": "headquartered",
    "predicate2_uri": "http://dbpedia.org/property/membership",
    "predicate2_mention": "members",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Amstelveen",
    "entity1_mention": "amstelveen",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2941",
    "question": "What is the common award won by Charles LeMaire and Eric Roth",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Eric_Roth> <http://dbpedia.org/ontology/award> ?uri} ",
    "sparql_id": "16",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/property/awards",
    "predicate1_mention": "award",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Charles_LeMaire",
    "entity1_mention": "Charles LeMaire",
    "entity2_uri": "http://dbpedia.org/resource/Eric_Roth",
    "entity2_mention": "Eric Roth"
},
{
    "id": "2943",
    "question": "Count the number of first drivers in all the GPs where Mika Hakkinen was a first driver?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/poleDriver> <http://dbpedia.org/resource/Mika_H\u00e4kkinen> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RacingDriver>}",
    "sparql_id": "405",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/poleDriver",
    "predicate1_mention": "driver",
    "predicate2_uri": "http://dbpedia.org/ontology/firstDriver",
    "predicate2_mention": "first drivers",
    "type_uri": "http://dbpedia.org/ontology/RacingDriver",
    "type_mention": "driver",
    "entity1_uri": "http://dbpedia.org/resource/Mika_H\u00e4kkinen",
    "entity1_mention": "Mika Hakkinen",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2951",
    "question": "In how many places was the album of King Crimson recorded?",
    "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/King_Crimson> . ?x <http://dbpedia.org/ontology/recordedIn> ?uri  . }",
    "sparql_id": "105",
    "classx": "3",
    "predicate1_uri": "http://dbpedia.org/ontology/artist",
    "predicate1_mention": "",
    "predicate2_uri": "http://dbpedia.org/ontology/recordedIn",
    "predicate2_mention": "recorded",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/King_Crimson",
    "entity1_mention": "King Crimson",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2952",
    "question": "Which musical artist collaborated with Tony Allen (musician) and label is Victor Entertainment?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Allen_(musician)> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/associatedMusicalArtist",
    "predicate1_mention": "musical artist",
    "predicate2_uri": "http://dbpedia.org/property/label",
    "predicate2_mention": "label",
    "type_uri": "http://dbpedia.org/ontology/MusicalArtist",
    "type_mention": "musical artist",
    "entity1_uri": "http://dbpedia.org/resource/Tony_Allen_(musician)",
    "entity1_mention": "Tony Allen (musician)",
    "entity2_uri": "http://dbpedia.org/resource/Victor_Entertainment",
    "entity2_mention": "Victor Entertainment"
},
{
    "id": "2960",
    "question": "What is the name of Mary's divine child?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Mary_(mother_of_Jesus)>  . }",
    "sparql_id": "1",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/ontology/parent",
    "predicate1_mention": "child",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mary_(mother_of_Jesus)",
    "entity1_mention": "Mary's divine",
    "entity2_uri": "",
    "entity2_mention": ""
},
{
    "id": "2970",
    "question": "Name the city with leader as Esther Alder and neighboring municipality as Pregny-Chambsy?",
    "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> . ?uri <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>}",
    "sparql_id": "308",
    "classx": "1",
    "predicate1_uri": "http://dbpedia.org/ontology/mayor",
    "predicate1_mention": "leader",
    "predicate2_uri": "http://dbpedia.org/ontology/neighboringMunicipality",
    "predicate2_mention": "neighboring municipality",
    "type_uri": "http://dbpedia.org/ontology/Location",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Esther_Alder",
    "entity1_mention": "esther alder",
    "entity2_uri": "http://dbpedia.org/resource/Pregny-Chamb\u00e9sy",
    "entity2_mention": "Pregny-Chambsy"
},
{
    "id": "2972",
    "question": "List all the members of  Mekong River Commission?",
    "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mekong_River_Commission> <http://dbpedia.org/property/membership> ?uri } ",
    "sparql_id": "2",
    "classx": "0",
    "predicate1_uri": "http://dbpedia.org/property/membership",
    "predicate1_mention": "members",
    "predicate2_uri": "",
    "predicate2_mention": "",
    "type_uri": "",
    "type_mention": "",
    "entity1_uri": "http://dbpedia.org/resource/Mekong_River_Commission",
    "entity1_mention": "Mekong River Commission",
    "entity2_uri": "",
    "entity2_mention": ""
}
]